{"Action": {"Rebel Moon: Part One - A Child of Fire": {"Directors": "Zack Snyder", "Year of Release": "2023", "Content Rating": "PG-13", "Runtime": "2h 13m", "IMDB Rating": "5.7", "Reviews": [{"text": "I think Zack Snyder didn't really do much research into this one. Maybe it's because it's a Netflix thing, I am not sure. There's so much borrowing from several other popular movies that I just wasn't invested in the story because it was all tooo basic and predictable.You had the Thanos and Gamora moment in there, you are the Starwars Resistance vs The First Order moment in there. You had the Darthvader type figure in there. You had the Kylo Ren character in there. And the worlds looked like something from a Starwars episode.Also the whole story was just weak, too weak for a director like Zack. I mean we've seen it done so many times from Lord of the Rings, to Game of Thrones, to even The Avengers. You are threatened by a bigger force, so you go around recruiting people to help you fight this force. That's basically it. There wasn't any rich subplot like we see in eg. Dune. Just very basic.Does it warrant a part 2, I strongly don't think it did. It's lazy writing and directing and shouldn't be encouraged.All in all, it's an ok movie. It's not bad like some reviews are saying. The effects are spot on, I loved the cinematography. The only drawbacks for me were the weak storyline, the awful fight sequence, the casting could have been better and the all too familiar scenes.", "review-date": "28 December 2023", "review-score": "6"}, {"text": "Imagine you're a twelve year old boy, having watched some cool movies for the first time five minutes ago, having your bootleg toys of popular franchises and smashing them together in dirt saying \"and then\" every couple of minutes. Now imagine you get tens, if not hundreds of millions of dollars to make that a movie.Now imagine that being better than this.I thought Sucker Punch was bad. This is somehow worse.Below average acting, uninteresting characters, worldbuilding hastily slapped from who knows how many better franchises, including WH40K, Star Wars, World War II, Kurosawa, probably some anime and much more.Visually I would describe this as \"vulgar\", an ocular insult. And so much slo-mo, it's just silly. It just looks and feels bad, atmosphere is equal to a junkyard.Villains are so bad, heroes are no better. I get Netflix does what Netflix do, making bad expensive movies, that people watch. But this is insane.I want to make something very clear - it might look like a good movie, it is not. You shouldn't watch this and promote this. Ask better for your money.", "review-date": "22 December 2023", "review-score": "2"}, {"text": "The biggest problem of the movie is the plot. It is just bad. And not just the main storyline which makes little sense and the villains are comedic, but almost every interaction ends up with the viewer asking \"but, why?\" or \"how does it even make sense?\".The assembly of heroes (what the movie is about) is also rushed as hell, and the motivation of the people to join is straight-up nonexistent in most of the cases and is simply skipped entirely.As for the villain who comes to find mysterious troubling rebels, apparently every single person knows who are the rebels and how to find them and shares that information to the first stranger they meet. It's not like they are even hiding.Next, combat and action scenes. Blasters that penetrate people in armor through, but can't penetrate a thin piece of wood. Remember when in the new Star Wars trilogy a red guard could strike Ray but was just making dumb random moves to simulate action? Well, it's absolutely the same here. Maximum drama, lots of slow motion, frequent switch of the scenes every few seconds and very little sense.The acting is ok, but it's difficult to judge the actors if they do good because the script tells them to follow an unnatural character arc in the first place. I'd say Sofia played Kora well, but Kora is just a poor character which is out of place in the very story she's central.It's not all bad. The picture is nice.I'd say it's the most disappointing Snyder's movie so far.", "review-date": "24 December 2023", "review-score": "5"}, {"text": "A purely visual spectacle, and not even a great one at that, hidden behind a muddy filter.Every scene is farcically derivative of Star Wars, Battle Beyond the Stars, Warhammer 40K, Turok, and many other, better sources.Boutella just isn't credible leading lady material, characters are zero dimensional points, it's gratingly expositional, and the action scenes are comically ineptly choreographed, burdened with jump-cuts and slow-slow-slower-motion.The plot is a series of \"And then, and then, and then\" fetch-quests that seem like an episodic TV show, crammed into a badly edited 2 1/4 hours that feels much longer. And it ends with a jarringly pointless \"To be continued\".But... why, film, why? Why continue?", "review-date": "30 December 2023", "review-score": "3"}, {"text": "I wanted this to be good so badly. Like really badly.Other than the world design and effects, there really isn't much else to salvage from it.In true Snyder style we've got lens flare and slow motion, but this time he's dialled it up over the top.Some of the action scenes are absolutely ruined from way too much diving in and out of slow motion.The biggest disappointment is the writing.The first 70% of the film is absolutely a waste of time and not needed.You don't find out most of the characters actual relevance until the back end of the film.Everything before that is a mixture of utterly pointless painfully boring scenes done for the sole purpose of filler.Looks great, but that's all.", "review-date": "22 December 2023", "review-score": "4"}, {"text": "As an other reviewer wrote, there are wooden language, wooden expressions and wooden dialogue.The first ting I noticed in the movie was the words the actors spoke seemed like they had been written by a teenager... so many pointless words.Then there where the actors speaking the words, they just seemed wierd and emotionless.Then there are the action scenes. There are a lot of them, and they could have been really good. But the editing are just a bunch of normal speed, slow speed clipping to make it look good, and the bad guys just stand still doing nothing while the \"hero\" spends minutes moving around in the open...CGI/Greenscreen galore.. but very well done. So this is perhaps the strongest part of the movie.Waisted and nonsense slowmo sections... there are so many of them... and they are so pointless and gives nothing to the movie. There are movies and directors that know how to use slow motion sequences in a movie, and then there are this movie and director, that did not take that class... it's just a waist of time.In summary, if you are able to ignore all the writing, dialogue, acting/directing issues... its a passable scifi action movie.The movie could have been so much better, because there is a decent enough story underneath.. and they obviously had enough money to do what they wanted...I'm assuming Netflix payed for this. So I'm guessing that there where a big payday for writer/director and no requirements for quality on the delivered product. So they just cut from the budget anyone that could have given the director feedback on the uality issues.", "review-date": "22 December 2023", "review-score": "4"}, {"text": "Well, after reading some of the reviews I sort of braced for impact. But it was not as bad as I expacted. True, the acting is well... lets say errr... below par. But so was the acting in the first Starwars movies to be honest. The graphics where above par, way beyond to my surprise. Does this make up for the not-thrar-good acting? Nope. But it eases the pain. Do I care that it has a lot in common with the original, with Starwars? Hmmm... a bit, bit not so much that I bothered to be honest. This movie is good enough on its own. Give it a chance and watch it without your mind made up already. You might end up liking it.", "review-date": "31 December 2023", "review-score": "7"}, {"text": "Ah, the bittersweet symphony of \"Rebel Moon.\" I hear you there, fellow traveler to Pandora and Tatooine. We can both appreciate Zack Snyder's stylistic flourishes - the slow-mo ballet of violence, the operatic landscapes, the characters carved from myth. But as the curtain falls on \"Part One,\" a mournful sigh escapes. This could have been a glorious space opera, a love letter to sci-fi's golden age, yet it stumbles over familiar tropes and squanders its vast potential.Snyder's fingerprints are all over the screen. The visuals are undeniable - gargantuan spaceships casting ominous shadows, crimson blades carving through darkness, desert vistas whispering forgotten empires. He paints with a grand brush, but the canvas starts to feel repetitive. We've seen the grizzled warrior with a troubled past, the damsel in distress with hidden fire, the villain who chews scenery like it's his birthright. It's a well-worn costume rack, and while Snyder drapes it with his signature flair, the threads of originality begin to fray.The plot, a familiar melody of rebellion against tyranny, starts strong but loses its harmonic richness. Characters, instead of complex chords, become predictable arpeggios. Their motivations are thinly veiled, their backstories a rushed montage. The dialogue, meant to resonate like thunder, echoes with the hollowness of recycled sci-fi cliches.What hurts most is the unrealized potential. The glimpses of a deeper world, the whispers of ancient powers, the seeds of a nuanced conflict - all wither in the harsh glare of action sequences. Snyder loves his spectacle, and \"Rebel Moon\" is awash in it, but spectacle alone can't sustain a film. We crave emotion, depth, resonance. We want to be swept away, not merely bombarded.So, as the credits roll, a bittersweet symphony resonates. We acknowledge the maestro's talent, the flashes of brilliance, the echoes of what could have been. But the lingering taste is one of missed notes, of potential left unrealized. \"Rebel Moon\" is a spectacle, no doubt, but a hollow one, leaving us yearning for the sci-fi opera that might have been.", "review-date": "17 December 2023", "review-score": "5"}, {"text": "The Zack Snyder fanboy cult is legion. That's fine. Every crowd likes their own kind of music.Objectively this is what Snyder produces: gritty, dark, unhappy, overly serious, tedious stuff. Most of its average, with a few exceptions. But there's always cool stuff to look at. The usual Snyder-verse effects are on full display: long establishing shots, fight scenes using slo-mo and speed shifting, and massive objects being viewed by terrified onlookers. He's kind of a poor man's Villaneuve.The rabid followers can say what they want about \"The Snyder Cut\" Justice League, but the reality is there's no broad market for unrelentingly dismal sludge. Why isn't there a Judge Dredd movie coming out soon? Or another Punisher film? Dark and too serious isn't fun to spend money on. Especially when it's not all that new.I do have to laugh though, at all the media hacks that are pissing and moaning about how derivative this is. And it is. But it mostly feels that way because Snyder wrote a script for a stand alone Star Wars story and was told by Lucasfilm (or maybe it was Disney) \"thanks, but no thanks\".So he went to the streaming giant that loves to produce expensive projects so they can cancel them before they can develop any traction. This is that script brought to life. Or death, as Netflix may have it.It's not nice to hammer on creatives. But I for one am sick and tired of the waif-ish 90 pound girl warrior movies that have been all the rage lately. And while Boutella (Kora, the protagonist in Rebel Moon) was excellent as Jaylah in Star Trek Beyond, I'm over it. Other than Gunpowder Milkshake (which was hilarious) it's all a bunch of BS. I don't care if Maggie Q or Daisy Ridley (both decent actresses btw) are in it or not (they aren't in this, in case you're confused), it's stupid. It was bad enough when Arnold, Sly and Bruce were ignoring the laws of physics in their various franchises, but we're all a little more savvy now and wouldn't buy that stuff from them in today's market either. But maybe I'm wrong, because there are now 4 Expendables movies in existence. God save us from the people who are buying tickets to those.The review of the performances? Boutella? Strictly two note delivery. Honsu? Not bad, dour and angry. Hunaam? Possibly the most nuanced.The plot? Star Wars excuse aside, it's a mess. The preposterousness of engaging with their Seven Samurai recruits at moments when each is faced with a crucial test is just lazy storytelling.The villains? One dimensional and very unconvincing. One, the most visible, a bizarre space nazi foil, is so predictable and poorly written that he could be dropped into any of a number of other films. The other? The supposedly all powerful Big Bad who apparently has the power of life over death is a comic book trope of a villain. Evil for evil's sake. And the dumb resurrection of the former by the latter begs the question: how do you threaten a subordinate that you just brought back to life? And instead of original visuals, Snyder dips deeply into the visually obscene as replacement for creativity. The very last image is of a rogue droid, having gone \"wild\" after killing one of its \"masters\", standing up in a field, wearing a crown of deer antlers. Now that would have been a story worth exploring.There are much better choices to spend two hours on. Watch Rogue One, which at its core, this movie wishes it was.It's free to subscribers now, so have at it. Can't wait to see those reviews pour in.", "review-date": "18 December 2023", "review-score": "5"}, {"text": "This is probably one of the worst films made in the last 10 year ,but the biggest question is who decided this was a good idea, and who keeps giving Zack Snyder money to make this crap!The dialogue and the cinema photography looks like it came out of a PS4 cut scene. As for the action sequences, imagine if a fanboy, got a hold of a camcorder and shot a load of matrix style inspired scenes, after the 2nd sequence it becomes quite annoyed and nauseating.It Almost like they started filming, then decided to write a plot based on previous literature or films. Every actor in the film looks like they're reciting lines from hostage video.It's telling that they couldn't get a proper studio to finance this film and instead had to go straight to streaming as no one would pay decent money to see this.The fact they've already produced a sequel, only tells you how delusional they were when they put this thing into production.", "review-date": "24 December 2023", "review-score": "3"}]}, "Reacher": {"Directors": "Nick Santora", "Year of Release": "2022– ", "Content Rating": "A", "Runtime": "49m", "IMDB Rating": "8.1", "Reviews": [{"text": "Jack Reacher never loses and despite some bad situations he always comes out on top, it's a bit silly but it makes for relaxing and fun action, this show is the same, I was worried they would try and tone it down, but no.If you like a good mystery where the hero takes everybody on but wins you'll enjoy Reacher. It's strangely relaxing.", "review-date": "5 February 2022", "review-score": "8"}, {"text": "Dear Hollywood,\nThis is how it should work. People read a book. People like that book. You then just film the book directly. No messing about, no rewrites, no major edits, no nonsense, no casting someone 5'9\" to play a 6'5\" monster.I read the book last year and the biggest change I could spot was that it was a slightly less ridiculous sports car that he borrows from the bankers wife.", "review-date": "7 February 2022", "review-score": "8"}, {"text": "I absolutely loved Reacher. I was excited ever since I first heard about it and just got more and more excited as I saw the trailers and read the reviews so I had huge expectations going into this. Well, this series not only met those expectations but surpassed them in every way. I'm glad that I waited for all the episodes to be released before I started watching because it watched better as a binge watch. I actually liked it so much I plan on watching again all the way through very soon. I wasn't sure sure Alan Ritchson could be the lead in a good series but he can. He is fantastic in this. He not only looks the part but does a good job as lead actor. Reacher is one of my favorite new shows of the last few years and can't wait for another season!", "review-date": "12 May 2022", "review-score": "10"}, {"text": "Reacher was absolutely terrific! It's an action packed thriller that knows what it is and doesn't try to be anything else. Alan Ritchson does an incredible job as Jack Reacher, I think he's going to surprise a lot of people by just how good he was. This show will keep you hooked and on the edge of your seat throughout the season and I can't wait for future seasons. Once you start watching it you'll want to binge watch it as quickly as possible. It's doing amazing for Amazon as it's quickly become once of its most watched series ever. So much so that it already got picked up for another season only 3 days after season 1 came out. Reacher is easily one of the best new shows I've seen in years!", "review-date": "29 September 2022", "review-score": "10"}, {"text": "Surprisingly good show, with great action scenes and a likeable main character. An interesting crime story that reminds us of good old-fashioned entertainment.The story follows the atmosphere from the books well, and the casting is great. Alan Ritchson is a great choice for the role of Jack Reacher, not only does he look like him, but he conveyed his character well on screen.Most of today's series is unwatchable, but this is a really positive surprise. The series follows the plot of the first book, \"Killing Floor,\" and Reacher tries to find the culprits responsible for a series of murders.The show is a real surprise, because it does not suffer from most of the common flaws of today's film production. There are only a few small things that could be better, but this is definitely better than the vast majority of today's shows, because it tries to entertain the viewer, and not bother him with unnecessary things.The fight scenes are excellent, tense and brutal. Alan Ritchson is convincing in the role of Jack Reacher, but the other actors also portrayed their characters well. A really pleasant surprise, considering that most good stories are ruined by today's writers.The show looks interesting, very cinematic and is well directed. The soundtrack is good, it blended in perfectly with the atmosphere of the story.An interesting crime story with an excellent main character, tense plot, brutal action and a good cast.", "review-date": "5 February 2022", "review-score": "8"}, {"text": "I've only ever read one Jack Reacher novel, and it happened to be Killing Floor, which Season 1 is based on. So I can say it's an excellent, faithful adaptation for the screen. The mix of talented directors keep the story fresh and fast paced.I can also say that the characters are perfectly cast, in particular Alan Ritchson as Jack Reacher and Malcolm Goodwin as Detective Finlay. Reacher in the novels is as physically imposing as he is highly perceptive and intelligent. Reacher in the Tom Cruise movies is, well, Tom Cruise. (I watched the Tom Cruise Jack Reacher movies before reading the novel, and I really liked those movies. Still do. But Tom Cruise is not the perfect casting for Jack Reacher, I'll just leave it at that). Willa Fitzgerald (Roscoe) and Ritchson have a terrific on-screen chemistry that's fun to see develop over the course of the season. Before this, I was unfamiliar with these three actors but they, and the entire cast, honestly, got me attached to the town of Margrove.", "review-date": "4 February 2022", "review-score": "10"}, {"text": "Alan Ritchson is perfect for this and I love that he read all 24 novels in preparation for his role. The soundtrack is great, acting is smooth so is the writing, and the action is brutal awesomeness! I'm surprised the top few reviews aren't higher, Reacher deserves so much praise. I love this series it's very well made and continuously worth watching!", "review-date": "15 April 2022", "review-score": "10"}, {"text": "Having read many Reacher novels, and watching the two Reacher movies. I have to say, this is what Lee Child envisioned when he created Reacher. If you enjoy the Tom Cruise movies , you should, enjoy them as Tom Cruise movies, because that's what they are, if you are a Reacher book fan, this is a show for you. Not disappointed. I hope they make many more books with Alan Ritchson.", "review-date": "4 February 2022", "review-score": "10"}, {"text": "Aside from the extreme breaches of the law, being held in a prison instead of a jail and the lies told about searches (Ep1) so far this seems like it will have some sustainability. You do have to set aside a lot of reality and truth and belief but I like it so far. Better than that cruddy Tom Cruise movie. They also actually got a guy to play Reacher that actually fit the description given in the books.", "review-date": "4 February 2022", "review-score": "8"}, {"text": "True to the book. True to the character. Entertaining and fun.Right amount of action. Right amount of humor.Looking forward to another season & book.Definitely recommend it to anyone. You don't need to have read the book to understand & enjoy it.", "review-date": "4 February 2022", "review-score": "8"}]}, "Percy Jackson and the Olympians": {"Directors": "Rick Riordan, Jonathan E. Steinberg", "Year of Release": "2023– ", "Content Rating": "TV-PG", "Runtime": "45m", "IMDB Rating": "7.6", "Reviews": [{"text": "The personalities for characters Percy and Annabeth are so far off it hurts. I thought the big deal on this was that these actors were supposed to embody the characters so well, that looks didn't matter! Three episodes in and I'm not impressed. They made some weird changes to the story to shoehorn this snarky and combative new Percy in.Percy starts off as whiney and clueless. No one is explaining things to him until he sounds like an idiot, and has stuck his foot in his mouth. He's rude, and not at all funny or caring about other people. Annabeth isn't supposed to be his best friend yet - but she is so hostile.Whoever wrote the screenplays for these episodes needs to reread the source material.The Aunty Em's storyline changes was a complete wasted disaster. I hope Disney would do better.", "review-date": "27 December 2023", "review-score": "5"}, {"text": "I couldn't care less about the differences in how the characters LOOK in this show vs in the books. But I care immensely that Percy's character just doesn't... feel like Percy.In the books, he's snarky and quick-witted, and he possesses this childish confidence where he believes he can take on the whole world. I don't feel like any of that comes across in the show. A couple examples:\nin the show he is simply not funny or witty, at all. I can't think of a single thing he said that made me laugh. His sarcastic commentary made me laugh so much as a kid and it is sorely missed.in the show, he doesn't stand up to Gabe; instead, Sally does. This is a big flip of the power dynamic in the books, where Percy naively believes that he can solve his mother's problems for her, when the reality is that she's sacrificing everything for his sake. As a result Percy just seems like a bystander.in the show he chooses to fight first with violence rather than using his words. For example, against Clarisse in the books a lot of their drama stems from him throwing clever insults at her but here he just fights (with fighting skills seemingly out of nowhere, by the way).Perhaps I've read the books too many times, and at the end of the day, if the \"new Percy\" character worked just as well, I wouldn't criticize the changes. However, the problem is that I feel like the new Percy DOESN'T work, he's not a compelling protagonist at the moment and I don't find myself rooting for him. I will continue watching and I'm hoping this changes, but at the moment, I'm disappointed, especially since Riordan himself wrote the script.", "review-date": "22 December 2023", "review-score": "4"}, {"text": "I was 11 when I first read Percy Jackson and the lighting thief. I was diagnosed with ADHD and dyslexia, and my mother gave me this book because some neighbor said it was good for kids like myself. To this day, one of the most influential books I've read.I've been waiting for this series for a long time, and man it was worth the wait. 2 episodes in and you can already see the attention to detail they put into this show. The casting choices are so far great, the dialogue is excellent, and the kids they chose for Grover, Annabeth, and Percy have so far nailed their characters. It's obvious they are setting this up to do the entire series (which would be phenomenal) and the pacing is so far pretty good.If I had a Time Machine, I'd take this show back to 11 year old me to just see the excitement on my face as my favorite character gets an amazing series like this. I'm excited to see where they take the show, and how they introduce new characters through the series like Thalia and Nico. I can only hope that this gets even a quarter of the hype as Harry Potter, but I'm just glad Percy Jackson's finally getting the screen adaptation he deserves.", "review-date": "21 December 2023", "review-score": "8"}, {"text": "Initially, I had doubts about the show, especially concerning casting and worries about staying true to the original material after those cringe-worthy movies. But diving into the first two episodes surprised me-it brought back the Percy Jackson vibes, nailing visuals, characters, and the storyline. Despite visual tweaks, the characters' personalities felt spot-on. Percy is undeniably Percy, Annabeth is herself, and Grover has some extra depth. I'm really looking forward to the next episodes! The quality and attention to detail exceeded my expectations, promising an engaging series that captures the essence of the beloved books.", "review-date": "20 December 2023", "review-score": "9"}, {"text": "The movie is way better and so are the books. The dialogue is just dry and dull. The acting is just terrible. Casting is not great either and the show just moves so terribly slow. I was so disappointed in this series, it really is a shame to have such high hopes and now crash so hard to the ground. I don't know how the ratings are so high, this was just awful and hard to watch. Character portrayal, acting is subpar, dialogue, the monotonous talking in every scene can put you to sleep, especially Percy, ugh, just bad. Percy's voice and his bad acting just ruins the show for me. Stick to the books and the movie. Hard pass.", "review-date": "26 December 2023", "review-score": "2"}, {"text": "As an absolutely massive fan of the Percy Jackson book series I was ecstatic for the show to premiere. Like most book fans, I had found the movie series to be an extremely poor adaptation and unfaithful to the original series. I had very high hopes and expectations for the Disney+ reboot, especially with Rick Riordan involved in the show.To my utter disappointment, the Percy Jackson show is an equal letdown as to the movie adaptations. The episodes are too short and extremely rushed, with no time for any type of character development or emotional response. Percy's mother passes, he doesn't even blink. He's a demigod, okay. He's at camp, he suddenly has best friends. I watched the first few episodes with someone who hasn't read the series and is unfamiliar with general Greek mythology, and they had no idea what was happening and were bored - as was I!I'd recommend you skip this. Again, I was super exited as a book fan and all I can say is I'll go back to pretending there's no live adaptations of the classic and excellent series.", "review-date": "27 December 2023", "review-score": "1"}, {"text": "I was really looking forward to the series after watching the movies and then reading the books. The first movie was \"okay\" for me. The second one was a disaster. About 2-3 years ago, I started reading the books because I really like stories about mythology.I don't understand why a series is created if so much from the books is still ignored. In my opinion, Annabeth is completely misrepresented in terms of character. What's up with the weak portrayal of Medusa? I get it's Disney, but did Medusa really need to wear the cap?! Why doesn't Percy have a backpack and carries that silly shoebox around? And why is the series so rushed?We still didn't have time to bond with the characters and he is already on his mission.Don't they all learn from GOT that a rushed season won't be enjoyed by fans?", "review-date": "28 December 2023", "review-score": "3"}, {"text": "Heavily expository dialog, slow pacing, odd framing of scenes--why so many shots from behind when characters are speaking?--and clumsy fight choreography are just some of the factors that prevented me from enjoying the first two episodes of a show I was eagerly anticipating. I can't believe I'm saying this, but I prefer the admittedly flawed film. Even the SFX in the film seemed better, and to check my memory, I rewatched the film after struggling to stay awake during the Disney+ series, and yes, those effects from 2010 survive the comparison. The early encounter with the minotaur, for example, feels more kinetic and dangerous in the film, while the TV version fails to convince that the adolescent Percy could in any way survive the encounter.", "review-date": "22 December 2023", "review-score": "5"}, {"text": "My headline pretty much says it. The pacing is too fast honestly (great for kids with short attention spans ig) and the lines seem pretty cliché and cheesy to be frank. The visual effects could also be a bit better. I know the movie wasn't everyone's favorite but I do think they had better visuals in it. The issue with the pacing is that it really isn't giving the audience enough time to create an emotional relationship with Percy that readers might already have. If anything this series is for them and no one else which doesn't make it good television. And I might be in the minority but there is nothing wrong with slowing down and letting your affections for the character grow. Since these are based on books they could've gone even MORE in depth than before but they actually are seeming to go faster through the intro stuff than they really should be. I think the show is overhyped and hope it gets better.", "review-date": "21 December 2023", "review-score": "5"}, {"text": "I was really looking forward to this show. I read the books as a kid and really enjoyed them and of course like many others, when the movies came out I was disappointed with how they failed to follow the source material and that was the main downfall of the movie adaptation & with this show we were supposed to get a loyal adaptation that goes more in depth because its a TV show & yet its making the exact same mistakes as the movies while somehow feeling MORE rushed than the movie adaptation, which doesn't make sense at all because it's a TV show, they should be able to go more in depth, right?The breakneck pace of the show felt like they were speed-running through the plot, leaving no time to savor the story's essence. It's like they threw the script together in a rush, resulting in cringeworthy dialogue and performances that made it impossible to take things seriously. If I was a viewer who hadn't read the books, I wouldn't even be able to process what was happening, they do a poor job of explaining the story and the significance of a lot of important things in the plot.Connecting with Percy, our main guy, was a struggle. He felt as bland as unseasoned chicken. There was this void where his personality should've been-nowhere near as charismatic or relatable as he was in the books. It's tough to root for a hero who doesn't make you feel anything.The whole cast in general, unfortunately, didn't do much to save the day. I was hoping for engaging, funny characters that I could latch onto, but it was like they missed the memo on charm and relatability all the characters have in the books. Clarisse was the lone standout who had a shred of resemblance to her book self, but the rest fell flat. It's disappointing when a show fails to capture the spark that made the source material so beloved. This TV show was supposed to be a better adaptation of the books, but, so far, it's been a worse adaptation than the movies.", "review-date": "23 December 2023", "review-score": "1"}]}, "What If...?": {"Directors": "Jeffrey Wright, Terri Douglas, Matthew Wood", "Year of Release": "2021– ", "Content Rating": "7", "Runtime": "32m", "IMDB Rating": "7.4", "Reviews": [{"text": "Now that the first season is over, I can confidently say that this series has exceeded my expectations. It uses witty scripts and detailed animation to bring the fans the service they've been wanting and more. Each episode is quite varied so there are many different scenarios and you never know how it will turn out or which characters will show up. The series wastes no time explaining any of the Marvel Cinematic Universe and just gets to the point of the scenarios, and also starts to merge the scenarios without warning. This is for the fans, not casual viewers! However, the variety of episodes also means that the quality and tone also vary quite drastically. The short runtime means that many events and battles are cut short. There was a good amount of care to make everything canon and consistent, but there are still some shortcomings and the power/ability of each character seemed to be contrived based on the needs of the plot.", "review-date": "10 October 2021", "review-score": "8"}, {"text": "This is fun. I am enjoying every story.Not all episodes are as good but overall it's worth it.(The doctor strange episode for example was exceptional).If you are a Marvel fan, you will probably like it, for these -and many more- following reasons:1-Happy to hear all the voices from the MCU actors. Makes the starting titles interesting; you d wanna see who's in it.2-The stories are captivating. There's some comedy, action, drama; a good range.3-There's some great one-liners. New ones and also memorable ones.4-The pace of each of the episodes is excellent. It really gets you into the story.5-It does great tribute to MCU's pivotal points.Give it a go, you will enjoy it.8/10.", "review-date": "21 September 2021", "review-score": "8"}, {"text": "A brilliant concept and a great way to view some alternative plots within the storylines that every Marvel fan knows, but horribly inconsistent. Some can lack any real power, Captain Carter not being too captivating although an interesting plot, T'Challa as Star Lord being a little too perfect, but others, like the murder of the Avengers are engrossing. It's just so disappointing that an episode such as Dr Strange losing his heart, which is poetic, powerful and beautiful, can be followed by the most disappointing Zombies episode imaginable. Zombies, was a particular waste.The animation is okay, distinct enough to be recognisable as it's own thing but not so easy on the eye. Keeping the vast majority of actors to voice their animated counterparts is a win, but sometimes the writing just isn't good enough. I'm thinking of the Zombie episode again, what a swing and a miss.EDIT: Nothing is as bad as the Thor as an only child episode though. Painfully unfunny, shockingly bad.", "review-date": "17 September 2021", "review-score": "6"}, {"text": "I remember so many years ago, enjoying the What If? Comics. I suppose it was a simpler time for comics and each issue took a look at what might have happened if a different choice were made or different result occurred. They were the Marvel comics version of DC's imaginary stories.Like any comics, some issues were better than others. But overall, the stories were fun, enjoyable and some were even thought provoking.But along the way, the comics started to reflect less important or interesting decisions with increasingly absurd results. Even worse, some mildly popular issues and characters started to emerge in the mainstream comics, calling for increasing levels of silly complexity. Like most readers, I kept on for a while then stopped buying the comic.The What If? Series seems to be reflecting the worse of the comic legacy. Sure there are a few interesting episodes that stand on their own. The zombie one was certainly fun.But it seems this programs is falling victim to the desire to fit itself into the actual MCU rather than just examining possibilities.Watching the second season, it seems the show is trying to fit itself to the MCU's big multiverse mess. Not working for me.", "review-date": "29 December 2023", "review-score": "5"}, {"text": "Really enjoying this series & the risks they've taken so far.", "review-date": "2 September 2021", "review-score": "8"}, {"text": "Six episodes in, I have yet to be entertained by one. The concepts are awful. They're not interesting unless you're a die hard fan boy of Marvel comics. For the rest of us very casual fans, give us something. I've been bored on all six episodes I've seen so far and the seventh is what if Thor was an only child. So what?These are not engaging premises at all. Again, I assume the fanboys are eating it up simply because it's Marvel but I'm bored still and don't want to be, I want to like this show. I LOVE the animation and the voice actors.Give me something.", "review-date": "22 September 2021", "review-score": "5"}, {"text": "So Disneyfied its hysterical. White people suck, girls rule.. yada yada we get it. Could have been really good though. Great animation and idea though. Hopefully series 2 is better or they just end it. The zombie episode could have went the whole season though.", "review-date": "16 January 2022", "review-score": "1"}, {"text": "What a lame excuse for a series . What if? Lamest possible episodes at the beginning. Last 2 or 3 episodes were little better. But overall it's bad. Badly written with lame jokes and comedy sequences.", "review-date": "13 November 2021", "review-score": "5"}, {"text": "I'm sure the pitch meeting for What If Season 2 at Marvel went like this:\nSo, here's our plan for What If Season 2: We will bring back Peggy Carter and have heroes fight their dads in the name of freedom. Because dads are bad and they want to control kids. Then we will have more Peggy Carter. We feel that there are still some strong male characters left, so we will replace them and make every episode focus on even stronger female leads. After that, we will again have Peggy Carter, but in 1602. Finally, we feel that we have not made Doctor Strange weak enough. So we will have him defeated by Peggy Carter.Like seriously, Marvel, if we want to focus on Peggy Carter this much, you could have just given her a movie or series. And it would have been fine. But instead, you decide to ruin What if. The series has endless possibilities. In every story so far, there have been some key moments where the heroes had to make a choice. All Marvel had to do was pick a story and explore the alternate reality of what it would have been if the hero picked a different path. It's not always going to be the best decision. The outcome might have been negative, and that's the beauty of What if. But Marvel just opted to doubled down on more female leads, predictable happy endings, and Peggy Carter.I rated the first season of What if: 8/10.My rating for the second season: 2/10.Bonus: Here's a tip for Marvel. Season 3 should be \"What if Marvel stopped ruining good movies/series and produced good stories like pre-endgame?\"", "review-date": "31 December 2023", "review-score": "4"}, {"text": "What If Season 2's ending is similar to Secret Invasion's ending, introducing an overpowered female character named Kahori. She gains power from an Infinity Stone and can stop Doctor Strange Supreme, which is surprising. Doctor Strange Supreme was originally powerful, even stopping Infinity Ultron with all the Infinity Stones, making him my favorite in What If. I watched the series mainly for him, but Marvel mishandled his character.Initially, I expected the episode to show Doctor Strange Supreme stopping some multiverse-level villain, sacrificing himself, which would have been a perfect and just end for the character. Unfortunately, we got an unsatisfying ending.It's clear Captain Carter will likely lead in What If Season 3, and I don't understand why so much importance is given to her. Are there no other characters in the multiverse? So now I'm not interested in it or any other MCU project. After seeing poorly written overpowered female characters, it seems we'll see more of this trend. Now, it feels pointless to invest time in MCU projects.Peggy and Kahori totally had plot armour. Who taught Peggy to use the infinity stones with so much ease? And that enchantment was to defend her against space stone but she literally punched strange by holding all infinity stones on her bare hand (she didn't even have vibranium armour)!!", "review-date": "31 December 2023", "review-score": "4"}]}, "Aquaman and the Lost Kingdom": {"Directors": "James Wan", "Year of Release": "2023", "Content Rating": "PG-13", "Runtime": "2h 4m", "IMDB Rating": "6.0", "Reviews": [{"text": "So many aspects of this movie are a complete mixed bag:1) Half of the comedy is really funny, the other half made me roll my eyes.2) Some of the one-liners are good, some made me cringe.3) A lot of the action is so cool, a lot is a screen full of gibberish.4) There are so many beautiful shots and visuals, and also horribly cartoonish CGI like in The Flash.5) I enjoyed the musical score, but it doesn't reach the level of Black Adam's. And I wasn't a fan of using classic rock tracks for a lighter tone, something we're more likely to see in a Marvel movie.6) Half the time I was invested, the other half I was unengaged and didn't care.I had an okay time wit this movie. It benefits from IMAX with the expanded aspect ratio for the entire movie. But in the biggest IMAX around, there were a total of 8 people in my theater. DC seems to have alienated its die-hard fans.(1 viewing, opening Thursday IMAX 12/21/2023)", "review-date": "22 December 2023", "review-score": "5"}, {"text": "Aquaman and The Lost of Kingdom suffers THE SAME problem with the first installment; it DOES NOT have a distinct identity. We were shocked to see that the major problem they had in Aquaman 1 was again manifested in this sequel. If you watch a film, you know the kind of tone and feel that a movie is giving you. But this movie feels like a jumbled medley of imitations from different kinds of films, almost like a parody. There's a 10-minute scene where you felt like this is from an Indiana Jones world, and then the next thing you know, you're stuck in the realm of Journey 2: The Mysterious Island. We can name a lot of different movies that this film takes its tone and design and pastes it into the movie. War of the Worlds, The Matrix Revolutions, Ridley Scott's Aliens and... okay, we'll stop now. The result is an endless patchwork of downgraded recreations from various movies. It felt like Aquaman had a day at Disneyland going into different kind of movie-themed rides (minus the 'fun').Adding to that, the first act felt like it was venturing into a documentary style format mixed with Ridley Scott's Alien style of exposition. Alien was a masterpiece but like we said, this is a dumpster reiteration, it was slow, it had little to no suspense, it tried to build momentum but it didn't work. They could have cut 10 minutes but they didn't. It was unnecessarily drawn out as they spent time showing the entirety of their journey into the deep unknown like this is some kind of art house film.Now, a lot are asking, is Amber Heard in it? Well, yes. Did she have many scenes? Her presence was only about 15% of the whole film. Her character, Mera did play a pivotal role for the story but James Wan, the director knew when to show her on screen. The question, 'Is her presence important on screen?' seems like what James Wan would ask himself before making the decision to put her in. She only had few dialogues but her performance was still flat.We also have a problem with how much they made use of 'space'. Especially in the first act, we saw they're a lot of wide shots used but the issue here is the space that filled in those shots; the surroundings, locations or/and environments were only there because... they were made to be there. It barely did anything to the story. But when it comes to scenes that were crowded or had various props or extras, the cameras ddin't give audience the time to breathe and process the visuals. A lot of mid to fast cuts, there wasn't much of a sense of appreciation to enjoy the visuals they have built. In the end, we felt discontented.First Aquaman at least had villains that were enjoyable to watch. This time, the villain or again, villains were just forgettable. The motivations were weak. The main villain didn't really drive the story forward. It had a backstory and conflict that were created merely for the purpose of this movie's existence. We couldn't care less because it's nowhere interesting, let alone enjoyable.And talking about that final battle... oh man. It was unbearable to the point that it turned laughable. Was it because of the reshoots that they suffered here? The whole movie, led to the final battle, it was a journey between Aquaman and his brother, only for us to find out that the villain was feeble and it gave the benefit of the plot armor for Aquaman and his weapon. It's just bad storytelling on top of bad execution overall.And the movie draggggggsssssss so much, we even questioned, 'What happened to James Wan?' From the beginning up until the climax, we were just waiting for something cool or unique to happen, but it didn't. It drags until the final battle where it should be longer but then that's when they decided to just cut things off and ended it abruptly the moment the exciting thing was about to pop up. We're confused.Amidst these flaws, one thing that truly stood out is its message on brotherhood. A beautiful message combo with good pairing, Jason Momoa and Patrick Wilson have commendable chemistry, we can see it from the way they talk to each other. There's certainly some dedication they put into establishing their relationship. It's nothing that you can remember for years but it's enough to at least carry this movie despite the many bad outcomes this movie turned out to be.Ultimately, Aquaman 2 seems tailored for a younger audience who just want to enjoy monsters and sea creatures fighting against literally anything or anyone, rather than catering to teenagers or adults seeking a compelling narrative.Verdict: Similar to its predecessor, this sequel fails to find its identity, drowning in an ocean of borrowed tones and styles from previous movies. With a shallow story, forgettable villains and inconsistent pacing, this film struggles to stay afloat. While it's a tidal wave of disappointing results, the portrayal of brotherhood between the two leads stands out as a beacon, carrying the entire movie. Overall, this final chapter from the DCEU serves as a testament we're in dire need for a total reboot of these superheroes.", "review-date": "20 December 2023", "review-score": "3"}, {"text": "The most accurate word I can think of to describe Aquaman and The Lost Kingdom is annoying. Where the first film was hardly a masterpiece of the genre I thought it was over the top in all the right ways and because of that I actually mostly enjoyed it. This movie just doubles down on the insanity in all the worst ways and I ended up finding it borderline insufferable.For the first 15 minutes or so I thought I could enjoy it in a so bad it's good sort of way but it's too stupid to even enjoy in that way. The script just makes so many errors on the most basic level that if you think about any thing about this story for more than a minute it just collapses. Nothing that gets set up pays off in any meaningful way and most of the resolutions fell totally flat. It can't decide on a tone, it drags majorly and most of the humour made me cringe in all the worst ways.The performances really suffer as a result cause they're pretty poor across the board. I've liked Jason Momoa as this character but he's just too campy in this movie to take anything he's doing seriously, even actors of Yahya Abdul-Manteen II and Nicole Kidman's calibre deliver their lines in the flattest way possible but with the material they're given I can hardly blame that on them. I'm happy that Willem Dafoe was spared from this mess at least.The finale is the most bog standard CGI noise of a climax that we've seen so many times before that I was just totally bored watching it, at least the first film had some sense of spectacle to it. There's the odd fun action scene but the pretty dreadful visual effects just constantly took me out of it. The villain is terrible after a decent set up in the first film with the most generic motivations possible.The Lost Kingdom ends the DCEU with the biggest thud imaginable. It's been up and down since the beginning but it deserved a better conclusion than the soulless slog that this movie turned out to be. This might be the worst movie they ever made because at least Justice League had a happy conclusion with the Snyder Cut. There's nothing in this movie you haven't seen 100 times before and I've never been more ready for a total reboot of this universe.", "review-date": "22 December 2023", "review-score": "4"}, {"text": "This movie feels like the equivalent of Eminem's Revival cause my god, this movie is a dumpster fire in the worst way with poor writing, sloppy characters, and bad performances. The first Aquaman movie is absolutely ridiculous but I enjoyed it because it didn't take itself too seriously and understand what the movie was. I thought it had a fun energy and went bonkers in the best way. However, all the fun, energy and bonkers entertainment is just thrown out of the window with this sequel because this sequel is a gigantic mess.The narrative continues from the previous movie with new settings and concepts introduced and while I did like they introduced new settings that are pretty cool. Unfortunately, the writing feels really convoluted because the concepts and ideas were messy as if the writers didn't know how to put the concepts well-together. With all the reshoots and drama happening behind the scenes, I can't be surprised that the structure had fallen apart. Many of the special effects, production, make-up, and the colorful presentation are pretty rough and there are some noticeable poor CGI used but not like The Flash situation. The soundtrack is annoying and the action and thrills were just okay. Many of the cast members are doing their best but unfortunately, the performances weren't great and the dialogue was pretty bad. I honestly feel bad for Yahya Abdul-Mateen II cause he's talented and the character of Black Manta is pretty cool, but Mateen doesn't really get his chances to shine with his character.Director James Wan is talented as I enjoyed many of his works and I can see Wan is trying his best to create the sequel like the first one, but his direction was really bad as it feels sloppy and inconsistent. The sequel tries to follow the same non-serious 80s cheesy style, humor and tone from the previous movie but it doesn't work because the sequel kind of misses the point of what made the first one entertaining and ends up being pretty cringeworthy.I knew this movie wasn't going to be great and I just wanted to have dumb popcorn entertainment. Some dumb fun and laugh for the cheesiness but wow, it surprised me on how bad it was.One of the worst movies I have seen this year. Also from DC.", "review-date": "22 December 2023", "review-score": "1"}, {"text": "IF this was made in the early days of superhero franchises, say when Iron Man first came out, then it might have stood out. Unfortunately Aquaman 2 has to bear the burden of having to follow through the recent flops and/or mixed bag of superhero output from both MCU/DCEU.James Wan doesn't offer anything new under sky; a baddie who wants revenge - saw that in the Marvels. Sibling tension? Saw that in Thor. Supposedly all powerful, final-baddie who then gets thumped easily? Saw that in Black Adam. By now, there's such an air of familiarity in superhero fares, that I think it' gonna take a complete shift in narrative/plots to offer audiences a fresh take.Jason Momoa's charisma and screen presence is basically the backbone of the movie and it pretty much carries it through. His timing, especially humour, is spot on, while his Aquaman is also convincingly authoritative. Yahya Abdul-Mateen II's somewhat wasted here. A capable actor, but he's reduced to portraying a stock baddie out for revenge, while his right arm, Stingray, is as one dimensional as they come. Plus it doesn't help that the actress who plays Stingray is kinda cardboard too.I find Randall Park, while dependable, nevertheless still plays Randall Park from other movies/Tv shows. You've seen his character in Blockbuster, or in the mcu outfits.Don't have any complaints on Amber Heard or Nicole Kidman, but they don't have enough screen time to make much of an impact. But I have to admit, I did wonder, what if Nicole played Capt. Marvel instead of Brie? I think I would have bought into it a lot faster. Kidman's talent is such that, even small screen time doesn't stop her from exuding enough screen presence to make her contribution count.Which leaves me with Patrick Wilson. His portrayal of Orm is brilliant, suffusing the character with the tension his inner conflicts have with his motives - \"do I live in hate, or do I forgive?\" The fact that Wilson achieves this without any acting histrionics but leaves his angst just right above the surface, just enough for us to feel it, is probably the standout feature of Aquaman and Lost Kingdom. I think he kinda redeemed himself from the poor and dumb Moonfall.I hope James Gunn will be able to create not only a new trajectory for DCEU, but an entire different take on superhero movies. While Aquaman 2 is entertaining enough to fill your 2h, it's also a by the numbers' effort. Not something you and I will live to remember.", "review-date": "22 December 2023", "review-score": "6"}, {"text": "Rating: 5/10\nFormat: Regular TheatreA script that doesn't have any story to hold it tight together. It's a very interesting story that discusses many aspects like family, brotherhood, fatherhood, and leadership. But, perhaps this was its core problem, that it was trying to be so many things at the same time. At times i didn't know where the story was heading which made the story jump from discussing topics like fatherhood to an adventure with two brothers who had beef in their past. The film is unfortunately a typical superhero film in terms of expecting what's coming next from events, and sequences.On top of that and with all the chaos, the film re-discusses the villain's story which revolves around his revenge but it was so weak comparing to how it was in the first film. I didn't feel his presence nor i felt his evilness. He was suppose to be much stronger here but i barely felt him. The film also brings back old characters that just all of a sudden showed up in some sequences to save the day and be the superhero of the act which felt so weird because they came out of nowhere.The film's CGI is okay at most times. It's defiantly not as good as the first one but it is for sure better than most of the MCU's latest projects this year like Ant-Man and the Wasp: Quantumania (2023). The cinematography unfortunately got downgraded which is something that I was anticipated for especially after seeing the first part. But I felt like there was no room for that because of how messy the sequences and story was especially that we were jumping between the past and present a lot and from one place to another.Not to mention, the whole last sequence of the film was so good in terms of the action sequences and grabbing the audience's attention. Really got me hooked and interested and wished if the rest was like that.", "review-date": "23 December 2023", "review-score": "5"}, {"text": "How can a movie resonate with the viewer, if the story builds for two hours, and ends in 10 seconds? How can a writer think that this will have an impact on the viewer?Well, the film feels and looks like a comic book. It is an simple comic book storyline, It feels kinda like a saturday morning cartoon. This is a great look if you're going for an animated movie, but for a whole picture that is demanding towards older audiences.. this is a problem. An problem which Hollywood doesn't seem to care about. Because I've seen this in almost every high-budget adventure film this year.It is always the same structure. The Hero returns and needs to save someone or defend somewhere, one that is near to him explains that he needs to get to A because at B him awaits an creature, that is much stronger than him. So he needs to get an item, or in this specific case, get an person, that could help him. AND very important to note here, is that the villain always gets teased at this part as this demonic, highly frightening creature.In the end, he's mostly just an huge piece of plastic or an huge piece of Green-Screen. Or, the worst case, he dies in merely 60 seconds after his great appearance.While this kind of storytelling overshadows what audiences REALLY want, and what potentially great writers could achieve if there would be more demand for interesting, immersive concepts and ideas in Hollywood, at least, please, try your best in writing your characters Appealing.The first Aquaman is simple, it's basic, but in it's first minutes it's already emotionally resonating and has GREAT camera-angles that psychologically just attracts someone to stay for more. The movement of the camera was immediately grabbing. And in the end, you got an work of art which is intense, epic and emotional at once, just because the filmmaking does the best out of it.So, either have a great script, or have a great filmmaker, a great sound-editor, cinematographer, composer, color-grader, visual effects artist..Filmmaking is not without reason called an art-form.", "review-date": "21 December 2023", "review-score": "4"}, {"text": "Aquaman and the Lost Kingdom seem to have taken a dive, leaving us with a rather soggy DC EU experience. Jason Momoa's Aquaman fails to make a splash as a top-tier superhero, and the revenge tour promised by Black Manta turns out to be more of a leisurely swim. Forget showcasing Aquaman's raw power; we're stuck with a neglectful father, husband, and king who happens to be proficient at water aerobics. The movie spends more time on side attractions like cinematography, visuals, and subordinates, forgetting that Aquaman should be the main event. With attempts at humor falling flatter than a sunken ship, it's clear they lost the recipe that made the first Aquaman somewhat tolerable. And seriously, a DCEU finale without a Justice League cameo? It's like they're drowning in missed opportunities. I'll generously give it a two out of five-mainly for the underwater scenery.", "review-date": "23 December 2023", "review-score": "4"}, {"text": "I was a bit confused about Atlantis being somehow still hidden. I just thought everybody knew about with Aquaman fighting for the Justice League, which BTW is nearly non-existent in this feature except for a Ben Affleck cameo. Let's just pretend DC Comics decided to have its own \"reset.\"With the help of a scientist (Randall Park) and global warming David Kane (Yahya Abdul-Mateen II) discovers the existence of another Atlantis, or at least the broken black trident of the Lost Kingdom of Necros. Holding the two pieces together Kane is given knowledge to uncover the lost technology that Atlantis had abandoned because it was destroying their world by altering the climate. (See where this is going.) Aquaman (Jason Momoa) must resque his brother (Patrick Wilson) from the Harry Potter prison of Azkaban. They then must see a pirate who looks like Jabba the Hut. The nobody hits my brother line reminded me of Beverly Hill Ninja. I am not sure why they played \"Spirit in the Sky\" for underwater scenes as if I wasn't confused enough. Aquaman does have a son in his feature who can talk to fishes. I was disappointed it never came into play.Good action. Horrible script. Waste of money.", "review-date": "21 December 2023", "review-score": "5"}, {"text": "Only suited for energy drink addicted teenagers, who want to their movies to be like a nonstop action game.The bad: this movie is too violent for young kids and way too stupid for any grownup adult. That leaves only one target audience: the teenagers.Hurrah for them if they can stumach this non stop CGI rubbish, but I got annoyed and numbed within minutes of watching this.What's most annoying are the (failed) attempts to make jokes, that undeniably fail to evoke any laughter, AT ALL. The \"jokes\" are so worn out and in my face that they only irritated me.I really can appreciate a silly over the top action movie and the story hasnt even got to be credible, BUT at least the characters and the story should be interesting. NONE of that was the case however in this movie.To be avoided at all costs...", "review-date": "22 December 2023", "review-score": "3"}]}, "Animal": {"Directors": "Sandeep Reddy Vanga", "Year of Release": "2023", "Content Rating": "A", "Runtime": "3h 24m", "IMDB Rating": "6.8", "Reviews": [{"text": "Technically, there was no cohesive storyline. Dialogues were all over the place. Conversations between characters were weird. Like every time one would say something and other would go into an unrelated monologue. (Mostly ranbir).It's nothing like the trailer. Story is not about son and father. They didn't show anything about their relationship after the first few scenes.Coming to content, Ranvijay never knew to answer a question straight. His character had no consistency. Even if you make a negative character, his actions need to be consistent. In one instant they want to show he is unhinged and doesn't care, and then next instant he would forgive and protect them.A movie needs to have a story, a plot, characters need to make sense inside the movie.Their attempt at jokes were so distasteful. He gives a wedgie to a servant, rants about his underwear, there's two monologues about pubic hair, there's denial about medicine.Even the climax was so underwhelming. They just faught in one song.Worse part was how they used Sikhs in the movie. They tried to use them to do idk what. But they're just around to elevate Ranvijay. And in main climax they're told to stay back. Then killed on screen helplessly. Why would you show something like that.All in all, as a movie it sucks due to lack of story and badly written characters. Then there's the content.", "review-date": "2 December 2023", "review-score": "1"}, {"text": "Ranbir personal show with no story, no logic and absurd action scenes. Anil Kapoor and boby are wasted totally, the film story is from the age where there are no law and enforcement exists you can do whatever you want to either it's your own country or you are in foreign kill as many people as want .... to make a century of corpses is like a piece of cake. Zero emotions and no chemistry between father and son....not even close to a worst family drama and yes it's not a family movie strong language lot of unwanted smooching and obscenity. Spend 3.5 hrs with your father or if you are father spend quality time with your son and save yourself from this disaster.", "review-date": "1 December 2023", "review-score": "1"}, {"text": "The movie glorifies violence, physical and sexual abuse, denigration of women and basically banks on shock value to provoke viewers rather than pull in people with a coherent story.The director will claim that he is some sort of indian tarantino, but its not even close. Just a badly made movie with a man whom every woman must be careful of and stay very very very far away. Consider this a warning and avoid this psycho and his movies. Nothing good can come out of them.Its specially troubling when you know that these movies will appeal to already mysoginistic men in India and encourage further crimes against women. Really feel bad for women who now will have to put up with more misogyny because of trash like this.", "review-date": "3 December 2023", "review-score": "1"}, {"text": "Went to see it with my 2 boys last night in Manchester.What looked like an awesome film from the trailer turned out to be an awful experience. An embarrassment of 2023.Be Sharmi. Be hayaaii. Be ghairati. The Indians are fast losing their sense of identity as they try so hard to westernise themselves but none of the western world watches any of this kind of trash so why bother losing your authenticity?This film is a sex romp with a mindless and senseless killing spree. It beggared belief and on so many occasions we just wanted to walk out but hung in there hoping against hope it would improve.Ranvir Kapoor an excellent actor was unable to make the film look intelligent at all and a deaf Bobby Deol now looking aged was thrown in for good measure in the last 20 minutes. Anil Kapoor looked lost with the odd decent dialogue but nothing out of the ordinary.It was just killing upon killing with scenes and dialogues of sex that would make Bollywood no go films with your daughter or mother. Any wonder that Bollywood is dying out slowly and actors are out of work. Carry on with this trajectory and Hindi cinema won't exist in another 20 years as it will have lost itself completely.Distasteful. Disrespectful. Disgusting.", "review-date": "2 December 2023", "review-score": "1"}, {"text": "You seriously need to question the sanity of the director, producers and even the actors of this film. I'm a bit traumatized by the movie, and Ive seen my fair share of gore. This movie was beyond bad. And the storyline defies logic which makes it even worse. Too many instances where basic questions and clarity in communication would've reduced the screen time from three hours to two hours max. The worst part is the director is planning on a sequel soon.If you value your hard earned money and your mental health, I would advise you to abstain from watching this 3 and a half hour torture of a film.", "review-date": "3 December 2023", "review-score": "1"}, {"text": "I have a migraine watching this cringe movie. Literally every aspect of this movie is cringe. And in terms of originality, this is Rajneeti meets Kabir Singh with an overdose of papa, papa. Give it a rest, you can love your father without being abusive to the rest of the world. And the great thing is that there is still no closure for the audiences who've been wound up for 3.5 hours in the hope of at least a detente.The 'visionary' directory Sandeep Reddy Vanga goes to town bringing every debunked cliche to life - the cliched 'alpha' shtick, the slap-happy father who favors the son-in-law over his own son, the subjugated wives and mother, the 1 'alpha' killing 100 of people (not an exaggeration) armed with a couple of axes, creating 'body doubles' as if that's a thing.The funniest part is that the climax fight with Bobby Deol literally has its own narration ongoing in the form of a song in the background - as if singing \"Ye dekho kaisa thappad maara~\" with every slap landed.No closure is offered to any of the sub plots ongoing with the protagonists - the relation with the wife, the kids or even the father. To compensate for this, Sandeep Reddy Vanga overcompensates with gratuitous violence to satisfy the enraged crowd watching this trash, never having been involved in as much as a scuffle, much less an actual fight.The plot is as simple as it gets, and it's clear Sandeep Reddy Vanga didn't have a story to tell, as much as a couple of ideas for scenes he wanted to execute based on his diminutive understanding of Marathi music, fetishization of Sikh Youth and culture and more importantly, his bloodlust to satisfy.Such is the bloodlust, that even the post-credits scene is drenched in more blood than most animes, and that's saying a lot.", "review-date": "2 December 2023", "review-score": "1"}, {"text": "When we make a female lead movie, everyone labels it as a feminist movie. But even then those movies just portray how a woman challenges society and comes forward in life. Society can't accept even that and rates the movie so low. Then what about this nonsense movie. Is this not a misogynist movie. How many movies like this are shown to insult women and objectify them. Why is no one labelling such movies as misogynist when it actually is. Why are we still showing women as objects in such kind of movies. What is it with movies like Kabir Singh and Animal. This movie is so disgusting, it shows how ranbir is in real life. Look at the movies alia chooses and look at the movies this useless fellow chooses. He either chooses a playboy movie or a movie where he objectifies women. Poor alia to be married to such a misogynist.", "review-date": "2 December 2023", "review-score": "1"}, {"text": "The movie is ridiculously bad. Keep the misogyny aside (which is absolutely horrid), the movie is still looks like a headless chicken running around. There is absolutely no story. I wanted to leave the theatre on so many occasions, yep, it was that ridiculous.There is such a lack of logic as well! Ranbir Kapoor is in supreme health just a short while after getting a HEART TRANSPLANT and beats the hell out of Bobby Deol. Ranbir is killing 200 men alone while his Sikh brothers are singing in the background. Heights of stupidity.Please do not watch the movie and give it attention that it clearly does not deserve.", "review-date": "5 December 2023", "review-score": "1"}, {"text": "\"Animal,\" directed by Sandeep Reddy Vanga, offers a captivating experience with impressive background music, memorable songs, and technical finesse. However, the film stumbles in terms of story strength and screenplay execution, featuring temporal shifts that lack coherence and fail to enhance the narrative.While the first half engages with its fast pace, the second half unnecessarily prolongs the story, leaving the film feeling overly lengthy and lacking character development, especially with Ranbir Kapoor's character. His abrupt temporal shifts lack clear reasoning, contributing to a disjointed narrative.Despite a touching emotional scene between Anil Kapoor and Ranbir Kapoor towards the end, it arrives too late, leaving the audience fatigued and eager for closure. The credit scenes, though appealing, add to the film's unnecessary length.Ranbir Kapoor's character, portrayed as a hero, raises concerns due to his criminal actions, lack of respect for others, blatant misogyny, and attitude problems. The film's attempt to celebrate such a character is problematic, as it glorifies a man-child who in reality needs therapy.Actress Rashmika Mandanna's performance is very poor, making her unfit for the role. She was struggling to deliver convincing dialogue and lacked depth in her portrayal.It's disheartening to witness Bollywood failing with films like \"Animal.\" The industry has the potential for impactful cinema but seems to fall for subpar narratives. They should strive for better storytelling and more nuanced character portrayals and should avoid the pitfalls of glorifying problematic characters for the sake of entertainment.", "review-date": "2 December 2023", "review-score": "4"}, {"text": "Man. Ranbeer kapoor, and his pind brothers, what a lit and elite squad. Absolutely run havon in the city.Vanga simply says it bluntly on everyones face, i will dare to do what i want and show what i want and he has done that.Vangas vision is completely fulfilled by ranbeer and all other actors. Movie becomes little boring in 2nd half. But the finale is good. It is about the real man to man fight.Am still in awe of ranbeers role. This is his best acting till date. Kudos to all. Rashmika did grt in her part as well as anil kapoor. Bobby has also done good. This is a must watch theater exprnc.", "review-date": "2 December 2023", "review-score": "8"}]}, "The Hunger Games: The Ballad of Songbirds and Snakes": {"Directors": "Francis Lawrence", "Year of Release": "2023", "Content Rating": "PG-13", "Runtime": "2h 37m", "IMDB Rating": "6.9", "Reviews": [{"text": "No matter how faithful a movie is to the book, it can't save itself from the fact that it's unneeded. Backstory to snow is fine if it adds something new to the universe, however nothing new is added here, we get taught everything we knew about the world and get tiny little snips of backstory of the origins of the Hunger Games. For the movies insane long run time, the final act of this film seems like a race to get to the end of the story. The slow paced world building it creates in the first two acts is immediately thrown out for the purpose of reaching that finish line. Unlike the last Hunger Games movies being split into two, this is the Hunger Games movie that should have been split into two. We don't get to the motivations and reasonings behind characters other than a line or two then we arrive at them. Another hour and a half of story telling could have fleshed these characters out and made the ending more meaningful. However we're left with a film that doesn't seem to ever end, masked with good acting, set design and great cinematography. But a film that is messy, long and drawn out only to be shot into a moc 10 speed at the end. Leaving this movie feel completely unnecessary.", "review-date": "23 November 2023", "review-score": "5"}, {"text": "My wife and I watched The Hunger Games: The Ballad of Songbirds and Snakes (2023) in theaters last night. The hunger games are struggling to maintain viewer interest so they decide to undergo rule changes, challenging mentors to guide their tributes to success. Young Coriolanus Snow believes he has a winning plot with a talented singer from the 12th district...Directed by Francis Lawrence (The Hunger Games: Catching Fire) and featuring Rachel Zegler (West Side Story), Tom Blyth (Billy the Kid), Viola Davis (The Help), Hunter Schafer (Euphoria), and Peter Dinklage (Game of Thrones).Regrettably, this installment is the weakest in the series and a significant letdown. Despite potential in the writing, Viola Davis delivers a stellar performance, while Rachel Zegler's acting feels rigid and unnatural, lacking authenticity. The writing falls short with average songs, dragging scenes, and a reliance on CGI, particularly in the water bottle and building collapse scenes, which appear cheesy and ridiculous. On the positive side, the villain shines, and the unpredictable evolution of Snow is outstanding. The final scene in the woods, however, disappoints after a brilliantly set-up sequence. The absolute final scene almost redeems the film by closing the premise perfectly.In conclusion, it's best not to continue with any more Hunger Games films. This one falls flat. I would give it a 5/10 and only recommend it to diehard fans unafraid of potential disappointment.", "review-date": "20 November 2023", "review-score": "5"}, {"text": "In my opinion, there are two major issues with The Hunger Games: The Ballad of Songbirds & Snakes. First of all, the timing and momentum of the movie are too slow, and the acting is not on par with that of the original series' cast. While the original movies had a lot of fine acting and characters that I cared deeply about, I did not relate to any of the characters in The Ballad. The Ballad of Songbirds & Snakes is not a total disaster, but it is mediocre at best, with some parts being too lengthy and others too short. Having read the original books and being mostly satisfied with both the books and the movie adaptations (despite their flaws), I cannot say whether the mess in storytelling is due to the book or just the movie's script, as I have not read The Ballad of Songbirds & Snakes. Also Songbirds & Snakes reminds me of that bad last Star Wars trilogy - they copied everything from the original source but failed to catch the soul, charm and grandeur entirely, everything just felt formulaic, even dead.", "review-date": "21 November 2023", "review-score": "4"}, {"text": "I don't know where to start this review as I am just exhausted. Watching this movie felt like a Hunger Games trial.I guess I'll start by saying I'm not the biggest fan of this series. In fact, I didn't even watch all of the films until just a couple of years ago during the COVID shutdown, and I never thought any of these films went past slightly above average to above average. I'm sure the diehard fans would greatly disagree, but it is what it is.So The Ballad of Songbirds and Snakes, is it the epic that this film seems to be shooting for? Well, to that question, I answer with a resounding no.As the credits rolled and I was looking up scores and reviews for this film, all I could think was, \"What am I missing?\" The positive scores and reviews just puzzle me. Now I didn't think this film was trash because there is some good content here but dear oh dear for a film that is close to three hours but damn near felt like four they didn't take time to do anything.At it's core we are expected to truly love and care for the two central characters Coriolanus Snow (Tom Blyth) and Lucy Gray (Rachel Zegler). Despite both Tom Blyth and Rachel Zegler's efforts, I just couldn't care. Blyth and Zegler gave really good performances in their respected roles but their relationship just felt so rushed, and while I may not care for her person I cannot deny that Rachel Zegler is a talented actress and she does have a beautiful singing voice. She gave a great singing performance as she did in the remake of West Side Story, though not all her songs were that good, and some were just out of place. Her singing, in my opinion, felt more in place during the third act.But that's genuinely what I think holds up this film, the cast. The supporting cast in particular, with Peter Dinklage and Viola Davis being the absolute standouts in their supporting roles, and that's probably because those two characters were more interesting to me than the others. While the rest of the supporting cast gave solid performances, the characters themselves were just either poorly written or didn't have enough screen time to become important. Now I understand, for the most part, these characters are to serve as canon fodder in the arena, but for a film this long, you could at least try to make me care for a character or two.Now for The Hunger Games itself, the titular event. I don't think there has been a more boring Hunger Games. Soo much was going on, but nothing was happening. You'd think the event that is the films namesake would carry more thrill, tension, or drama, but none of that was here. Mostly due to the fact that I just didn't care for any of the tributes, and that's because they bullet trained to this event. Granted, there were certain moments leading up to this sequence that were interesting, particularly the scene in what looked like a courtroom or meeting room where they discussed The Hunger Games and how to make them better. But none of this worked in making me connect to the other characters.Also, this film is more about Snow and his relationship with Lucy than the Hunger Games itself, which would be fine if that relationship was executed properly. I mean, you have the time. You literally gave yourselves the time, so just use it.By the conclusion of the second act, all I could think was, \"There's more?\" The third act, fortunately for me, did garner most of my interest. That's just because I loved the idea of seeing Snow getting back what he lost. It was like watching a dollar store House of Cards, which is a shame because it could've been great, but once more, they didn't take their time. Instead, they really rushed through Snows character arch and cheapened it. I was actually enjoying the whole third act as I genuinely loved the concept that they had here, but it was botched in execution.Finally, after all this, is there at least a satisfying conclusion? No. If this film is supposed to connect in some way to the first Hunger Games, then that ending was terrible. Now I haven't seen the first movie in a long time but I don't see the connection if there is one. This will lead me to say that this is the films biggest problem. They are clearly wanting to tell a prequel story that I feel they want to span into a prequel trilogy but with no guarantees of being able to do that they try to fit everything in one film and it just doesn't work. Because of this, it made me feel like I was watching multiple movies in one when I'd rather watch one movie that sets up a trilogy than watch a single movie that's trying to be a trilogy.Well, I'm going to wrap this up and say that while I didn't hate this film, I definitely didn't love it, and as I mentioned before, there is some good content here. Perhaps with better direction and maybe some better writing, this film could have truly been something special. I will, at the very least, say this was a pretty movie, and it did look good on the big screen.PS. If I had a nickel every time Snow shouted Lucy Gray!IMDb: 4/10\nLetterboxd: 2/5Watched in Theaters.", "review-date": "23 November 2023", "review-score": "4"}, {"text": "Funny people in the comments not expecting songs from a movie that starts with the name THE BALLAD OF.The whole point of the movie was to show how Snow starting rising to power and also how the Capitol started being manipulated into start liking and watching the games.It was a great adaptation, the most faithful one since Catching Fire. Rachel Zegler is a great singer and a great actress. The songs are very important to the story, every song contains an important part of the movie ESPECIALLY the one she sings laying down by the lake.People need to actually pay attention to what they're watching.", "review-date": "16 November 2023", "review-score": "9"}, {"text": "The Hunger Games: The Ballad of Songbirds & Snakes is a prequel to the Hunger Games film series. This film is directed by Francis Lawrence, who also directed the last three Hunger Games films.Young Coriolanus (Tom Blyth) is assigned as the mentor of tribute Lucy Gray Beard (Rachel Zegler) from the poor district 12. Coriolanus must prepare her for the popular Hunger Games.During these training sessions, Coriolanus learns about the dark side of the Capitol and what kind of danger the tributes actually face during the Hunger Games. He tries to help Lucy Gray as much as possible, but this can sometimes get him into trouble.This prequel could be entertaining for fans of the Hunger Games film series. Through this film they can learn more about the history of the world and the younger life of President Snow. They show so well how this older world worked and what the technologies looked like and worked at the time.In addition, the prequel seems a bit unnecessary, because in addition to the extra lessons you can learn as a fan, the film offers little new or special. The film also remains on a familiar side and brings little new with it, except for some light history lessons. As a result, the film can seem a bit long-winded at times. Especially due to the unnecessary, long running time of the film.The visual effects also seem less realistic compared to the better films in the film series. Later in the film it is more noticeable that the actors are acting in front of a green screen, which can sometimes take you out of the film. The CGI can also be seen somewhat. Furthermore, most of the weapons in the film do not always seem believable. This way they bring out less tension when the characters fight each other with these.Tom Blyth comes across well as a younger President Snow, but is still a bit at the beginning end of his acting career. Compared to Donald Sutherland, he tries to appear a bit lighter and friendlier as this character. Unfortunately, knowing how this character ultimately became this way does not provide much interesting information. Unfortunately, Rachel Zegler also delivers more standard acting. Especially when you start comparing her to Jennifer Lawrence. Jennifer Lawrence really managed to break through as an actress thanks to her acting in the old Hunger Game films.Supporting actors Peter Dinklage and Viola Davis provide the best acting. Viola Davis also shows that she had fun acting in this film. In the third, lesser chapter of the film, Burn Gorman provides the better performance as an army commander of district 12.", "review-date": "19 November 2023", "review-score": "4"}, {"text": "I have connected faster to characters in 40 minute tv show episodes than any of the characters in this 2 hour and 38 minute feature film. None of the characters are likeable, none of the characters have clear motivations - except Snow's friend, who constantly tells us that something is rotten in the state of Panem, in case the audience fail to connect the dots themselves.When the movie reached its conclusion, I had no idea what journey it was supposed to convey. If not for the pompous soundtrack (a dissapointing score by the otherwise great James Newton Howard - I think he struggled finding an emotional core in the screenplay) I wouldn't have known that the movie had reached the end, and our main characters journey towards evil was complete.And what the hell is it with all those music acts?! I know they are part of the book, but in the movie they are just annoying, mainly because the lead actress performing them sings like some cocky, pitch perfect dixie chick with overly theatrical facial expressions - resembling Jack Black at his most exaggerated.Katniss in the original movies felt grounded, real, vulnerable. Lucy in this one has no sense of purpose. She is just perfect, powerful and righteous from the get go, leaving no trace of dubiousness, no space for development, and thereby, no reason for the audience to connect with her. She feels like a plot device on Snow's journey towards darkness, with absolutely no chemisty between her and our antagonist to be.What a waste of my time.", "review-date": "15 November 2023", "review-score": "5"}, {"text": "I will start by saying I don't think it's an 8, maybe a 7.5-7.7 so I rounded up.However, I went in with low expectations, expecting a big budget movie with a poor storyline but otherwise reasonably watchable. Well, I was pleasantly surprised to find myself hooked! And I daresay it was one of the better Hunger Games movies.The bad reviews I've read seem to miss the point. This is not a story about the origin of the games, it is not a story about 'Lucy Gray\" (even though her name is said about 1000 times)... It is a story about Snow and why he became the psychopath we know from the original stories. I found the not-so-happy ending refreshing and if you enjoy and understand social economic/philosophical dilemmas in terms of human psychology then it adds a notch of appreciation.Viola, Tom and Peter were excellent in their portrayals. Zegler was fine, a little theatrical but given her background I suppose understandable.I don't understand the hate. Especially the 1-3* reviews. Like, what were you watching!?", "review-date": "26 November 2023", "review-score": "8"}, {"text": "It's been some years since the franchise have us Mockingjay Part 2, my interest peaked at Catching Fire, but slowly diminished as it went on, I thought this looked recent from that trailer, for me though this was a bit of a damp squib, it wasn't bad, it just didn't hold my attention, a film I just couldn't get into.I had a feeling the film would struggle without Jennifer Lawrence, and it really did, I had no issues with Rachel Zegler's acting, indeed I thought the was rather good, but I couldn't attach to hers, or any of the characters, I just found them all a little anonymous, and almost impossible to empathise with.A mixed bag in terms of production, I thought some of the visuals were great, some terrific special effects, but all of that music, it just wasn't for me, I didn't quite see the appeal.Do yourself a favour, go and see Saltburn instead, an infinitely better film, I did thr double, that captivated me, this one sent me to sleep.5/10.", "review-date": "17 November 2023", "review-score": "5"}, {"text": "I'm staggered by the stupidity of the script, the characters, story arcs, motive, plot. It's mindless and random most of the times, seemed like an AI wrote it based on a templates of generic films. Good guy turns bad just because story needs him to be, two characters fall in love just for the sake of it. The dialogue between friends is constant plot point and a script note where main dude always highlights how he is poor and his friend has a rich dad, it can become a fun game because whenever these two are in the scene together you start to expect it to be mentioned, and it always does lol. Very bad, maybe writers strike affected it, but it's based on a book and I don't know maybe it's the source, I doubt I'll read it after this anyway.", "review-date": "17 November 2023", "review-score": "3"}]}, "Die Hard": {"Directors": "John McTiernan", "Year of Release": "1988", "Content Rating": "A", "Runtime": "2h 12m", "IMDB Rating": "8.2", "Reviews": [{"text": "This original action classic has been hugely influential over the years - and it's no surprise, as it's one of the best action thrillers ever made. New meaning is brought to the word \"action\" as here it is exhilarating, furious and nothing less than exciting. The premise is simple: one location, one good guy and twelve bad guys. Cue lots of explosions, fist fights, blood, violence, and plenty of shooting too. The thrills come from the suspense of Willis using his wits as well as his brawn to fight the bad guys and save the hostages.When watching this film what becomes immediately apparent is how fresh it is. This hasn't been filmed with some cheap cameras for a quick buck, it looks professional and couldn't be less polished. The photography is clear and brings out the best of the surroundings, while the music has obviously been carefully chosen to convey the right mood. And, strangely enough for an action film, the acting is actually very good. Unheard of, as remember this was back in the days where Schwarzenegger and Stallone were the top stars of the action genre. Bruce Willis excels as the wisecracking, sardonic cop, and you can't fail to like him. He's consistently witty and provides a powerful presence when needed - it comes as no surprise as he lived off this image for the next six or seven years.The supporting cast aren't half bad, either. The reliable Bonnie Bedelia takes a break from her usual highbrow, \"moral dilemma\", television movie fare as Willis' tough wife, while Reginald Veljohnson is also great as a sympathetic cop - you just want to hug him. But most memorable of all is Alan Rickman for his excellent turn as the cool, calculating terrorist with a carefully-crafted German accent and a fine line in natty suits. Rickman is THE bad guy of modern cinema, watch any subsequent action film with terrorists and you'll see people trying to be him. He's that good. The rest of the cast of terrorists have all been picked for their imposing looks, and they're not bad either. Keep your eyes peeled for fearsome Bond baddie Robert Davi in a minor role as an FBI man.As well as the tense running around in corridors and stand-offs between Willis and the various creeps, this film really delivers in the action stakes. The guys here really do look like they are trying their hardest to kill each other, and we get people flying down stairs, getting chains wrapped around their necks, getting shot all over the place. Every kill that Willis makes is original and exciting. There are also plenty of ace stunts, like when Willis jumps off an exploding roof with only a fire hose tied around his waist. The gore level is high, graphic in fact, with people being shot apart wherever you look, and it's definitely a film for all cinema fans to enjoy. Consistently entertaining and strong enough to withstand repeated viewings, this is the first and final word on the \"one guy versus lots of bad guys\" sub-genre of the action flick.", "review-date": "25 June 2016", "review-score": "10"}, {"text": "In stepped John McTiernan and Bruce Willis with Die Hard. Willis, most famous at the time for the comic TV Series 'Moonlighting', made a perfect ordinary-man-in-an-extraordinary-situation action hero. He was believable as John McClane and not immune to being hurt. He bled and felt pain, a first for the genre. And yet his cool confident delivery of a great wisecracking, intelligent script made him all the cooler. But most credit should go to Director John McTiernan, king of the sophisticated action flick. He made action movies slick, smart and full of pace and wit while never letting up on the bullets, cars and bombs front. Special praise must go out to Alan Rickman too whose performance as chief baddie Hans is to this day one of cinemas finest, moving convincingly from cool, calm and collected to desperate and nervous, never once seeming anything less than utterly ruthless and calculating. Even after we discover that Hans isn't there as a political terrorist but simply as a thief, he loses absolutely no villain credibility when he responds to Holly McClane's criticism by saying \"I am an exceptional thief, Mrs. McClane and since I'm moving to kidnapping you should be more polite.\" Although we know Hans is capable of vile acts, he actually sees those as merely means to a greater and somehow justifiable end. His disposition is almost humanitarian and you would imagine him as quite a gentleman outside of the context of the crimes he commits in Die Hard's arc. In the end though, Hans is a pure sociopath that even the audience is conned into sympathizing with. I would actually argue that Die Hard is the greatest pure action film ever made. Yippie-ki-yay *muddy funster*... and happy holidays.Overall rating: 9 out of 10.", "review-date": "5 May 2016", "review-score": "9"}, {"text": "Even if the non-action parts are a tad slow in comparison, that is more than compensated by so many things that makes Die Hard so brilliant.For one thing the action is explosive and consistently exciting, and the cinematography is astounding being very inventive and colourful. John McTiernon(The Hunt for Red October, Last Action Hero) directs briskly and efficiently, and the pacing a vast majority of the time is exhilarating.Then there is a terrific score by Michael Kamen, some intelligent and witty scripting and a plot that doesn't feel forced or convoluted. Not to mention some excellent acting. As good as Bruce Willis is, yes his character is somewhat two-dimensional, but he is also resourceful and world-weary and Willis handles this really well, it is Alan Rickman who steals the acting honours as Hans Gruber. Gruber is cold, calculating, suave and menacing, in my opinion only Rickman could do justice to such a character. Overall, a superb movie, not only the best of the Die Hard franchise but one of the best of the action genre. 10/10 Bethany Cox", "review-date": "15 May 2010", "review-score": "10"}, {"text": "\"Nine million terrorists in the world and I gotta kill one with feet smaller than my sister.\" Well, what else can I say besides that this is \"THE\" (can't stress it more) action movie from the 80's with a young Bruce Willis. Personally, I don't even know how many times I've seen this movie. \"Die Hard\" remains an example for all action movies that followed. At that time you had the Sly and Arnie action movies. But these were more a performance of brutal violence, with big muscles and a sense of invincibility. Bruce showed a clever, shrewd, caustic action hero, who can take a beating, but on the other hand shows that he's not completely invincible.Of course, the action in films nowadays is much bigger, more impressive and mind-blowing, but the strength of this film is the story, the accumulated tension, lightness and the dry humor of Bruce Willis. From the first minute he takes you in his grip, and he won't let loose. You see him slowly evolve from a wrinkle-free clean-shaved top cop into a reasonable damaged hero. This pattern keeps coming back in the next two parts, which are also top movies of the same caliber.You'll notice this is already an old movie because for instance lighting a cigarette in a public place isn't prohibited. But how the action scenes are imaged, is still top-work and should be the aim for many action flicks.I think the sudden confrontation between Gruber and McClane is one of the strongest scenes in this film, along with the well known \"Yippie-kay-yee\" cry. Trademark of Willis. The fact he likes the character of McClane a lot, you see clearly in \"The Last boyscout\". In that movie he plays an impoverished detective with the same coolness and cynical, dry humor as McClane. Too bad that in the last two Die Hard movies, McClane is only a shadow of himself like in the original movie.\"Die Hard\" is one of those rarities in movie land, which you can watch without thinking \"Pfft Again this movie\". It remains, for me, an enjoyment to watch.More reviews here : http://bit.ly/1KIdQMT", "review-date": "9 September 2015", "review-score": "9"}, {"text": "(In brief)\nBy any measure, \"Die Hard\" was a pretty muscular movie back in '88. It made cultural icons out of its two stars and the explosions were guaranteed crowd pleasers. The script (note-perfect) ran like clockwork with setup-and-payoff and was stocked with memorable characters throughout; the hero reluctant and vulnerable, his stakes ever ratcheting, while the action would just keep mounting until . . . Well, there wasn't any more opulent high-rise. It doesn't matter what time of year you watch this movie, it functions perfectly in July and December (or even today, so close to Halloween) and always his the spot. It's the ultimate \"You can't go wrong with\" movie.(Less brief)\nAfter twenty minutes of story setup, BAM! The guns start blazing and the death toll gets going. At a certain point, this just becomes kind of a theme park ride as John McClane scrambles through the bowels of Nakatomi Plaza and everything's raining down around him.McClane is the key to making all of this work after all. He's the ideal rally-behind character, neither hulking nor shredded and always thrust into a fight; and Bruce Willis is working at peak likability. But he's matched by Alan Rickman, the master scene-stealer, as devilish as they come. It's a rivalry commensurate with such a big movie.And McTiernan's the perfect director for this gig. His direction is self-assured, his camera calm and measured. Sure, we're confined to this building the whole time, but the audience had plenty of moments to take a breath and soak it in. Put it this way: can you imagine someone like J. J. Abrams helming this? Stock up on Dramamine first.I can go on and on, but the bottom line is this: \"Die Hard\" is just *fun*. There's joy in the gunfire, personal injury and wanton property destruction. I always feel great after watching this.", "review-date": "30 October 2022", "review-score": "10"}, {"text": "Of course the Action Genre existed before Die Hard. After all you had The Terminator, Commando, Top Gun, Roadhouse...but didn't Die Hard absolutely revolutionize the eighties action Genre. It came like a savior and encompassed everything that would blow you right out the back of the theater and made Bruce Willis an absolute idol in the Action world and for good reason. Die Hard had pointless nudity, scores of bad language, bloody death, guns, explosions, a gritty, tough as nails, sweating, dirty hero that takes on everyone with nothing more than a hand gun and his brains. If you watch Willis in Die Hard it's a thing of beauty. His shirt torn off, bare foot, wounds all over him...he looks like he just crawled from a war rather than stalking terrorists through an enormous high rise office building in L.A. The script was so dead on...it was basic, it was to the point, it has great sarcastic humor and one liners that could never be forgotten. And Willis was the man to pull it all together. Add a decent supporting cast, a guy on the ground who is like his partner and a MacGyver style of killing bad guys that will go down in history...THIS IS DIE HARD.Bruce Willis was brought up right in the Prime of his TV Series Moonlighting where his irresistible charm and personality made him a hit. John McLean was David Addison but with a lot more guts and a lot more ammo. That only made the film more exciting to fans of Willis already. Willis has a way of just making everything edge of your seat and everything believable. Who else could make you smile in fear when he's diving out of a 30 story window attached to a fire hose while the roof of the building is exploding. He really doesn't single handedly make the film...the supporting cast is terrific. Bonnie Bedelia is great as McLean's straight laced, professional and estranged wife. They make an odd yet touching couple. They have some electricity and it's ironic and yet sensible that they don't end up together throughout the series. Still Bedelia is a great female lead and her character is strong and not at all misused in the role. Alan Rickman is just one kick ass bad guy. Can you say anything else?? As terrorist Hans Gruber he is terrifying, evil, brilliant, and you just despise him and you can't wait to see him go up against Willis and he does. He doesn't stand a chance but Rickman is still brilliant as the bad guy. Reginald VelJohnson plays a small yet very important role as Willis' guy on the ground on the other end of a walkie talkie. They don't know each other, and barely know each other's name but yet they become as close as partners and they too are odd together and yet fit. William Atherton has to be mentioned even though it's a very small role, it's Die Hard history that he plays slimy, tabloid reporter Richard Thornburg who gets his just end by Holly McLean's fist which becomes a running joke in the series.Die Hard is everything that people would look at in disgust now in the new millennium and yet it was everything the eighties stood for when it came to action and heroes. McLean has a cigarette dangling from his mouth, blood pouring everywhere, and a happy ending despite all the destruction around them. If you haven't seen Die Hard you can't ever proclaim yourself an action fan because Die Hard IS action. It's the film every action film strives to live to and will never meet...whether it was before 1988 or after. We won't ever get something like this again. It's an absolute 100% classic!! for all the wrong reasons!! 10/10", "review-date": "7 February 2007", "review-score": "10"}, {"text": "In the late 1980s, Director John McTiernan refined the action film genre with this action- packed thriller that not only stars Bruce Willis is the role that defined his career, but also brought impressed audiences everywhere with ecstatic action sequences complete with amazing practical effects, inspiring characters, and one of the most original scripts for an action movie written for its time. This movie stars Bruce Willis as John McClane, a New York cop who heads on vacation to Los Angeles for the holidays, to spend Christmas with his wife Holly Genero (played by Bonnie Bedelia) and kids. Upon arriving at the Nakatomi Plaza building where she works, he and his wife ended having an argument dealing with family matters. Their dispute is eventually interrupted when the building becomes under attack by a dozen German terrorists lead by the ruthless Hans Gruber (played by Alan Rickman) who's intent on robbing the company of its money. Pitted against overwhelming odds and Gruber's diabolical mind, John McClane must take matters into his own hands and fight off the terrorists who have his wife, along with hundreds of innocent civilians held hostage, with no aid from the Los Angeles Police Department who are helpless against the terrorists' overwhelming power.My family and I catch this fi on cable almost every year during the Christmas season and this never gets old. Unlike other action films from the 80s that spit cheesy little one-liners and mindless gun shootouts, this film presents viewers with a very likable protagonist who is self aware with his flaws and has feels very human, a Villain who is near equally likable and incredibly smart, and the dialogue between these two characters (which are spoken via walkie-talkies for the majority of the time) is very witty and clever that keep viewers' attention. The main character John McClane spends most of the time fighting off the terrorists who are lead by Hans Gruber, and the scenes are exciting to watch. Glossing with intense gunfights, explosions, stellar camera-work and fight choreography, the scenes keep viewers strapped to their seats. In the scenes when the action lightens up, there are some interesting conversations between characters like McClane, who at one point, shares a tender moment with a cop by admitting his flaws as a husband and a man as a whole. These moments are make you feel for the character and are presented in a realistic way and not sappy way. Bruce Willis does an excellent job as the main character and his performances him as the action hero he is today, along with his famous line \"Yippie Kay Yay, motherf***er\". The same can be said about Alan Rickman is gives off a performances as the one of the most charismatic antagonists ever put on screen. What really impresses me about this film is the action set pieces. The Nakatomi Plaza that serves as the film's main setting (at least during the beginning) is shot nowhere other than Twentieth Century Fox headquarters. Quite interesting!Die Hard is one of the most influential action films ever made and shines with nearly every aspect an action film needs. It is a good movie for viewers to pop a bag of popcorn, sit on the couch, and watch. Director John McTiernan did a fantastic job with this film as well as the cast. This film is a textbook example of what action films need to be and a movie that every action fan should not miss.", "review-date": "3 December 2015", "review-score": "9"}, {"text": "DIE HARD (1988) **** Bruce Willis, Alan Rickman, Bonnie Bedelia, Alexander Godunov, Reginald Vel Johnson, William Atherton, Paul Gleason, Hart Bochner, Robert Davi.  NYC cop John McClane (Willis in his star-making iconic role) is visiting LA at Christmas to reconnect with his estranged wife Bedelia who is at an office party that becomes a nightmare when a group of terrorists take over the building led by Hans Gruber (perfect Rickman) a German nutjob out to filch millions in bonds in the vault of the Japanese company.  As the \" fly in the ointment\", Willis does his damnedest to stop him at all costs relying on his street-smarts and out-guessing as time ticks away.  Great blend of action suspense and much welcomed humor.   Best bit: Willis plunging from a rooftop attack by the FBI (thinking the disheveled cop is one of the bad guys!) attached to a fire hose and shooting his way into an empty office!  Hair-raising and exhilirating fun for all. \"Yippiee-Kay-Ay !!!!\" (Dir: John McTiernan)", "review-date": "6 March 2003", "review-score": "10"}, {"text": "Die Hard (1988) the first action film is by far one of the greatest best action movies of all time from the 80's till this day hands down. It is my number 1 personal favorite action movie of all time, I love this movie to death! I love it so damn much and I have fun watching it so much. I have to talk about this movie: It is one man army fighting against a team of terrorists with automatic weapons and plastic explosives. Bruce Willis performance was excellent in this movie John McClane is his best role ever. It is my number 1 personal favorite action movie of all time, I love this movie to death! It's stay in my heart forever. To me it felt this film realistic and it makes you think that you are alone trapped in a building against bunch of terrorists what will you do? This film has heart and soul. A lot of movies have try to do that premise since, but no movie has nail it like \"Die Hard.\" This is a modern day action film of the action genre. I watch this film as a teenager I even watch it with my mom it was ultimate thrill ride. I love everyone in here all the characters and the lead character. I love that McClane is alone he has no help, all telephones doesn't work he is barefoot with his gun and the only help has is from Sgt. Al Powell down there who didn't even see him at all but were both talking on a radio from cop to cop. I love that bond between those two lead heroes. I always love when McClane talks to himself whenever he was about to do something crazy. It is going to be 30 years anniversary this summer 20th July. I love this film to death I am hugh fan of Die Hard films I love this film so damn much. I would really love to see this movie in a widescreen in a movie theater. It was directed by brilliant John McTiernan it is is based on a novel Roderick Thorp Nothing Lasts Forever. This is a masterpiece action film that started all action genre one man army types battling terrorists while trapped in a confined space. It was arguably the first one in the action genre. This movie has everything . It has intense Action, Drama, Thriller, twists, great dialogue, explosions, fights. Exploding building, great helicopter explosion action scenes. John McClane is one man against a whole team of terrorists. A cracking Action Thriller from beginning to end, Die Hard explodes with heart-stopping suspense! It has great cast, great plot, great explosions, no shaky cam, doesn't deal with CGI, but real actions real practical effects. Great Direction from John McTiernan, great dialogues, great acting from everyone. Everyone does an excellent job. Bruce Willis is a bad ass action star as John McClane. It has a great bad-ass action hero who does impossible buy stopping the terrorists who were actually a real terrorists who try to steal the money in a vault 640.000.000$ in bearer bonds stored in the building's vault. My favorite action sequences and the best part of Die Hard: McClane grabs the fire hose, ties it around his body jumps with the helicopter about to kill him. Then Gruber blows it a second after McLane jumps off the roof! It was an incredible explosion that totally takes out the helicopter. But McLane is falling down the side of the building and needs to get inside quickly this is the best scene in the movie my favorite. McClane climbs in the elevator shaft escapes Karl and his men trying to kill him. McClane shoots on the table with his gun killing Marco. (According to the director, the proximity of the gun to Willis' ear during this scene caused permanent hearing loss for Willis.) \nMcClane shot's Hans and Eddie \"Happy - Trails, Hans...\" Incredibly satisfying action in a brilliant action movie! McClane try to save Ellis when Ellis try to save him self. McClane was afraid of flying and he always carry gun because he was afraid someone would have hijack it. The fight between Karl and John was excellent and well choreographed. McClane drops C4 down the elevator shaft and destroys the entire floor where the terrorists are firing from, giving the cops a chance to retreat. I love The broken glass scene. He shoot's and kills two terrorists with his machine gun to escape Hans and Karl, John McClane is forced to sprint over broken glass while barefoot the best bad-ass scene in the movie my all time favorite. Three terrorists are shooting on McClane on the roof chasing him in which he escapes in the beginning of the movie awesome. Karl shoots in an elevator shaft in which McClane is hiding a real kick-ass scene I love this film to death! I love the characters in this movie: John McClane a real action hero to me that does something that no one can he stops a team of terrorists. Hans Grubar the German mastermind he was ruthless and brilliant and he would do anything to steal the money even killing people and get what he want's. Alan Rickman's performance was excellent I love him to death in this movie. I really miss the actor he was the best villain of the whole world. The LAPD Supervisor (Diana James) I like that girl she was so good when McClane call's her for help, I love it. I love Sgt. Al Powell how he stand's up and defends McClane against his supervisor. Reginald VelJohnson does a brilliant performance as a great supporting hero in this movie. I love Deputy Police Chief Dwayne T. Robinson to death he is my favorite character in here. Paul Gleason was so good I love his performance - \"kick ass.\" I love how he tried everything to safe the hostages including SWAT team who were badly hurt. I like Richard Thornburg in this movie who is annoying reporter but I still like it. Bonnie Bedelia as Holly McClane's wife was great.John McTiernan directed excellent this masterpiece Jeb Stuart and Steven E. de Souza wrote a script that it delivers. The helicopters in here were models in this movie delivered, to me the action scenes felt realistic. This movie has ton's of action and you never get bored with it. Michael Kamen made a music score and you never get bored with it. You'll see lots of heavy automatic and explosive weapons, and you'll see them used well. The film is violent, and bloody rated R with real blood squibs. 10/10 it is my favorite action film in the action genre I love this film to death it is my personal action favorite film. I miss movies like this I miss action movies like this one today I want them back. It is a shame we don't have movies like this today.", "review-date": "4 February 2018", "review-score": "10"}, {"text": "The ultimate combination of action, crime and Christmas, Die Hard is timeless in its appeal. Willis is the perfect casting in his most iconic role of McClane, with Rickman the faultless foil, as the equally iconic Gruber.Not only is the action explosive and pulsating, but the wider cast of characters also get some form of arc, fleshing them out. Dialogue is great (even if the German may be a bit off), and the setting never tires despite being restricted within the single building.Big budget, all-out action and perfect one-liners, all in one festive present.", "review-date": "5 December 2021", "review-score": "9"}]}, "Salaar": {"Directors": "Prashanth Neel", "Year of Release": "2023", "Content Rating": "A", "Runtime": "2h 55m", "IMDB Rating": "6.7", "Reviews": [{"text": "Almost 90% of characters, including the antoganists, in Salaar praise the Hero for what a great destructor he is. The value of each character in the movie depends on how much of an extreme buildup they give for the Hero character.\"He did that\",\n\"He will do that\",\n\"Until he asks, the Sun won't rise\",\n\"He is here, the universe is watching with fear\"\n\"He is a dinosaur resurrected in human form\"and so on and so on and so on and so on and so on.You are already tired. And, this is also already a sign of worst things to arrive and they do arrive with full force. Every scene the hero Prabhas is shown it comes with some epic music as if a war was just won. Every single thug with a weapon is beaten to pulp by the Hero. No need to mention, with bare hands. No matter even if the warring group holds in possession of modern war tanks and kalashnikov's and standing right opposite the Hero with an intent to kill, the hero kills each one of them with a machete.In one particular scene, the Hero is on the verge of killing an important character, all the 50 odd army men around him falter simultaneously in loading their rifles to shoot him. Yep, not a single one. Everyone drop their bullets or guns slip from their hands. All 50 falter loading the damn rifles at the same time. The Hero is let to finish his killing job at ease. That is how a great fighter the Hero is. Or, how cheaply incapable the villains are.Final thought: DON'T WATCH THIS PATHETIC THING.", "review-date": "30 December 2023", "review-score": "2"}, {"text": "Salaar has been my most-awaited film for 2023. It ticks most of the boxes for the mass movie fan in me: A mass movie focused on a single character dominance, Neel directorial which is usually a no-nonsense action movie with cracking goosebump scenes and a much awaited comeback for Prabhas who is tailor made for characters like this amongst other things. Salaar somehow touches most of these boxes but does not check it wholeheartedly.I will approach this review differently by describing how different aspects of the movie works but falls short somehow:The Plot/Story:\nThis is definitely the most complex storyline of a Prashant Neel movie. While the plot gets really interesting towards the end, you tend to realize that a lot of time was wasted in the first half for no good reason. Eventually the movie leaves a lot to be explored in Part 2 but I feel there could be too much left to show in Part 2 and I'm afraid there is going to be a tough job for editors. It is also quite a risky move to have not even planned to shoot Part-2 yet (which Neel has admitted in interviews) with so much left to be told.The Action:\nFinally Prabhas gets his groove back with the action sequences which perfectly suit his body language. There are some great creative choices on some of the action scenes which are definitely bound to get cheers in the cinema halls although they aren't entirely logical. There are creative killings which justify the A rating but they were definitely not necessary for the plot, not that I'm complaining. But I would have definitely loved to see some more physical effort from the lead characters for some of the action scenes. At times it is just too cool and too easy.Screenplay:\nPrashant Neel's strength has been screenplay over the storyline in his past movies but in Salaar it is the other way around. The movie does follow the traditional way of telling flashback stories like most mass movies but as the movie gets close to the end, there is no payback to the flashback narration. The movie ends like an interval scene which we have seen in most of the mass movies. This ending makes the first half screenplay seem pretty odd.Dialogues:\nNeel's previous works have always boasted of minimal but impactful dialogues. While Uggram had some of the best written Kannada lines, KGF had very quirky and mass one liners especially with a good mix of Hindi. There aren't any trademark dialogues in Salaar which will etch in one's memory but Prabhas and Prithwiraj's does have some fun one liner exchanges. Those also serve as the little humour element in this movie. Dialogues are well written but it is not something you'd remember it for years to come.Music and Background Score:\nMost of us were already slightly disappointed with the background score of Ravi Basrur in KGF 2 as compared to KGF 1. Unfortunately the background score doesn't really match up to Prabhas' screen presence and build up for most parts in the first half, especially for his introduction sequence. The music and background score does get better in the second half and there's a 'main theme music' which could have been made better use of in the first half as well. Overall, the background score falls short of creating some major goosebump moments leading up to the fight.Cinematography, Editing and Visuals:\nBhuvan Gowda continues his stellar form with some great shots and he manages to showcase Prabhas at his best. Aerial shots and shots of the city landscape totally reminds you of KGF 2 in many parts but not in a bad way. The visual effects team have done a great job in showcasing completely imaginary cities, towns and walls. The choice of using Neel's favourite dark-tone does seem excessive at times. Dare I say that they also have done a good job in digitally modifying Prabhas' looks in some scenes, and yes it is evident. While the action sequences are edited well, the same cannot be said about the shifts that we experience in some of the dramatic sequences. While the set design of Khansaar kingdom does remind you of many hollywood movies, the hair and make-up department has done an exceptional job in making each character stand out.Performances:\nNeel manages to explore Prabhas' strengths perfectly by writing a role which involves him being the quiet and dangerous hero. Prabhas' performance does remind one of his Chatrapathi and other mass movie days without the unnecessary comedy and duet numbers. This is definitely the much needed comeback for Prabhas. Prithwiraj does excel as Varada Raja Mannar but at least for Part 1 there isn't any USP element for his role which makes him stand out or explore his strengths. Apart from these two, there is a plethora of supporting characters of which most of them have done nothing but justice to their role. Sriya Reddy, Bobby Simha, Garuda Ram, Madhu Guruswamy, Pramod Panju and Tinu Anand are some of the highlight performers. Of course special mention to Naveen Shankar who even with a very little screen presence makes a major impact and I am quite excited to see him in part-2. Just like the other Neel movies, we do have some creative choices for character and family names.Uggram Connection (Extra):\nA lot has been discussed about this movie being a remake of Uggram, but let me assure you it's not. However Neel has straight up taken some scenes and moments from Uggram and recreated them here. He does have the creative freedom to do that considering its his own work but I personally feel that he should have admitted that to the Kannada audience. I could here some gasps of disappointment in the theatres for some of the exact scenes.Overall, Salaar makes for an almost satisfying theatrical experience but it leaves a lot of things open-ended. While it does deliver on the promise of a violent action film, it somehow fails to connect much at an emotional level. Neel continues to show how good he is at doing what he does but I feel that he does not really justify the time he has invested to bring this dinosaur finally out of its hideout.", "review-date": "23 December 2023", "review-score": "7"}, {"text": "***Salaar Movie Review ***Directed by Prashant Neel starring Rebel Star Prabhas in the lead. Also starring Prithviraj SukumaranPrashant Neel's KGF, this was the reason for watching Salaar & an expectation that there will be link of KGF and Salaar but the later is not there.Coming to Salaar, the movie had given mass moments but it's kind feel of over injection of mass elements which creates a disinterest in watching.Prabhas had given the best with his swag and the way he delivers the action but a viewer who watched Yash in KGF, the same goosebumps is not having when watching Prabhas in Salaar. The background music had been used extensively to elevate the mass sequences which clearly gives an indication that its intentionally made.Prithviraj had given a decent performance.The last 30 minutes filled with action was interesting but when deep driving in the second half, many times the screenplay had been accelerated thereby a lot feeling that something is not going as per it is required.The core of the movie is similar to of KGF. It's about the POWER but Salaar had expressed in through the mode of friendship & violence..There will be a lot which needs to be unboxed in Part so Part 1 is an above average flick for me.", "review-date": "23 December 2023", "review-score": "5"}, {"text": "Devaratha (Prabhas) and Varadha Raja Mannar (Prithviraj Sukumaran) are best friends in Khansaar. Circumstances lead to Deva and his mother leaving Khansaar and living in exile, moving from city to city. Aadhya (Shruti Haasan) comes to India without informing her father and her life is at stake. Deva is assigned to safeguard her but he has to do it without his mother's knowledge as she disspproves his violent side. Protecting Aadhya pitches Deva right against Varadha and things aren't the same among the two friends turned foes. What happened to them in the world of Khansaar is something one is expected to watch in part 2, instead this part is about showing glimpses of where Deva had been and not what he did. Adding to that there are a bunch of baddies in Khansaar and the place's bloodied history connected to Deva.Prashant Neel has reworked his script of Ugramm in a much grand way, going all out in building a new world called Khansaar, just like he did with Narachi in KGF. That justifies him resorting to KGF narrative style for Salaar as well with his trademark quick cut aways and non-linear narrative with constant hero elevations. There are actually four of those in this film. The entire first half is dedicated to introducing and re-introducing Prabhas's Deva. Bigger canvas meant the mother - son segment taking a bigger hit and Neel has not been able to effectively crack it this time around. This is made up for by the terrific pre-interval action block and Prabhas's towering screen presence is put to good use even though his performance remained one toned. It is the entry scene of Prithviraj Sukumaran which had an impact.The second half is exclusive to establishing the world of Khansaar and it's several provinces as right from the King to the several lords are introduced along with the constitution of their own. This is where Salaar takes the bigger deviation from it's source material. The pace does get slow but the ones acquainted with KGF films, know exactly what to expect. The high moments are few but when they arrive, they explode. Asusual the final 15mins leads to an action segment giving both male leads equal opportunity to shine. Neel has kept majority of the story to be reserved for the sequel and this slightly disappoints. The final reveal is good enough to keep the intrigue for the sequel but barring those couple of scenes, the film's narrative is rather flat.Overall, it is not an exceptional intro though it succeeds in generating interest for the sequel. I am going with lenient rating due to the efforts put in to create this world and giving deserving Kannada actors a bigger film to showcase their acting skills.", "review-date": "22 December 2023", "review-score": "5"}, {"text": "Synopsis: The film invests significant time in world-building but falls short of captivating the audience within its narrative.First half: The initial segment is rather mediocre. While the Interval block attempts to instill excitement, the audience struggles to connect with the story from the outset. The buildup feels somewhat excessive.Second half: Exhaustive. A substantial twist at the end sets the stage for part 2, but its impact is diminished by a desire for the film to conclude. The prolonged buildup doesn't adequately match the actual scenes, resulting in a sense of loud anticipation that one wishes to end. Trimming 30 minutes from the 3-hour runtime would have made it a more engaging watch.Background music is subpar, excessively loud, creating an unwanted auditory experience. The songs merely exist without evoking much interest.Final verdict: \"Salaar\" is a film worth exploring when time permits. It has its moments of attraction, but overall, it delivers a rather lackluster cinematic journey.", "review-date": "22 December 2023", "review-score": "6"}, {"text": "Prabhas can't act ofc. If you're not from andra, he is a below average actor. KGF 1 & 2 had us routing for Rocky bhai till the end with great storyline & soundtracks but Salaar lacks all this. Prabhas face looks so bland and emotionless throughout the movie, keep in mind that he was paid 100 crores!!! He just appears tall and big. Thats all. Prashant Neel kept on saying that this movie is full of drama rather than action and I feel like he was taking a safe route because he knew there's no way Prabhas could reach the audience as a true action hero like Rocky bhai. Tbh I fell asleep after the interval and was looking at my watch to see when this movie would end. Just a waste of time and money. Andra audience ofc will hype this up as much they can but the reality is prashant missed it this time.", "review-date": "23 December 2023", "review-score": "2"}, {"text": "I went to watch this movie for Prashanth Neel believing that he would do justice but I came out very disappointed. Too much build up , too much hype and too much slow motion scenes. Anything that is more than the necessity made this movie a disaster. At a point i felt sleepy when there was only information being passed for too long and suddenly there would come a build up with a bgm to just keep us awake. Half of the movie was filled with slow motion which felt like it was prolonging the scene. Prithivi Raj and Prabhas acting and screen presence is great but that alone is not enough for a movie to be successful. It is another downfall for Prabhas.", "review-date": "23 December 2023", "review-score": "1"}, {"text": "I wanted to give 8 stars but there are many in the review section purposefully giving 1 stars even though they haven't watched the film.. all are drowning in ego and forgot at the end of the day it's an Indian cinema....Positives in the movie is cinematography, huge story line and even background music, linke in kgf this time Ravi Basrur's bgm didn't overshadow the dialogues, and I like prithviraj sukumaran's acting more than prabhas but Prabhas is playing that kind of role who talks less one who watched Ugramm will realise thatComing to the negatives- Ugramm's influence is the problem here especially kannada audience feel it as a old food in a new plate, but those who didn't watch Ugramm may like this film and another major drawback what I think is under utilisation of prabhas and less screen space....", "review-date": "23 December 2023", "review-score": "10"}, {"text": "Please don't fall for hype. . We wasted our time. Direction is horrendous, they show part Europe and part some kgf kind city. Nonsense to the core. Why can't they get good story. Who said bloodbath means story, no goosebumps. I believe they have paid for these reviews. The actors just stand stiff and do nothing other than cut body parts, movie does not make sense at all. The movie makes bo sense in many parts. The hero is kept in prison but comes out and beheads a guy in front of everyone. He first begs him to kill him and although there are people with guns all around they do nothing. It makes no sense. This is a very bad movie, please stay away from the hype and paid elements. For Prabhas this would be the end of the career so they are making sure it works. But the movie is bad.", "review-date": "23 December 2023", "review-score": "1"}, {"text": "Neon-drenched action and pulsating music ignite Prashanth Neel's Salaar, but beneath the dazzling surface lies a narrative wasteland. While fleeting moments of potential flicker in supporting performances, the film ultimately stumbles under the weight of its own bombast, failing to connect with audiences on an emotional level.Neel's penchant for spectacle over substance permeates the film. Thundering soundtracks and flamboyant set pieces mask a predictable plot built on overused tropes like \"friends turned enemies.\" The narrative, echoing Neel's previous work, feels reheated and lacks the thematic depth and emotional resonance that captivated audiences in KGF.Prabhas, burdened by a stoic script, becomes a passive observer in his own film. His slow-motion walks and unemotional delivery fail to inject depth into the protagonist, leaving viewers struggling to connect with him or his motivations. The supporting cast, however, fares better. Prithviraj and Shriya Reddy deliver nuanced performances, hinting at the complexities their characters could have possessed had the script delved deeper.Action sequences, despite their visual flair, remain emotionally hollow. They roar with bombast but lack the raw power and thematic weight that fueled the fights in KGF. Neel throws spectacle at the screen, but it's like empty confetti - flashy and fleeting, leaving nothing behind but a sense of disappointment.Salaar's greatest sin lies not in its flaws, but in its missed potential. Glimpses of a compelling story, exploring complex relationships and emotional turmoil, flicker briefly before being extinguished by the film's relentless pursuit of spectacle. These fleeting moments serve as a painful reminder of what Salaar could have been, a film that resonated with audiences on a deeper level than mere visual thrills.Ultimately, Salaar is a disappointing detour for Neel.It descends from the raw power of KGF into a hollow spectacle, devoid of the emotional core and thematic depth that made his previous work so impactful. While sparks of potential glimmer in the supporting performances, they're not enough to salvage the overall underwhelming experience. Skip Salaar and revisit KGF for a more fulfilling encounter with Neel's directorial talent.", "review-date": "22 December 2023", "review-score": "5"}]}, "The Family Plan": {"Directors": "Simon Cellan Jones", "Year of Release": "2023", "Content Rating": "PG-13", "Runtime": "1h 58m", "IMDB Rating": "6.3", "Reviews": [{"text": "Part action, part comedy, here comes a Mark Wahlberg movie that is both typical for this actor, but also something you likely saw (or close to) in the past. That said, its 2023 and almost everything has been done already, so the real question is this. Is it well done this time? Is it fun? And the answer is yes.The movie take a bit of inspiration in True Lies but put its own spin on family road trip comedy with some \"We are the Millers\" vibe, while injecting some decent action sequences in there.Having a runtime of 2 hours make sure the movie put enough emphasis on the familly relations and developing its characters, wich can be a definite plus, but at the same time i felt the movie dragged a tiny bit in the first half. Maybe 10-15 minutes could had been cut. But it didn't detract from my enjoyment.Mark Wahlberg is definately in pretty solid shape still, wich make his character completely credible, but he ain't no martial artist so seeing him go toe to toe with Lateef Crowder (a Copeira expert) did showcase some of his shortcoming. That said, that scene was meant as a mix of comedy and action and not to be taken too seriously so for most peoples who are not martial arts afficionados, it should not be a problem. The rest of the action including gun scenes were well done.Michelle Monaghan is also pretty solid in her role as the mom of the familly. Charming and charismatic. The kids also got to have enough screen time and developement that they felt usefull and interesting in the story. Every character pretty much as its own arc.Overall its a movie that i taught was pretty enjoyable on a first watch. It is a mix between comedy and action but at the same time since it never fully commit to either side, you can't say its a super funny comedy or a big action movie. It is a bit of everything and it makes for a good story tough.Ultimately not every movie is meant to be watch multiple times and considering Apple TV+ has a pretty limited selection of mainstream original movies (Ghosted being one of the few great ones), it is a welcome addition that both casual viewers and cinephile should enjoy.", "review-date": "16 December 2023", "review-score": "7"}, {"text": "While this is not a movie where you'll be amazed by the plot it sure delivers on both action and comedy fronts and sometimes that's all we need from a movie: to spend a good time laugfhingh and see good action.A popcorn movie? Sure, but in a wold where,m save a few exceptions, most movies are very slow burns with crap characters only defined by their gender or secuality I'm just hjappy to see a movie that is just a movie.It has heart too, Michele Monagan never disapoints and even Mark Whalberg does a hreat job as the father figure.A fun ride throug and through, jighly recommended in these dark times as we all deserve to crack a laugh.", "review-date": "19 December 2023", "review-score": "7"}, {"text": "Here is a mess of a movie. It's frankly absurd. Probably the dumbest thing we've seen all year.The above is only partially true if you go into this Apple TV Produced film with the crazy idea that it's gonna blow your expectations out the door.This is what I call a FUN DUMB ACTION movie in reign of Last Action Hero, Or any Mark Walhberg action movie of past. It's ridiculous, sometimes annoying, and has poorly written bad guys. The plot is whatever you want it to be. There's no real story here. Just go with it. Pop your popcorn, add lots of butter and push play on your Apple remote. It's 2hrs long but don't panic. You'll survive.", "review-date": "17 December 2023", "review-score": "8"}, {"text": "This was a cute movie, where Marky Mark (also producer here) is in a physical shape that is truly exceptional, and married to a beautiful wife with only a very civilized age gap. There's product placement, but not too much. There's staggering violence, but it's all squeaky clean so it can be a Xmas movie. All the supporting cast is ethnic just the right amount. The family is flush with tremendous cash, which helps plot advancement as well as beautiful cinematography / scenes.It was very enjoyable, assuming enough suspension of disbelief. The whole thing is obviously very predictable, but it's executed nicely. Everybody but the teenage daughter is world-class level at something, so while it's promoting family values, it is, for a change, not promoting mediocrity.I watched this while cycling indoors, was perfect to get me through my winter workout.", "review-date": "16 December 2023", "review-score": "6"}, {"text": "So there was some money left and no ideas. How easy is it just to remake a high scoring film but without the large budget. This is so copied from True Lies, even the main character has the same job and there is also the evil Asian woman. The ending with a show out against the baddies in an empty building, same. Between the first and last act there is the road trip ala National Lampoon's Vacation and it feels as boring as the real trip possibly would be. A few scenes are inserted to show how the kids and parents are growing to eachother. The film is trying to copy the light hearted touch of True Lies but fails. Is it a bad film? No surprisingly it is entertaining enough to sit along, mainly due to the main characters Mark Wahlberg and the amazing Michelle Monaghan. It's an actrice I don't see much, but she does a great job and it feels there is chemistry between both persons. And Mark Wahlberg never changes and I still love this guy for his commitment.", "review-date": "17 December 2023", "review-score": "6"}, {"text": "In silly but well made, engaging, feel-good actioner \"The Family Plan\" Marky Mark Whalberg lives a blissfully quiet (boring) life with wife Michelle Monaghan & kids Zoe Margaret Colletti, Van Crosby & baby - who know nada of his previous life as an assassin... until the goons of his ex-boss Ciarán Hinds find him, forcing him on a cross-country road trip (in which he battles them while hiding what's happening) to a glitzy Las Vegas showdown (which goes on a tad too long). It's pure entertainment with no deeper value, but all performances are pitch perfect, David Coggeshall's screenplay is solid, and director Simon Cellan Jones splendidly pulls it all together. It's unadulterated fun.", "review-date": "21 December 2023", "review-score": "8"}, {"text": "I liked this. But....It is ground-breaking in concept? Absolutely not.Is the story something unexpected? Nope.Is Wahlberg's acting better? No. Same old Marky Mark,It is cliché? Definitely.However, it is entertaining.I wasn't watching the clock during it or pausing it repeatedly. It held my attention in spite of a rather expected storyline. Action sequences were decent. And Monahan always does a good job. So in spite of some viewers complaining it's not the next great blockbuster, this film still delivers on entertainment.And while her part is VERY minor.. love me some Maggie Q.Minuscule adult oriented content (one, rather tame, scene), no nudity, very light on foul language. Violence is the greatest aspect - and due to the violence, I'd not suggest this for younger viewers. It's NOT a \"family film\" due to the violence.-----------------All that being posted.. and irrelevant to the actual storyline... it was VERY strange to see these optics from an Apple film... all these henchmen chasing down this white suburban family are black. Seriously, ALL the low-level street henchmen/killer were black.. the race dynamics were so, so prevalent they were readily apparent to me. And honestly, that's rarely anything I would notice.", "review-date": "19 December 2023", "review-score": "8"}, {"text": "I give this an 8 not because it is a great movie but, within its \"True Lies\" genre, it delivers. I tend to get bored with non-stop action movies that spurt blood constantly and have no actual human characters. While it's improbable that the average middle aged couple look like the two leads and the whole thing is completely unbelievable, it at least paints an outline of characters and the cast is kind of lovable in their own tropes. Adolescent angst, mom boredom - yeah, it's a bit pain-by-numbers...but it flew past and I didn't check my watch or wonder when is this gonna end already??? - which is about 90% of the time with the crap the streamers make. (See \"Leave the World Behind - no, honestly don't -should've been on the Sherwin Williams channel 'cause it was like watching paint dry!!). You want art? Go to a museum. You want to enjoy a little mindless entertainment with high production values and a pretty great pop soundtrack (yes! An all-too-brief clip of \"Chaise Lounge\" and the cheesiest song ever \"Ice Ice Baby\") then this is your ticket.", "review-date": "17 December 2023", "review-score": "8"}, {"text": "The Family Plan becomes very tiresome fast with it's long run time and generic plot/comedy/action. Nothing is special from this film presented by Apple. Mark Wahlberg tries his best here but can't save this film from sinking even though he stars and is a Executive Producer on. What is also dissapointing is the acting is very bad from everyone involved which is a surprise especially since this is a solid cast. Without spoiling to much of the plot point this reminded me of a cheap knockoff of True Lies in a way. You will know what I'm talking about when you watch this. The Family Plan gets failing grade from me with 4 stars out of 10.", "review-date": "18 December 2023", "review-score": "4"}, {"text": "A completely cliché kind of movie: Some teenagers that are of course always in bad mood change into good kids while a James Bond imitating Mark Wahlberg safes his kidnapped family cause, you know, he was a killer. And how does his family react: Omg he is a killer! But wait we are family, so we need to love him right?Sorry for that but I can't endure anymore movies like The Family Plan.Mark Wahlberg's time is over, I don't even know when the last good movie came out with him starring. Apple wanted another movie (not that they made two movies over the last months for cinema) so the writers thought: wow let's make a funny romantic family action road trip drama movie, man I don't even know how many genres we want to integrate into this movie but it's gonna be awesome! And I have to say the first act isn't that bad. I quiet liked it actually, even if it was a little bit brainless. But what followed was a story that couldn't have been more boring. I don't want to see the classic ending shot where the protagonists walk out of a building with the police already waiting. I want to see a story with twists and turns but besides some left and right turns on the street the movie had nothing like this. If you read reviews to get a recommendation, then I have to disappoint you, cause I DON'T RECOMMEND THIS MOVIE. Thank you.", "review-date": "17 December 2023", "review-score": "5"}]}, "Godzilla Minus One": {"Directors": "Takashi Yamazaki", "Year of Release": "2023", "Content Rating": "PG-13", "Runtime": "2h 4m", "IMDB Rating": "8.4", "Reviews": [{"text": "GODZILLA MINUS ONE (2023) **** Ryunosuke Kamiki, Minami Hamabe, Sakura Ando, Yuki Yamada, Kuranosuke Sasake, Hidetaka Yaoshioka, Yuya Endo, Saki Nakatani. Director Takashi Yamazaki's Herculean efforts of reviving the Kaiju franchise is effortlessly awesome and absolutely top-tier filmmaking with the origin story of the gigantic monster showing up off the shores of post WWII Japan as it engages a full-tilt invasion of Tokyo and its environs with atypical destruction and death. Key to the film's strength is the plot involving ex-kamikaze pilot Kamiki (suffering arguably cinema's most poignant PTSD) and love interest Hamabe as a make-shift family attempting to survive with the thread of a palpable redemption narrative laced with surprisingly heartfelt emotion. The clean visual f/x propel the radioactive creature is jaw-droppingly astounding with some neat extras (his spiny back igniting as it re-charges its nuclear energies is eye-poppingly epic). One of the year's best films.", "review-date": "1 December 2023", "review-score": "10"}, {"text": "I would not call myself a huge Godzilla fan by any means and I mainly went to see this one at the urging of a friend. Holy heaven, I was so surprised by GODZILLA MINUS ONE. In a year where both of my most anticipated movies turned out to be crummy disappointments (BARBIE and NAPOLEON), this movie-- a film I had no initial plans of seeing and had little enthusiasm for going into it-- blew me away.Godzilla is actually terrifying in this. The post-WWII setting was well-realized, with the characters exhausted after years of violence, destruction, and struggle. The characters were all relatable and interesting-- unlike other Godzilla movies I've seen, I cared intensely about their fates and was emotionally invested in the little found family they formed. And thank God for the lack of ironic jokes undercutting emotional scenes-- after so many trash Hollywood movies, I didn't even know it was possible for a blockbuster to be sincere like this anymore.Most of all, I love how life-affirming this film is. The cautious but persistent optimism is such a breath of fresh air. About my only criticism is that the ending twist is a little hokey... but to be honest, I can forgive that. The movie is too good for me to complain about a happy ending.", "review-date": "3 December 2023", "review-score": "9"}, {"text": "I'm a huge fan of Godzilla, I think the original from 1954 is a genuine classic and a great film (not just a great \"monster\" movie). The Heisei era is my overall favorite, and I thought Shin Godzilla was weird in all the right ways. It was one of my favorite movies from that year.This one might be even better. You actually care about the characters. It deals with some very serious topics, such as survivors guilt and the aftermath of war violence on civilians and conflicting emotions around national pride and feeling betrayed by your government. Yet the film is also exciting and optimistic and has some of the best Godzilla sequences ever put to screen. My favorite depiction of Godzilla is as a force of nature, representing the power of the atomic bomb or the fury of war itself. That's the Godzilla you get here. I think this film can very favorably be compared to American classics like Jaws and Jurassic Park, too.I don't want to say too much, it's best to just experience the movie for yourself. The only part that felt a little false to me was the very end, but I understand why the director wanted to do it that way. The special effects look great for the most part, but there are a couple of shots here and there that aren't perfect when compared to some Hollywood movies. However, it hardly matters. This is an incredible film.9/10 easily, probably closer to 9.5My current Godzilla rankings:1) Gojira (1954)\n2) Godzilla Minus One (2023)\n3) Godzilla vs. Destoroyah (1995)\n4) Shin Godzilla (2016)\n5) Return of Godzilla (1984)Special mentions to GMK, Godzilla vs. Biollante, Godzilla vs. Mechagodzilla (1974) and Mothra vs. Godzilla (1964)", "review-date": "30 November 2023", "review-score": "9"}, {"text": "This is an exciting film. The pace, story, imagination, production are all done expertly. Dialogue is in Japanese with English subtitles. I wish I could comment on writing but just be assured that despite my remedial Japanese (and a range of inconsequential translation departures the I detected), the cast's ability to convey agony, loss, hope, love, fear, and anger was appreciated, even with its 'just-right' dose of melodrama. Special effects are superior and well presented.The film sucks you into a vortex of history, monsters, and surprisingly restores your faith in humanity. It makes you fall in love with the characters.Then with perfect timing, reflects the singular and exquisite quality of the Japanese people; their acute sense of the cost of war and their abiding commitment to the future.Because of that, there is nothing in this film that I can criticize.", "review-date": "30 November 2023", "review-score": "10"}, {"text": "From the opening to the ending, I was enthralled by the whole movie. It kept everything that I loved about Godzilla, and was able to make an extremely interesting backstory with the human characters. There was a lot of things that was addressed in this movie that I had never seen before.there was so many things that people will pick apart, but that's upon reflection. I had no criticisms or a reason to dislike this movie the whole time I watched it. So, in that respect, I will give it a perfect score. And I don't go slinging those out just every review. As a Godzilla fan, this was perfection to me.", "review-date": "30 November 2023", "review-score": "10"}, {"text": "Godzilla Minus One is an amazing spectacle on a retelling of a classic Kaiju movie from the prospective of a post-war Japanese veteran who leaves one horror for the next while making an arrangement of \"friends and family\" along the way. The story was so compelling that it didn't feel like two hours past and I was craving for more. The classic Godzilla sounds design, masterful cinematography, along with the original score from Akira Ifukube made this movie an absolute masterpiece on storytelling! The visuals of the Godzilla update made him more memorable and menacing for the citizens of a distraught Tokyo. Highly recommended!", "review-date": "1 December 2023", "review-score": "9"}, {"text": "Godzilla Minus One is one of the best Godzilla films in recent time. It gave me everything i wanted for the first time ever I was actually invested in the human characters and their story normally you are just waiting for Godzilla to show up but not here Godzilla shows up alot and when he does he is BRUTAL. This Godzilla makes things personal by actively attacking the humans. The movie had great pacing where it doesn't feel like it's going on for too long and it was nice to have a darker story set after WW2. It really goes back to the franchise's roots. There's so much to say but it would give a lot away JUST SEE THE MOVIE ON THE BIGGEST SCREEN POSSIBLE 9/10.", "review-date": "30 November 2023", "review-score": "9"}, {"text": "I just saw the advanced screening of Godzilla minus one and I have to say I was very pleased with the final product. If I had any complaints about this movie it is just that the CGI Godzilla often looked weird similar to a video game. However when Godzilla looked good, it was very impressive especially in the water scenes.Unlike every other Godzilla movie I have ever seen this is the first Godzilla movie where I actually liked on the characters and the storyline actually made sense and touched the human heart. It showed what people were dealing with at that time which was directly after world war II and how people were suffering not only with the after effects of the war but also the trauma from being exposed to a huge monster destroying cities.Godzilla may be a fictional character but loss and tragedy are real, and people are dealing with it everyday.Overall I really like this movie and it is obviously a prequel to the original Godzilla movie that came out over 70 years ago. Once you see this movie at some point you will understand why.What I would really like to see since it is clear that there have been multiple Godzilla's at some point in time is some type of legitimate crossover between toho and the American studios who are producing Godzilla monster verse in America. Last thing I or any fans want to see is a competition on who could spit out different and unique Godzilla's in two different countries.Since this is a Toho and Japanese produced movie, it would have been nice to have some of the theater edition Godzilla toys for sale like they do in Japan on every release.", "review-date": "30 November 2023", "review-score": "9"}, {"text": "Finally a Godzilla movie with interesting and developed characters, for this point it's certainly the best of the franchise.(Spoiler part) I also thought the death of one particular character was really surprising... Well, until she suddenly turns out to be alive at the end, in order to allow a happy ending. Kind of ruined the meaning of the death for the main character and emotion part (as the title \"Minus One\" can have a meaning for Japan overall AND specificaly the main hero).The idea to set the story in the 40's Japan is also interesting, as a foreigner i really discovered this post-war period of the country that i didn't really know about (i only saw Kurosawa's \"Subarashiki nichiyobi\" prior to this movie).The actions sequences are also very cool. You definitively won't be disapointed with them. I loved the treatment of the King of the Monsters, who have an interesting design and new ability (both are kind of linked).I saw it in a casual cinema, but i guess the IMAX version is worth it, so go for it if you got the chance.", "review-date": "3 November 2023", "review-score": "9"}, {"text": "After the brain cell killing abomination known as Godzilla vs. Kong, the monsterverse was ruined for me. I also found the movie Shin Godzilla to be kind of boring. I have yet to watch that movie and not fall asleep through it. So when I seen Godzilla Minus One, it blew me away. It is easily one of the best Godzilla movies out there. At least in the top 5. I'd honestly recommend this movie even if you're not a Godzilla fan. It is seriously that good. The humans were great in this movie. You really felt for them and can see how they got to their mindset. The effects were really good. It really looks like a guy is in a rubber suit, just like the good old days, but it is entirely CGI and with it being done on just a budget of 15 million dollars. There is no excuse for a 250 million dollar movie to look terrible when this movie made everything work with 15 times less of a budget. I am in no way interested in seeing Godzilla x Kong 2, but I would gladly see what Toho has in store for THEIR upcoming monster movie projects.", "review-date": "1 December 2023", "review-score": "10"}]}, "Game of Thrones": {"Directors": "David Benioff, D.B. Weiss", "Year of Release": "2011–2019", "Content Rating": "A", "Runtime": "69h 49m", "IMDB Rating": "9.2", "Reviews": [{"text": "What can be said about Game of Thrones that hasn't already been said? It's universally thought of as one of the best series in the history of television. Look up any \"best shows ever\" list and I promise you'll find Game of Thrones near the top of every list you'll find. Obviously everyone knows the last episode was absolutely awful, even most of the actors have come out and said they didn't like it. Having said that, it doesn't take away from the show being amazing. One bad show doesn't take away from the other 72 episodes that were almost perfect! I've watched the entire series all the way through twice now and if anything I just appreciate this show even more.", "review-date": "11 November 2023", "review-score": "10"}, {"text": "You know a lot people say this about a ton of different shows but Game of Thrones is absolutely, without a doubt, one of the best TV shows ever created...it's damn near perfect (except for maybe the last few episodes of the last season) and easily one of my all-time favorite shows! Yeah, the last few episodes of Season 8 weren't that good and the ending was just awful but the first 7 1/2 seasons were so amazing that it still gets a 10 from me! It's one of the rare shows where I can watch it all the way from the first episode to the last and never get bored. I'm pretty sure there's never been a show more talked about or more loved in the history of television than GOT. All you have to do is read through the reviews to see how loved this show really is! It's absolutely amazing.", "review-date": "10 December 2023", "review-score": "10"}, {"text": "Let's say you're reading these reviews and haven't watched GoT yet, but now that it's finished are considering the marathon. What's the consensus? In this case, the consensus is accurate, and that is:Seasons 1-6: outstanding. Deep world-building, intelligent dialogue, epic set-pieces worthy of Hollywood, expert acting, detailed plotting, genuine surprises, great soundtrack used sparingly. GoT is worth watching for these seasons, definitely.Season 7: you suddenly notice the writing and plotting has taken a sharp dive downwards in quality. There are inexplicable ideas, inconsistent characterisation and soap-opera dramas. But at least the entertainment value is still very high, so it gets a pass.Season 8: this drop chasms down to depths you didn't think possible. The writing has got so amateurish that the still-fantastic production values are no longer enough to save it. If you ever enjoyed Lost but were amazed at how bad the final season was, you're in familiar territory here.The biggest problem with the final season was it took us out of the story and got us thinking about its many weaknesses. We lost our suspension of disbelief. Fatal for fiction. It also ruined the series-arcs to the point where a rewatch of the entire series is pointless.So can I recommend a GoT marathon for newcomers? Yes, the first 6 seasons are worth the disappointments later on. But best series of all time it is not. It could've been, but dropping the ball in the final stretch puts it behind the following superior series more worthy of your marathon:Battlestar Galactica (2003-2008)Twin Peaks (all 3 seasons, plus the movie)Breaking Bad", "review-date": "21 May 2019", "review-score": "8"}, {"text": "I'm feeling so heartbroken to see everyone criticising my favourite show of all time. And yes of course that's because of the bad making of the season finale, I can totally understand that. After all these years hardwork, creating and developing each and every character from bottom to top, memories, emotions throughout the process all went to vain for one bad making. It's so painful to accept it for the audience who invested lots of time watching the show from the starting and then finishing it like this! It's a long long journey. I don't even remember the day I started watching it and since then I waited the next year to come for the new season. I can't say anything more. Only one last request, could you please delete the whole season 8 and make a new version of it? Please?", "review-date": "9 April 2020", "review-score": "10"}, {"text": "Was over-time on a gradual binge of watching 'Game of Thrones' from the first episode (gradual because of being so busy), having heard nothing but amazing things about it from friends, family and IMDb reviewers. Plus with such a great cast of talent and a brilliant book series, how could it possibly go wrong? The good news is that 'Game of Thrones' didn't go wrong. Quite the opposite. Not only is it a rare television show that does its original source material justice and treats it with respect but it is on its own merits one of the finest, most addictive and consistently compelling shows in recent years. A television show so brilliant that one has to actually check that it was made for television when everything is done to such a high level that it puts many films made today to shame. This is one of the strongest examples of an acclaimed show that deserves every ounce of the praise it's garnered.Visually, 'Game of Thrones' looks amazing. The scenery is throughout spectacular, the sets are hugely atmospheric and beautiful on the eyes with a real meticulous eye for detail and the costumes suit the characters to a tee. Then there are the special effects that are some of the best of any television programme and are not overused or abused, the scale, the detail and how they actually have character and soul are better than those in a lot of the big-budget blockbusters. As well the cinematography and editing, which are cinematic quality as well.One cannot talk about 'Game of Thrones' without mentioning the thematically, orchestrally and atmospherically multi-layered music scoring and the unforgettable main theme. Again, worthy of a high-budget fantasy/action/drama film.It is hard not to be bowled over by the quality of the writing, outstanding isn't a strong enough adjective to describe how good the writing is. It always has a natural flow, is layered and thought-provoking and demonstrates a wide range of emotions such as suspenseful tension, poignant pathos and witty humour. The story-lines are paced so beautifully, structured with such nuance and attention to coherence, a high emotional level and touch upon complex and sensitive themes with intelligence and tact.Whenever there's a set-piece or more action-oriented scene there's always a reason, never there for the sake of it. Not only are the set-pieces done with a lot epic scale, superb staging, excitement and dramatic tension but underneath all the scale and flashy attention to detail there is a lot of heart and a multi-layered one. They're not overlong, nor are there out of place elements.Characters are a huge part of the appeal too. 'Game of Thrones' has characters that are so well developed and as close to real life as one can get despite being in a fantasy world. These characters are not hero and villain archetypes (Joffrey is the only one close to that, the difference though is that he is an extremely interesting one with a lot of development who ranks well beyond one hundred percent on the threat level scale), they have much more to them and have strengths and flaws. Decisions are logical and one doesn't like any character any less when a decision is not the right one because mistakes are acknowledged and learnt from.'Game of Thrones' cast is full of talented names and, thanks to so well rounded characters and such great writing, nothing but the very best is gotten out of them. Even those who are not favourites of mine. Big acting standouts are Peter Dinklage, Sean Bean, Lena Headey and Jack Gleeson (Joffrey being the king of all young characters with not a redeeming bone in their body).In conclusion, absolutely outstanding and a rare television show worthy of being a cinematic modern classic. This review may sound superlatively hyperbolic, but to me 'Game of Thrones' is that good. 10/10 Bethany Cox", "review-date": "9 November 2017", "review-score": "10"}, {"text": "Game of Thrones boasts an intricate plot with complex characters, stunning cinematography, and intense action sequences, especially its many battles and fights. It's hard to deny that it wasn't a cultural phenomenon that captivated me and many others for eight seasons.I've rated Game of Thrones a nine out of ten for its well-written and multi-layered storytelling, and its fantastic production value. However, despite still having amazing visuals and extremely high production value, like many fans, I was disappointed and to an extent frustrated by the final season's storytelling and how certain plot points were handled, which has lowered my rating from a ten to a nine. Despite this, Game of Thrones still remains for me a must-watch series and I would still highly recommend it to any fan of the fantasy or drama genre in general.", "review-date": "6 February 2023", "review-score": "9"}, {"text": "It was a master piece. It was written to the perfection. It was mesmerizing. It was gripping. It was so shocking that if someone is binge watching this show he/she will need a time-off in between to get their head around things and accept some messed up, yet mind blowing development.But yet, I cant hate it enough after final season. Its like you came to know that you were in love with the wrong one all along. It was like looking at a completely different person. It was like seeing your own dreams and expectations get destroyed. It was not a let down, it was a BETRAYAL!", "review-date": "25 May 2019", "review-score": "8"}, {"text": "I would give this an easy 10/10.. if season 8 didn't exist. But it does, unfortunately.Season 1-6 10/10 Amazing, complex dialogue and intriguing logical story lines with strong character developments, shocking emotional moments and insane action scenes.Season 7- 8/10 - still really good but seemed rushed and had some illogical moments that made no sense like the Ayra/Sansa fall out and the time/teleporting issues beyond the wall which revealed some lazy writing. But all in all filled with great moments and good set up for the final season.Season 8- 2/10. I actually don't know where or start. Season 8 is a joke. Terrible writing. Nothing makes sense. The writers have butchered most character developments and given hardly any satisfying conclusions to their story arcs.Brans story had no pay off at all and his whole role as the 3 eyed raven proved pointless against the Night King.Jaime's redemption arc was cut off instantly with real no reason.The Night Kings death was underwhelming. Infact all of episode 3 was poor, with no real structure and poorly written end to the main story line of the show. The battle was shockingly illogical and horrendous tactics. Zero white walker fights, limited deaths and ridiculous plot armour. Also editing was poor- some moments characters would be surrounded by hundreds of wights but then the next shot they were all gone. The plot armour ruined the battle of Winterfell. 'All' the Dothraki wiped out in seconds yet Samwell Tarly can fend them off. Laughable.No Sansa and Cersei interaction of any sort which I would have liked to have seen. Although I appreciate this is just my personal disappointment rather than poor writing.-Rhaegal taken down by first 3 shots, yet Drogon dodges an Iron fleets worth of Scorpions at Kings Landing, just to serve the plot. I guess Euron forgot about Dany's dragon and her forces.-Jon does nothing all season (why was he resurrected if he didn't end the long night or atleast become King? The whole point of his resurrection is because the lord of light claimed he was needed alive). Speaking of Jon, what was the point of his lineage? It didn't change anything apart from give us unconvincing tension between him and Danaerys. I kind of like Danaerys going mad but it needed a lot more time and thought put into it - It went too far too fast with no substantial development to justify her killing thousands of innocent people. Again, Laughable. It needed seasons of planning and transitioning her character. After Dany's death it just skipped to Tyrion's trial and no one seemed phased over her death.Anything that required any thought from the Writers was done off screen, like Arya and Sansa finding out about Jon's lineage.Cersei, the clever mastermind who always has a deceitful plan up her sleeve does nothing but stand looking out of a window all season. What a waste of a character.Ayra does not use her faceless abilities. How cool would it have been for something like Ayra shockingly kills Jaime in order to get his face and uses it to get close to cersei, she thinks she is safe then is stabbed whilst in the arms of her 'brother' who reveals to be Ayra. Atleast something like that may have been more satisfying a few bricks falling onto her.Bran becomes king. Urghhh. He literally said countless times he could not be lord of winterfell or rule anymore. Why the sudden change of heart? No explanation? Oh typical.Prince that was promised? Oh yeh let's forget about that too. Haha we fooled you audience.However, my main issue was not with what happened but with how it all happened. Rushed and made no sense.Major let downs and bad dialogue throughout. There are some good moments like Brienne being Knighted, but even that becomes ruined when she sleeps with Jaime- their relationship was so much nicer just being about honour and respect for one another. Have to appreciate effort by cast, visual and music crew and the few decent scenes as a whole.Overall- 9/10 purely on S1-7.", "review-date": "10 May 2019", "review-score": "9"}, {"text": "This is the first series i would recommend to anybody , it is an amazing piece of work , the most stunning TV series you will ever watch.\nWhy i gave it 9/10 because of the last season, it's still good but very disappointing compared to all the seasons. YOU will enjoy every episode", "review-date": "19 May 2020", "review-score": "9"}, {"text": "So imagine you go into an ice cream shop and you order a sundae. They've got all kinds of nice stuff going on, beautiful delicious soft serve vanilla bean ice cream, some hot fudge, freshly cracked up peanuts, woah what is that?? A brownie? Some delicious house made whipped cream... Man this sundae is gonna be spectacular. Wow what more could you ask for? Cherry on top? Bring it on!!And then all of a sudden they put an anchovy on top, and then another, and then a couple more, and then squirt some Dijon mustard on for good measure.You don't even want the sundae anymore, in fact, you can't even look back on how nice that sundae used to be without thinking about all the stupid s*** they did at the very end just when it was going so well.That's essentially Game of Thrones. I tried to rewatch it, but as I got through the first season I began looking at where all the pieces land at the end it's literally impossible to go back to. There are just so many ruined character arcs, so much pointlessness, and every time I come back here I drop it one more star it seems like. Game of Thrones is a beautiful anchovy sundae.", "review-date": "2 November 2019", "review-score": "6"}]}, "Indiana Jones and the Dial of Destiny": {"Directors": "James Mangold", "Year of Release": "2023", "Content Rating": "UA", "Runtime": "2h 34m", "IMDB Rating": "6.6", "Reviews": [{"text": "What do the haters complain about? And why you should still watch this final edition.1 The first Indiana Jones editions were the best.This new edition has got the same spirit, the same amount of action, the same amount of adventure and I loved it (almost) as much as the early editions.2 The leading actress Phoebe is a disaster.My personal opinion is that she aint bad at all. She shines. And dont forget she doesnt have to carry this movie, Harrison Ford does.3 Harrison Ford has gotten old and grumpy.Correct. He has been always grumpy! And yes, he has gotten old and director James Mangold shows Indiana's old age in all of it's demise AND glory. Respect!4 There are no jokes. It's too serious with too many killings.Rubbish. There are still enough good jokes, but not the \"in your face\" jokes we were used to. But I love the more subtle, indirect jokes.It is more serious though and I LIKE IT. Even an adventure needs some serious notes, to be more credible. And by the way, I am not a kid anymore and so arent many other Indiana fans!5 Steven Spielberg didnt direct it.But James Mangold did and whoever googles Mangold's Imdb carreer, soon will find out this director has made some fabulous movies. I applaud his direction!I loved this edition. It had everything I needed in an adventure packed movie. It thrilled me. It made me laugh. And the final scenes really TOUCHED me and gave me goosebumps. I had a wonderful time watching this last edition!Just another solidly made Indiana Jones flick. Enjoy the show!Thank you for reading my 2000 th review on Imdb.", "review-date": "3 July 2023", "review-score": "7"}, {"text": "\"Raiders of the Lost Ark\" is on my top 10 list of all-time favorite movie. I did not feel that \"Dial of Destiny\" gave a proper send off to the francise. It seemed like the first half of the movie is nothing but over the top chase scenes about trying to get possession of the Dial. That first half does not invest time to plant motivation so the viewer will even care about the Dial and who gets possession of it. Also, the Helena character is pretty unlikeable. Her passion is in the wrong place. Indiana is at odds with Helena for most of the movie. They do not make a good team. And then Indiana is a deflated version of Indiana that is kind of depressing. And to top it all off, there is no sense of fun and comedy in the movie. I hope writers have not forgotten how to write a good adventure story. \"Dial of Destiny\" misses the mark on many levels. And it kind of bothered me how much unnecessary killing there was in the movie. That is not family friendly. I wanted to really like \"Dial of Destiny\", but as the movie was progressing, I had to admit the movie was just not working.", "review-date": "1 July 2023", "review-score": "6"}, {"text": "I mean Kingdom of the Crystal Skull (2008) may have had its flaws, but still had a sense of fun to it, like an Indiana Jones movie should. There was very little of that here.1969 Indiana Jones (Harrison Ford) is quite bitter, is about to retire has a college professor and his marriage to Marion is ending, but his feeling for adventure comes back. When his goddaughter named Helena (Phoebe Waller-Bridge) comes to him about a special device that could change the course of history.Some actions are pretty good, Harrison Ford is great has Indy, showing his old age catching up with him. And the de aged scenes are pretty descent. Now Pheobe Waller Bridge is so annoying to watch, her over the top know at all attitude made me want to walk out of theater, and she and Ford just never clicked. Mads Michaelson is pretty good has the bad guy. But the sense of fun just wasn't there this time, as the film started to get to the point, I was losing interest. Some moments I liked, but all in all I was just wanting this to end.", "review-date": "30 June 2023", "review-score": "6"}, {"text": "It is 1944 and adventuring archaeologist Indiana Jones is in a familiar predicament: the Nazis have caught him attempting to scupper their nefarious plans. After breaking free of their vile clutches, Jones and his accomplice Basil Shaw discover the fascists have found the Antikythera mechanism, a device created by Archimedes that supposedly reveals time fissures. Jones escapes, foils the enemy's schemes and steals the mechanism- seemingly putting the matter to bed. Some 25 years later, however, Jones is thrust back into action when his goddaughter Helena comes looking for the Antikythera; with an underground group of die-hard Nazis on her tail. Will Jones and Helena manage to save the day before time runs out?Directed by James Mangold and written alongside Jez Butterworth, John-Henry Butterworth and David Koepp, 'Indiana Jones and the Dial of Destiny' is an uneven sendoff to one of the greatest characters in film history, that all too often feels like it came from the 'paint by numbers' school of filmmaking. Mangold tries throughout to recapture the magic of the original trilogy of Jones pictures, and occasionally succeeds; such as in the thrilling opening set in 1944, or a touching reunion between Indy and his estranged love at the end of the film. Furthermore, it is consistently enjoyable watching Harrison Ford on screen as Indy once more, even if he is a more downcast fellow this time; and the odd reference to adventures past is sure to make fans of the series grin from ear to ear.However, the narrative is weak, the characterization of secondary characters is scant at best and- weirdly- at times it seems as if Indy is the sidekick in his own film. Helena Shaw, from the moment she comes on screen, is treated as the real star of the show, despite her being a decidedly unlikable lady. A spoiled and arrogant heiress, she is constantly rude and dismissive of Indy, when she isn't being reckless and impulsive, putting herself and others in danger for her own selfish motives. As written, the character has little to no respect for history or culture, seeing everything as a means to an end. She contrasts starkly with Indy, whose humble respect for his profession and legacy endears him to audiences. Helena, on the other hand, is a self-centered cad, who tries to upstage our hero at every turn. Why Mangold thought she should be made the (arguable) central character when this is Indy's last outing is beyond comprehension, not to mention being irritating and disrespectful to a cinematic legend.Alas, Mangold's poor characterization isn't confined to her alone. 'Indiana Jones and the Dial of Destiny' not only provides us with a discount Short Round in the form of Helena's associate Teddy- a kid more irritating than mischievous- but a discount Major Toht too, in the form of Professor Voller- a Nazi scientist so generic even the incomparable Mads Mikkelsen can't make him interesting. Neither of these new iterations of old characters are very compelling, nor well rounded; and their inclusion in the film feels like a desperate attempt to out-do and re-create times gone by. Furthermore, the few familiar faces that occasionally pop up feel shoehorned into the plot, and Voller's troupe of henchmen are bland and forgettable.Unfortunately, 'Indiana Jones and the Dial of Destiny' contains underwhelming visuals as well, which look cheap compared to the likes of 'Raiders' or 'The Last Crusade.' Much like with the previous 'The Kingdom of the Crystal Skull', there is a phony digital sheen to everything on screen that takes one out of the movie completely, and the questionable CGI is jarring throughout. Comparing the first three movies with the last two, it seems digital processes don't fit an Indiana Jones vehicle, they are the kind of epics that demand to be shot on film with practical effects. Moreover, the exaggerated effects and artificiality of proceedings hamper whatever realism Mangold was trying to foster with his downbeat narrative and allusions to real world history.The main problem with 'Indiana Jones and the Dial of Destiny,' though, is its lack of originality or charm, which the previous films- well, the first three, anyway- had in spades. Mangold seems content to rely on recycled tropes and clichés to forward the story, making this adventure feel like familiar ground instead of fresh fun. The film uses the similar formula of Nazis, ancient artifacts, exotic locations and supernatural elements that we have seen before, but without the wit, creativity and excitement that made them memorable; meaning this iteration of Indy comes as more of a whimper than a bang.Are there some elements deserving of praise in the film? Of course. Harrison Ford is consistently excellent and engaging as Indy, carrying the adventure squarely on his shoulders with his usual ease and charm. Furthermore, John Williams' epic score is stirring and- though her character is unlikable- Phoebe Waller-Bridge brings a nice blend of snark and enthusiasm to proceedings, sharing a good chemistry with Ford. Had they a better script to work with- and if Mangold's characterization wasn't so one-dimensional- they might have made a memorable duo. Additionally, the action is generally well realized- though tends towards the overblown- and there are moments and batches of dialogue that'll have fans of the series entertained, even if they are a bit few and far between.However, 'Indiana Jones and the Dial of Destiny' just isn't great. As an adventure movie, it is too downbeat, and as a final entry in a fantastic series, it is too weak narratively to make much impact. Though it makes for a better overall package than 'The Kingdom of the Crystal Skull,' it's not by much. The character of Helena Shaw is hard to warm to, the villains are forgettable and the visuals are underwhelming. In short, Indy, Ford and the fans deserved a better movie than 'The Dial of Destiny,' a muddled misadventure proving that time waits for no man; not even Indiana Jones.", "review-date": "17 July 2023", "review-score": "6"}, {"text": "I just got out of Indiana Jones & The Dial of DestinyThey have only gone and done it!! They have made a dull, boring Indiana Jones movie!! This is going to pain me to write.It started out great (the first 20 minutes or so) then it's just very meh as it really drags to its ending!! If you don't like what Mangold did to Logan in Logan, you won't like what he has done to Indiana Jones here. He is an old, grumpy; miserable, very depressed alcoholic, who bores his students to sleep and he has retirement forced on him.The chase sequences are clearly green screen and CGI and it really stands out!! It never feels real.Ford is game, and almost everything he does in this movie is believable. John Williams score is the best thing about this movie.Phoebe Waller Bridge is just one annoying woman, I never bought their relationship for one second, nothing feels real. None of her jokes landed and in the full movie, there was only one laugh in my screening and that was during a Raiders of The Lost Ark call back.Mads Mickelson is as reliable as ever. He always delivers, so no complaints here.It pains me to say, I'll probably never watch it again. Now it's time to drink away my disappointment.", "review-date": "28 June 2023", "review-score": "6"}, {"text": "The fifth & final instalment in the Indiana Jones franchise and also the first to not be helmed by Steven Spielberg, Indiana Jones & the Dial of Destiny brings the famous archaeologist back for one final outing yet finishes as a bland & bloated blockbuster that fails to replicate the magic & bravado of its predecessors despite having all the necessary ingredients at its disposal.Co-written & directed by James Mangold (Logan & Ford v Ferrari), the film opens with a thrilling & action-packed prologue that brings the titular artefact into play but then it follows it up with a series of events that just unfold with a straightforward monotonousness. Despite being the final chapter, it doesn't have the urgency, even the exposition is lame, and the action set pieces lack flavour.What makes the ride dull is the same rinse-n-repeat approach that surface throughout the film in addition to it not having any genuine sense of danger or adventure or escalation. Humour is often poorly timed and the picture also fails to provide John Williams any moment to allow his music to soar. Harrison Ford manages to hold his own in spite of the frailty in his performance but the rest are forgettable.Overall, Indiana Jones & the Dial of Destiny begins on a promising note but gets bogged down by issues of its own makings. Most of the problems plaguing this latest sequel can be found in The Kingdom of the Crystal Skull too but even that disparaged entry employed better use of shots, cuts & outrageous set pieces. This one fares somewhat better as a whole but it is still a lifeless, overlong & mediocre offering.", "review-date": "3 July 2023", "review-score": "7"}, {"text": "Greetings again from the darkness. \"They look like snakes.\" It's such a simple line of dialogue, yet after 42 years and four previous movies, we know exactly what that means to retiring archaeology professor, Dr. Henry Jones, best known to all as the swashbuckling Indiana Jones. As the final chapter of the beloved franchise, this entry is the first one not directed by the legendary Steven Spielberg (listed here as an Executive Producer). Instead, James Mangold takes the reins, and also shares writing credit with his frequent collaborators Jez Butterworth and John Henry Butterworth, as well as \"Indiana Jones\" veteran David Koepp. Of course, George Lucas and Philip Kaufman receive credit for their original characters.Harrison Ford once again dons the familiar whip and hat, and at 80 years of age, still possesses the screen persona and magnetism that first won us over in \"Raiders of the Lost Ark\". The extended and frenetic opening sequence finds a young Indy (Ford is digitally de-aged for the sequence) at the tail end of WWII fighting Nazis over what else, a prized ancient artifact. I'll leave the specifics to those who watch the film, but just know that it's an interesting historical choice, and also one that matters little in relation to the enjoyment of the film.Working alongside Indy in the opening sequence is his pal and fellow archaeologist, Basil Shaw (talented character actor Toby Jones, who seems to be in most movies these days). However, the fun part for me is seeing Thomas Kretschmann and Mads Mikkelsen share scenes as Nazi Colonel Weber and Dr. Voller, respectively. These are two of my favorite actors and I do wish they had a couple more exchanges ... although Mikkelsen's character gets significant screen time and plays a crucial role in how the story unfolds and concludes (he is also digitally de-aged for the opening sequence).The story picks up with modern day Dr Voller and his band of misfits tracking down the relic and disturbing Dr. Jones' retirement party. It's at this point where Indy's Goddaughter Helena (Phoebe Waller-Bridge) pops up creating a three-way battle for the priceless relic. This sets off a chain of events that leads them on a global trek to desert, sea, and hallowed cities of antiquity. Helena's partner in crime is young Teddy (Ethann Isidore, sporting a Bob Griese Dolphins jersey), who is clearly the scrappiest of the bunch. Dr Voller's troupe includes Shaunetta Renee Wilson as the misguided Mason, Brad Holbrook as sleazy Klaber, and Olivier Richters as one of the largest bodyguards you've ever seen.Fans of the franchise know that the story is secondary to the characters and action, and there is no shortage of action on speeding trains, galloping horses, motorcycles, tuk tuks, vintage airplanes, and scuba dives. Antonio Banderas shows up as a boat-owning old friend of Indy, but it's the appearance of series favorites John Rhys-Davies as Sallah, and Karen Allen as Marion, that generated cheers from the audience. Ms. Waller-Bridge holds her own with screen legend Ford, and it will be interesting to see the career path she chooses after her success on TV and now film. At times this feels like a live action cartoon, and that's not meant as criticism. It's pure fun, fantasy, and adventure cloaked in nostalgia; and the film is a fitting conclusion to a world class franchise.Opens in theaters June 30, 2023.", "review-date": "29 June 2023", "review-score": "6"}, {"text": "I love Raiders of the Lost Ark from 1981, I like the second movie Temple of Doom from 1984, but I like the first movie more, I love the movie The Last Crusade from 1989 as much as the first movie, but I like it more than the second movie, and I thought the fourth movie Kingdom of the Crystal Skull from 2008 was mediocre, with the first three movies being better. The fifth and last movie Indiana Jones and the Dial of Destiny (2023) was good and a good ending to the character, with it being better than the fourth movie, and little better than the second movie, but I still think the first and third movie is better.Despite his age, Harrison Ford is still great as Indiana Jones many years later; he is retiring from his job, and he is watching how the world changes around him since his younger years. Going on this last adventure to find something a friend of his was looking for, and to stop the villain from getting his hands on it, while also dealing with his goddaughter who wants it for her own reasons. I like how Indy is getting tired of doing what he is doing but also still has some love for adventure, he was also good in action scenes in the certain places they go to.Indy's goddaughter Helena played by Phoebe Waller-Bridge was not bad, I would have liked more done with her character by showing how she became the way she is, or how she could have learned certain things that are useful on the adventure, along with her sidekick named Teddy who was like Short Round from Temple of Doom. I liked the main villain Dr. Voller played by Mads Mikkelsen; his plan involving the Dial was interesting with his plans with the Nazis, and that he has a backstory involving an interaction with Indiana Jones; he was not much of an archaeologist, he knew and used math more to use in his plan that involves time.The opening involves a de-aged Harrison Ford that does look good, but sometimes the voice can sound older than he looked but also it would fit. The opening was great, it looked like the original movies and felt like them with a great action sequence that also sets up the main villain; all the action scenes are fun, nicely shot, suspenseful, and fast paced. Director James Mangold did a wonderful job giving this movie the same look and feel as the original movies directed by Steven Spielberg. The locations or caves they go through look cool, and interesting on how they tie to major points in history.The third act will divide some people, but because of other weird things that happen in the earlier movies, it was not that hard to believe; leading to an ending that is sweet and a nice end for the character. Indiana Jones and the Dial of Destiny (2023) was a nice ending that had callbacks to the earlier movies, great action, a fantastic musical score from John Williams, and Harrison Ford giving his all in his last movie as this famous character. This movie is not flawless, but I had fun with it, and I think fans will too.", "review-date": "7 July 2023", "review-score": "8"}, {"text": "I understand some of the criticisms I've heard surrounding this final Jones outing; it's burdened by a handful of excessively bizarre ideas and an overabundance of characters.But one criticism I'll never understand is that this is somehow disrespectful toward the Indiana Jones character-that it belittles him or mocks him in some way. I could not agree less with this.What I saw today was a film made by a director who understands, respects, and loves this character. He crafted a hearty adventure story that adds depth to Jones and sends him off fondly.Indiana and Helena are characters that are both shown to be capable, intelligent, and protective and they both save each other quite often. They are introduced as closed-off but they wear each others' emotional layers down over the course of the story in subtle, natural ways that really did affect me and make me feel something.The film is shot and directed immaculately-the action is brisk yet hard and thrilling. Sure, the story's ambition requires a LOT of CGI, and it's more noticeable than it should be at times.But that didn't stop me from loving the film because the script is smart, constantly shifting power dynamics and developing character to keep you invested in the world.This is leagues better than Kingdom of the Crystal Skull, and I really hope people avoid the hate train that's been building online and give this last adventure a chance in theaters.", "review-date": "30 June 2023", "review-score": "6"}, {"text": "The plot was surprisingly good, as I was expecting some MCU multiverse hijinks but was instead given a more grounded approach to time travel. It felt like a breath of fresh air in that sense.Madds was a good villain. He had a cool backstory and plan in this film and was well-acted.The action was good. Not much with Indiana's whip, which is a bit disappointing. Then again, Ford is in his 80's so I understand. I enjoyed the action scenes despite their limitations.However... Phoebe Waller-Bridge made me wanna walk out of the theatre (not really, because I payed for normal tickets and was seated in a Screen X theatre by mistake). Her lines were awful. She ate food with her mouth open and came across very cocky for no good reason. She didn't seem to deserve to be the character she was. I hated her in this movie.", "review-date": "3 July 2023", "review-score": "4"}]}, "Monarch: Legacy of Monsters": {"Directors": "Chris Black, Matt Fraction", "Year of Release": "2023– ", "Content Rating": "TV-14", "Runtime": "TV-14", "IMDB Rating": "7.0", "Reviews": [{"text": "Update: episode 8. Where is the thrill, the action, the monster fights.... overstretching 4 episodes to 8 , the writing and execution is simply uninspired and need a vitamin boost and testosterones therapy.,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,\nTruly excited as i was raise on the original Godzilla movies, This series is all over the place editing multiple timelines jumps from 50s to now. I find since a couple of years that to be used too often, leading to over complicate the story in a bad way and removing a linear sense of exposition to a story. It can be ok if use efficiently, here it isnt.The cast in modern time is annoying, poor script.The biggest problem is the lack of monsters scenes . I feel it was because of budget restrains as it would require more wider scenes with many effects and consequence in the world , as with sets and number of actors.The overall idea seems good but the execution is not. Very disappointing.Just finished episode 4 and will update when series is done.", "review-date": "1 December 2023", "review-score": "5"}, {"text": "4 episodes and its a dull slog. Unlikable characters. Why do I care about any of these people, they either whine, snark, or sneer. The women are horrid and the men (man?) is weak. Maybe there's a character arcs that are coming... but not holding my breath.Episodes 3 and 4 could've been 15 minutes long and then add some real meat and storytelling.I don't care if they find what they're looking for or they even show monsters. It's too boring. I may make pipe cleaner statues to fill any long boring nights rather than watch this stuff any more.And they wasted Kurt Russell, how can you do that?Addendum:\nJust finished episode 8, is that it? Cliff hanger that leads into maybe 2nd season?Lowering my rating from 5 to 3. NOTHING HAPPENED! The series may have been helped by 1 story line. I guess the kids finding dad, but that was a story line just to get the ball rolling.", "review-date": "9 December 2023", "review-score": "3"}, {"text": "The characters are just so damn unlikable and annoying. The plot and script is very cringe.The CGI monsters are badly comped, messy and uninspired.But the worst part is that you just don't care about wth is going on because the characters are just so damn annoying and stupid.Of course the usual rating brigade of bought shills already boosted this series so I'm afraid a lot of time has been lost on this countless piece of rubbish trying to capitalize on intellectual property of the pastI don't know what is going on with Hollywood and entertainment industry but they keep on pushing this reboot rubbish...Not recommend.", "review-date": "6 December 2023", "review-score": "3"}, {"text": "Being a huge fan of the movies involves Godzilla or Kong I was really looking forward to Monarch: Legacy of Monsters. I finally got around to watching it recently and just finished it and my main takeaway is disappointment. It is no where near as good as I had hoped and while it's not the worst thing I've ever seen it's still pretty bad and I'll have to almost force myself to finish it. I kept telling myself that it would get better but it never did. Like many have already said, the monsters are barely a part of the series. It's almost like a bait and switch. The trailers show all this action with Godzilla and then he's barely seen. I'll finish watching the season bc I've already invested in it but I'm not expecting much better.", "review-date": "23 December 2023", "review-score": "5"}, {"text": "Why can't Hollywood leave the old family drama formula behind and simply move ahead with the story at hand.The show is about giant titans then stick with the titans. I couldn't care less about the daddy issues these kids have. Nor do I want to see long conversations about their feelings.Episode 4 just avoid it because it is a filler episode just to waste time.Get to the story of these monsters. Explore their habitats. Its similar to watching Prometheus. It got everyone excited as to what the sequel will show us regarding the Creators of Alien species but when the sequel released it was nothing but pure human melancholy none sense and unnecessary long dialogues without any explanation to the ancient beings.Monarch started off with a bang in the first episode and then episode 2,3,4 have been EXTREMELY without a soul.Stay away from this waste of time series.", "review-date": "4 December 2023", "review-score": "2"}, {"text": "This show so far has been an unbalanced mess. It doesn't know what it wants to be and it is all over the place. The wokee-woke undertones, which seem to come to the forefront more and more often, surely don't help matters. The show is trying to be epic, but oftentimes it falters in that. The two separate timelines while interesting as a storytelling concept, fail in the execution and end up being a drag.With the exception of Wyatt and Kurt Russell, the rest of the cast ranges from mediocre to awful. Especially Kiersey Clemons as May (whose character is entirely superfluous and completely useless in the series), Anna Sawai as Cate Randa and Ren Watabe as Kentaro Randa, are just awful (the actors and the characters), boring, annoying and just complete turn-offs. The special effects as well are soo uneven, they range from good to just really amateurish and unpolished looking.Somewhere underneath this mess lurks a show that might have been decent and interesting or (gasp) even good, but it is buried under soo much garbage that it ends up being dragged down to the lowest level. I don't think that there's too much hope for this series to redeem itself. Lets remember that this is Apple TV Plus after all! Personally, I don't care enough to stick around and find out...", "review-date": "4 December 2023", "review-score": "1"}, {"text": "This show is full of unlikeable characters that disengage their brain. The only likeable character was Du Ho.Otherwise it's girl bosses and girls getting it done in true Mary Sue fashion while a bunch of guys are there for muscle when needed. This applies to both the good team and the bad team.Is it possible to write female characters these days without making them girl bosses?Probably not.Cate is completely unlikeable and acts like this whole adventure was something unfairly inflicted on her. May the same.The two guys trying their best to rescue the show... And the dynamic female duo... Are doing their best but they can't rescue either.Jumping off this at episode 4. It won't get better. The ingredients are not here. There is nobody to root for. Except maybe Godzilla... If he ever makes more than a split second appearance.", "review-date": "3 December 2023", "review-score": "4"}, {"text": "The monsters and special effects look good. But the main story is about a girl who learns her father had two wives and two children in two separate countries.The secondary story is about the (evil) Monarch company or agency. That is supposedly full of corruption and/or incompetence.This seems to be a repeated formula for many recent \"scifi\" movies and TV shows. Have a drama about characters, with the monsters, or aliens as a backdrop to the drama about the characters. The formula is --- people drama, drama, drama. Then throw in a little monster or alien action. Then back to the people drama, drama, drama. Apple TV's \"Invasion\" is the same. (And if I'm not mistaken, one of the Godzilla movies was like this. You know the one where we barely ever saw Godzilla.)Anyway, the girl finds out she has a brother in Japan. This brother's ex-girlfriend is portrayed as a depressed, cynical, pessimistic, immature, irresponsible, whiny baby. She's awful to the brother when they first meet. She's awful to the brother when he ask for help. She's even awful to the airport check in lady, as if it's her fault she's even in Alaska.She voluntarily follows the brother and sister through numerous dangerous quests. Including flying a stolen plane with two men they don't know, one they had to break out of a detention facility, to a frozen tundra where they get attacked by a giant monster. She keeps blaming the ex boyfriend for ruining her life, when nobody forced her to do anything. She could have checked out at any step.Anyway, after being told the part of San Francisco that has been destroyed by a monster attack is off limits and guarded by the military, the three \"kids\" decide to sneak in with help from the star's mother (who told them not to go) and her boyfriend. While sneaking around in the dark, and narrowly escaping military patrols, the two siblings decide its a good idea to sing, dance and laugh loudly. They almost get caught again. As usual in these types of monster movies and TV shows, the military is portrayed as stupid and incompetent.Most of the first 5 episodes are spent dealing with melodrama over the star's family problems, people representing or dealing with Monarch, and all the main characters fighting with each other. Every now and then you get a monster.First of all, this is not scifi. Which is what it is advertised as. Secondly, it's really a drama. And as a drama, it's not really that good.4 out of 10 for me.", "review-date": "15 December 2023", "review-score": "4"}, {"text": "\"Monarch: Legacy of Monsters\" attempts to weave an intricate tale of mythical creatures but falls short of its potential. The series suffers from a lackluster storyline, unrelatable characters, and a scarcity of the promised monsters, leaving viewers craving more. The script struggles to find depth, resulting in a confusing and shallow narrative. Unfortunately, the acting fails to elevate the material, making it challenging to invest in the story. Ultimately, with its telenovela-like feel and numerous shortcomings, the show currently falls short of delivering an engaging experience, warranting a 4/10 rating.", "review-date": "1 December 2023", "review-score": "4"}, {"text": "I was beyond excited when I first heard about this series and when the teasers dropped I just couldn't wait. The start of the show was decent, it had interesting angles and introduction to the new monsters then all of the sudden the story just nose dived right into boredom. Characters just roaming around, they're not discovering any new monsters or fighting them or trying to survive. All 3 main characters stories and backgrounds are total fail. The actors are not too good, the storyline is beyond weak and makes you lose interest rather quickly\n. I hope they can improve drastically as the time goes by but I'm sure this is not worth buying Apple TV subscription.", "review-date": "15 December 2023", "review-score": "2"}]}, "Berlín": {"Directors": "Esther Martínez Lobato, Álex Pina", "Year of Release": "2023– ", "Content Rating": "TV-MA", "Runtime": "1h", "IMDB Rating": "7.2", "Reviews": [{"text": "The title of this should have been \"the love life of thieves!\" - very disappointing, messed up and very far away in format from the original as the priority here was to find the right love match for each of the participants! Unnecessarily melodramatic to the point I had to fast forward most bits to get back to the story.Also parts were too far fetched and lacking detail, like for instance they were all super meticulous about not leaving forensic signs anywhere, and yet they lost a necklace and a bike?! Come on! This was a parody - not a serious heist story, all any of them cared about was their feelings. And how is it possible that people who live a life of pure excess, indulgence and zero exercise can cycle on the mountains for days?!What about the women investigators who look older here even though this period precedes money heist - did they run out of actors??Fun to watch, funny at times, and even moderately suspenseful, offering a bit of the feeling of the original, but overall not nearly close to the brilliance of the money heist script.", "review-date": "30 December 2023", "review-score": "6"}, {"text": "The Casa de Papel was an excellent idea; the plot and characters were cool, but the made the same usual mistake of many series / movies : unnecessary love stories. Like literally all the characters were involved in relationships or affairs ALL the characters. What's the need? Too easy and cheap.Now, with Berlin, is just the same.... but now the characters are too obvious, clichéd, predictable, I feel like I amWatching kind of the same characters from La casa the papel with a little twist and again: unnecessary love stories with the same old problems: we're so different, age difference, one in a relationship/unavailable , we together so we shouldn't hook up . Basically, all the same.Stop forcing love stories into everything!! It ruins everything and work better on the charters. They are so obvious\nNot everything needs romance and sex to be good.", "review-date": "30 December 2023", "review-score": "4"}, {"text": "It seems like the budget for promotion is bigger than actual investment to the movie.Don't get me wrong it shot alright but script is full of holes & really poor, and generally I have a feeling what we are purchasing some store of luxury product but instead receiving AliExpress product.Advertisement of this project everywhere, I live in Madrid and it's not possible to walk 10 meters without seeing banners, screens or posters of the show. Moreover, such a high rating here is also promoted by bots which you can easily track by helpful rate of every review.In fact, I would rate it as 5 out of 10 but giving it 1 to balance with bots. I stand for fair ratings and reviews.", "review-date": "29 December 2023", "review-score": "1"}, {"text": "Money Heist was a favourite of mine with all the smart twists and turns keeping me invested in watching. The Professor was so disciplined and so focused on the goal. In this series, the heist is an inconvenient subplot. Everyone is making mistakes you'd expect of a teenager who just started going through puberty. How could you trust flaky minded people like this to pull off a multi million dollar heist?Four episodes in and I was constantly rolling my eyes at all the love scenes and drama. Everyone was calling in love with each other. Some other characters i wonder what their point was other than being a distraction.I really wanted to like this but it's just not as well written as Money Heist.", "review-date": "31 December 2023", "review-score": "1"}, {"text": "Total let down!There is not even a remote resemblance here with anything we saw in MH. Characters are like they are discovering their personalities in a way that's so unreal. They are frankly too loud on trying to impress, and that where it fails.And Berlin, who was so lethal in MH is like a 23rs century Romeo, who is 90% trying to chase a married girl and sometimes comes back to the Heist.And the Heist itself is a cliche plot used by 100s of movies and series before. There is no suspense at all\nActing is quite ordinary.Watched 2 episodes, just to give it a fair chance...but barely managed to finish the 2md one.", "review-date": "29 December 2023", "review-score": "3"}, {"text": "The narrative flaws in this series are glaring, a far cry from the intricate plot of Money Heist. The characters' emotional breakdowns and nonsensical decisions undermine any semblance of a coherent storyline. Despite emphasizing the importance of the mission, they engage in absurd actions like putting on a stolen necklace during a joy ride, only to lose it later. The inconsistency in prioritizing the mission is baffling.The Berlin character adds another layer of absurdity. Instead of focusing on the heist, he becomes entangled in a love affair, a distraction that could have been postponed until after the mission. The lack of logic in his actions raises questions about the overall writing quality. The supposed seriousness of the mission is overshadowed by characters pursuing personal interests in the midst of the heist.In essence, the show is marred by a lack of coherence and logic, making it a prime example of how Part II fails to live up to the standards set by its predecessor.", "review-date": "29 December 2023", "review-score": "3"}, {"text": "If you saw Money Heist already, please don't watch this episode, Because most of the characters are recurring, and almost all events are repeated.There is an extremely stupid event in which a woman is bitten by a snake, but her energy is stronger than that of an athlete. Everyone knows that when a person is bitten by a poisonous snake in the jungle, needs weeks to recover, but here we see a person recovering within hours.I don't know what is the reason for making such this series?, Wasn't the series Money Heist enough?, What's worse is that the series has other seasons, please Netflix don't do any garbage again.", "review-date": "30 December 2023", "review-score": "1"}, {"text": "\"Berlin\" on Netflix disappoints with a lackluster plot, underdeveloped characters, and subpar execution. The potential hinted at in the premise is never fully realized. Save your time for more engaging shows with better storytelling and character depth. A regrettable watch that falls short of expectations. \"Berlin,\" the Netflix series, left me thoroughly disappointed and questioning its acclaim. The promising premise failed to materialize into a compelling narrative, and the characters, unfortunately, remained mere caricatures with little depth. The plot suffered from lackluster development, leaving key elements unexplored and contributing to a pervasive sense of unfulfillment.Character arcs felt rushed and lacked the necessary emotional resonance to make their journeys impactful. Motivations were unclear, making it difficult to empathize with or root for the characters. The series seemed to rely on stereotypes rather than providing nuanced and authentic portrayals, further diminishing its potential.Moreover, the production quality failed to meet expectations. Cinematography, dialogue, and overall execution lacked the finesse that distinguishes a memorable series. The pacing was uneven, with moments of stagnation followed by abrupt developments that felt forced and unnatural.While individual preferences may vary, \"Berlin\" fell short of the standard set by other Netflix offerings. Viewers seeking a captivating and immersive experience may find themselves sorely disappointed. In a landscape rich with quality content, \"Berlin\" struggles to stand out, ultimately proving to be a forgettable and regrettable addition to the streaming platform's library.In conclusion, \"Berlin\" fails to deliver on its potential, resulting in a lackluster viewing experience. It's disheartening when a series with an intriguing premise fails to meet expectations, and in this case, the disappointment is palpable. Save your time for more rewarding and well-crafted shows available on Netflix.", "review-date": "30 December 2023", "review-score": "3"}, {"text": "Cliché - Simping - OverreactingOverall, the series started off promising, but I'm genuinely disappointed with where Alex is taking it - drowning in clichés and overreactions. Those mundane scenes should fade into the background, but no, Pena's signature has to be forcefully stamped on everything. Simping, simping, and more simping - it's become a parade of tired tropes. Money Heist set a bar, and this feels like a heart-wrenching downgrade. If this trend persists, it's on the fast track to becoming a Bollywood melodrama. As someone genuinely disappointed, I hoped for more than this. Kudos, Alex, for turning what could have been a riveting tale into a predictable saga.", "review-date": "30 December 2023", "review-score": "4"}, {"text": "I had high hopes for this series because I actually liked Berlin in Money Heist. However this series seems to me like a South American Telenovela ? Everything is about love and affairs and nobody cares about the job. They just run around doing whatever they want.Moderate acting. But really underwhelming writing.Like what's wrong with these dudes to sing in Spanish at a French wedding in the Hotel 5 days after the heist ??Who does a car race with people strapped on top of the roof ? And who stops the car because of a missed call at 130 kilometers per hour.There are endless more cringy situations.", "review-date": "2 January 2024", "review-score": "5"}]}, "The Creator": {"Directors": "Gareth Edwards", "Year of Release": "2023", "Content Rating": "PG-13", "Runtime": "2h 13m", "IMDB Rating": "6.8", "Reviews": [{"text": "Oh, I really wanted to like this movie. Edwards did a great job with Rogue One. He missed the mark with this one. First the positives.Movie looks amazing. The world feels lived in and something that I felt was a real place. Edwards is great at world building. Actors were all pretty great.. at least with the material they were given. Sound was awesome, and it was just well made on a technical level.What didn't work for me was the story and the script. Edwards doesn't seem to have the writing skills that measure up to his strong director abilities. The story started out strong and had great potential in the first act. It was making the audience pay attention and see how it was all fitting together. The questions about AI seemed to be timely and thought provoking. Then it started to fall apart for me.It just was so flat and predictable. Didn't go to the depths that it teased that it might explore. The biggest thing for me, the massive plot holes. So annoying! For a film that seems to be trying to make a world that we could believe was real.. then the writers need to make things make sense and the characters should do things that are believable for their situations. Few examples.Joshua was trying to get Alphie back after the simulants got him. He sneaks into their area by tip toeing, and flicks a switch on the leaders neck to turn off the robot. They have their power switch right there on their necks!? None of them could detect him as he was sneaking around? After he gets Alphie back, the simulants can't find Alphie. There is no tracking capabilities on him? We can track our cell phones in this day and age, and 50 years in the future, they wouldn't be able to track their most important \"weapon/creation\"? And why did they not protect their important creation. Also the Army comes in with these huge tanks (which were cool) and one explosive device completely disables it. Come on. And the flying base.. don't get me started. Joshua gets on board and destroys it so easily. The most important Army asset and it's practically defenseless. Had me rolling my eyes so many times. Making things make sense is important, especially for a film that tries to be realistic or believable. The army sends these running bombs to hurt the simulants. A missile would do the job and be so much more efficient.I also had an issue with the plot point that the AI just wanted peace and for everyone to love each other. I feel like that is a sort of weak premise. Why would the AI have that perspective? If they were based on the humans or what you would find on the internet, why would they think just loving each other would be possible. The AI wanted to survive, hense the fighting, and that idea just doesn't seem logical. At least it didn't feel believable in the world of this movie. I could not buy that idea from what was presented in the first 2 acts of the movie. I loved the questions that were brought up in the movie, but I just feel like they were not developed in a smart of thought provoking way.The movie could have been so much more. I wish it delivered for me... But I just left feeling disappointed and like the movie was an empty shell. Hopefully Edwards gets better material in the future and can bring his directing talents to material that is stronger and written in a more complete and thoughtful way.", "review-date": "30 September 2023", "review-score": "5"}, {"text": "This is a lesson to the movie industry on how to use a budget. 80 million dollars was used splendidly. The cinematography was amazing, (Not terribly surprising because Rogue One) acting was great, and the story was decent.It wasn't without problems though. The story moves at an increasing pace and at some points you lose track of what's happening. Suspension of disbelief will be needed in some moments.The theme of the story was to make AI to be more than just robots. I think they succeeded there, but at the expense of the humans. Most of the humans in the story ended up being one faced - except for Joshua.The dynamic between Joshua and Alfie was by far the best part of the movie. The acting was great between the two.It was a good movie. Not great by any means, but I'm all for supporting a movie that is trying something new.Overall, I think Gareth Edwards should be given some more projects. AND filmmakers everywhere should learn how a budget should be used.", "review-date": "29 September 2023", "review-score": "7"}, {"text": "The Terminator films warned us of the dangers of A. I., while the Spielberg/Kubrick movie A. I. painted a different picture in which robots served mankind. Gareth Edwards' The Creator gives us another take on the subject, bringing us a future where America has waged war on intelligent machines to cover up for an accidental nuclear explosion on home soil.Edwards' film tries to blend sci-fi and action with the ethical issues surrounding artificial intelligence, but in doing so it becomes something of a mess, one that clumsily combines big-budget CGI extravaganza with hamfisted morality, with intended emotionally charged scenes hampered by some truly lousy dialogue (poor Madeleine Yuna Voyles, as Alphie, is given all the worst lines -- Kami: What do you want, sweetie? Alphie: For robots to be free. Gack!).The film also doesn't make a whole lot of sense at times: I realise that the simulants are supposed to be very human-like, but did they really need to eat and drink? And cry? And why were some simulants young, and others old (one simulant is a decrepit Tibetan monk! Why would he be made like that?). And if Maya created Alphie before she got blasted into a coma, why would she have used her unborn child as the template? (to further the film's plot, of course!).It's a shame that the script isn't less problematic, because the film is amazing to look at, a triumph of special effects and incredible production design: it's the stunning visuals that helped me make it to the end.4.5/10, generously rounded up to 5 for IMDb.", "review-date": "27 September 2023", "review-score": "5"}, {"text": "I watched this from start to finish without being drawn into the story at any point.I think John Washington is miscast here, I had the same exact experience when i watched Tenet... found myself very disconnected as I he didn't seem to make a proper connection with the role he was portraying.That is not to say the film isn't without issues. They have been fairly well documented by other reviewers so I'll not labour the points here.My main issue is with the lack of emotional involvment with the characters. The film measures zero on the emtional richter scale, but more, the screenplay just doesn't manage to get you excited or involved with anything that is unfolding. Additionally, the characters seem to have little connection to each other. In fact it is only at the end of the movie that Joshua and Alphie seem to have any tangible emotional cohesion.Contrast this with The Golden Child 1986 where Eddie Murphy plays Chandler Jarrell and the connection he makes to The Golden Child played by J. L. Reate. Here you can see what a great connection is established on screen and the massive difference in outcome it produces. Both films have two similar sets of pairings in almost identical scenarios with a stark contrast in outcome.Anyway, for me the film was a big dissapointment, I can't say John David Washington was the cause of this since the Movie has many other problematic aspects, but the ones I've mentioned were particularly significant for me.5/10 sadly.", "review-date": "17 November 2023", "review-score": "5"}, {"text": "Many Spoilers Ahead.It seems obvious for some movies that the script writers aren't even trying to find a new approach to some of the same old tropes of your typical adventure yarn. I found that the case in the slick and enjoyable action flick \"The Gray Man\". \"Creator\" has a lot in common with a lot of mostly cliché movies. Creator and Gray Man both toss a child into the mix. You can consider her either the Chosen One or the Child Prodigy tropes. Like the baby Yoda in \"The Manchurian\". Or the chosen kid in \"The Last Airbender\". There's dozens more examples, like that annoying baby in \"Willow\". The kid is towed along through all of the adventures, and reluctantly uses his magical powers to save our protagonist from certain peril. In \"Creator\", the child prodigy's special powers are sending an electro magnetic pulse (or EMP) wave around him, rendering electronic devices powerless.The dystopian world this time is reminiscent of \"Chappie\" with a robot police force. It could also resemble \"Elysium\", where a more dominant group orbits above in a massive spaceship, sending terror to the villagers down below. The twist they try in Creator is that the villagers are androids. Well, they all look and act like regular humans, they just have a big opening in the back of their heads. Even that type of android seems cliché. The asian setting is meant to evoke images of Viet Nam when, \"Apocalypse Now\"-style, U. S. Forces used advanced military equipment on mostly primitive villagers.What is also uninspiring is the Bourne-ish \"assassin turned compassionate\" trope. In fact our protagonist, named Joshua, even loses his memory after his own Bourne style mission. Another strike against is introducing the subplot while the opening act is unfolding. We are forced to try and juggle a bunch of important plot points while dodging bullets. Another hit and a miss is Joshua's wife, Maya. Within moments, they first are cuddling (with zero chemistry), then suddenly facing each other off when a conflict arises. She disappears for most of the rest of the movie. The script attaches many complicated aspects to her character, which made me go \"Huh?\" \"What?\". Ultimately the revelations about certain main characters that occur throughout the movie made me lose track of who were supposed to be the good guys and the bad guys.Part of the problem is the filmmakers jumping on the \"A. I.\" bandwagon. Like Mission: Impossible: 7, the words \"Artificial Intelligence\" and \"A. I.\" are sprinkled about in the dialogue, perhaps to cash in on the latest controversy involving A. I. and the threat of it taking over society (such as the Terminator franchise). Here A. I. is the perceived enemy, and has created human-like androids that I am supposed to feel compassion for, because machines are people too (like Data in the Star Trek series).This forced compassion on the main characters wasn't successful for me. In the third act, there at least a couple scenes that are shot and scored to be tearjerker moments, but fall flat. And yes, here we are with a bloated two hour and 13 minute run time, testing the patience of the audience. The story is set up in acts with title pages for each one. The slick look of this obviously expensive production looks great on the big screen, and I guess that was all I was really expecting when I went to watch it in the theatre on a rainy day.Director Gareth Edwards earned my interest by doing an excellent job making \"Rogue One: A Star Wars story\". It certainly doesn't diminish my attitude about him as a filmmaker, but I hope he learns from this experience how to better win the audience's compassion for characters. 5 out of 10.", "review-date": "29 September 2023", "review-score": "5"}, {"text": "Sigh. As a self-proclaimed sci-fi junkie, I was looking forward to this new original stand-alone sci-fi movie. And I left fully disappointed. It's exactly like so many movies I've seen before. I basically knew how the entire movie would play out in the first five minutes.Even so, I've enjoyed plenty of movies that seem derivative. If it's done right, it can be good or even great without any originality. But everything about this movie feels off. I can see what it's trying to do. It's just not working. Character arcs and changes in perspective feel completely unearned. Emotional moments evoke no emotions.Even with all that, could I at least enjoy some cool sci-fi action? Not really. It feels mostly tame and surface-level. Part of it is the annoying limitations with PG-13 movies, avoiding all violence even with death all over the place. But it's more that the action isn't creative or... intimate? Shooting scenes are just a bunch of bullets flying everywhere (with terrible aim). And throw in explosions every now and then.People who don't watch many movies will probably enjoy it more than me. But I can't recommend this movie. It could not get me engaged or invested, which is not a difficult task for someone who loves movie as much as I do.(1 viewing, early access screening UltraScreen 9/27/2023)", "review-date": "28 September 2023", "review-score": "4"}, {"text": "With stunning visuals reminiscent of Blade Runner and the more recent Rouge One this movie is stunning to look at. Unfortunately the script falls far short of living up to its inspired cinematography. It's full of plot holes and cringe worthy moments from it's extremely one dimensional villains. The plot twist are telegraphed from miles away and there are no real surprises to be had. Everything plays out exactly like you would expect it to. Which is a shame. The look and mood of this film is almost enough to save it. But in the end it falls flat and its potential is wasted. See it for the visuals. Forget it for its script.", "review-date": "11 October 2023", "review-score": "4"}, {"text": "My wife and I caught The Creator (2023) in theaters last night. The storyline unfolds in a futuristic society where humans and AI robots find themselves in conflict, triggered by an AI robot-initiated a nuclear attack on Los Angeles that claimed a million human lives. A man, once assigned to bring down the leader of the AI robots, experiences a devastating loss of his wife and child during an undercover mission. The government offers him a chance to complete one last mission with the promise of reuniting with his wife, and he eagerly accepts the opportunity to right past wrongs.Directed by Gareth Edwards (Rogue One: A Star Wars Story), the film stars John David Washington (Tenet), Madeleine Yuna Voyles, Gemma Chan (Eternals), Ken Watanabe (The Last Samurai), Allison Janney (The Help) and Marc Menchaca (Ozark).While the storyline bore strong resemblances to Blade Runner, unfortunately, the plot of The Creator proved to be highly predictable, with only one noteworthy twist, and I didn't find myself as invested in the characters as I had hoped. On the positive side, the acting, special effects, cinematography and settings were magnificent, but throughout the entire film, there was a sense that something crucial was missing. Additionally, the film's extended runtime led to certain sections that dragged. However, it's worth noting that the ending was satisfying, and every action scene and shootout was executed exceptionally well, making this worth your time.In conclusion, The Creator is a modernized take on the Blade Runner formula that falls short of greatness due to a missing element. I would give this a 6/10 rating and recommend seeing it once.", "review-date": "30 September 2023", "review-score": "6"}, {"text": "Oh dear. I was really looking forward to this, and managed to get a ticket for a pre-release showing. I left disappointed.One fact that too many film-makers have failed to grasp is that CGI alone does not make a film. Effects can make a good film better, but they can't make a mediocre film good. Marvel, I'm looking at you.It's not enough to string a few action scenes together and finish with some really big explosions. You have to have a story - preferably one that hangs together coherently. This is what's missing from this film, whose plot-holes are more pronounced than the holes where the AI characters' ears would be. Just one example - our hero is on the run in an unspecified Asian county, where it's established that he doesn't speak the language. He breaks down. A van stops, and he's asked if he needs help. Asked in perfect English. That's bad enough - but then for no explored reason, our good Samaritan progresses from giving a stranger a lift to helping him through a police road-block, risking the lives of his five children in the process.Why are there gardens on Nomad? Why, if it's the last word in military technology, is it as easy to blow up as the Death Star or a Bond Villain's lair?The child-McGuffin is portrayed by an excellent young performer, but makes no logical sense. The nuclear blast in Los Angeles (seen in the trailer, so it's not a spoiler) is cited as the reason for the war against AI. There's one throwaway line about this late in the film - but it's just that: a throw-away line. Following it up would've led to a much more interesting film.I've heard it suggested that this should be seen as a metaphor for America's involvement in Vietnam, If so, it's a tired re-hash and forty years too late. Also, that would mean regarding it as an intelligent film, which it absolutely isn'tJust one more big-budget wasted opportunity.", "review-date": "28 September 2023", "review-score": "6"}, {"text": "AI is such a rich topic, it can be explored from any kind of angles but this movie decided to use it only as a prop. The AI people are just stand-ins for oppressed people X. None of the AI people are really intelligent, they behave as regular humans and even have to sleep (?!), which is one of many advantages machines would have over humans. The movie decides to tell a generic story that we have seen many times before, and in a better way.If one ignores the paper thin story and has to describe this movie in one word, it would be messy. Awkward change of tones, a weird plot structure with constant flashbacks, unclear action, an unlikeable protagonist that gets everyone killed and even the acting is all over the place.Similar like Neil Blomkamp, the director is more interested in world-building than in gripping storytelling. All the story beats are there, all of them predictable. Every interesting sci-fi idea is discarded in favor of a trope. You got robots who are all portrayed as inherently good (and who never malfunction) and the humans who are either evil military or grateful victims who adore their robot saviors. There are no grey areas, no ambivalent characters or ideas at play. This predictive setup reminded me a lot of the AVATAR movies. Not only do you have a protagonist who infiltrates 'the resistance' and switches sides, you got the army villain who is almost identical in behaviour and personality.The connective tissue is supposed to be the relationship between the two protagonists. If you expect them bonding slowly over the course of the 135min runtime, you should lower your expectations. Instead we get a montage in the beginning of their journey and that's pretty much all the development you'll see in that department. It's almost like the writing was a necessary evil to get from one action set piece to another.Talking about action, it is the most lifeless I have seen in a blockbuster (since the Transformers films). If the bad guys or our good guys get into a car, they get the biggest plot armour. Cars can get shot at by hundred guns or overturn a million times, they will get out of it unharmed and unphazed, even if they didn't use a seat belt. At one point it is super easy to destroy a giant tank with a small sticky charge, but once successfully applied, no one else will be using this tactic again. The Asian country where the story takes place doesn't have military or a defense budget, because they only have useless police cars/robots at their disposal whose sole purpose is to get blown up. And can we talk about explosions and how the director doesn't know how they work. Almost everyone who gets blown up by an explosion will look pretty with some bruises on their cheek, especially the women. There's also a thing called shockwave or blast radius which are the very things that will end your life. Our protagonist gets to witness three of them in point blank range. You have a person with a superpower to switch off all electronic devices, even a whole neighborhood and military checkpoint if the script wants to, but when it comes to a satellite those superpowers will only be used for a door. Almost every action scene ends with a coincidence, deus ex machina or that someone draws a gun faster than the other. The last action set piece in particular is redundant where they send a robot after someone who can turn off electric devices. Next time maybe send a monkey with a club to do the job. Mostly you'll see a hundred laser beams flying around without hitting anything or anyone. Again the action is so uninteresting that you never feel that our heroes are in danger, unless it's a side character, well then RIP, those have zero chance of survival. And why should they? They fulfilled their task of convenient exposition talk so let's just kill them to create artificial stakes. Those parts felt so nihilistic to me and more often than not sabotaged the message of the movie. The flashbacks are another thing that tell you nothing interesting. Unfortunately they are sprinkled throughout the film to make us artificially care about the protagonist. And that's what this movie is in a nutshell, a story written by an AI with some nice visual ideas but completely devoid of a soul. And I was rooting for the movie, it is no remake, has good cinematography and has good world building (only aesthetically though) but it just felt so derivative and un-engaging on an emotional level. It's a shame.", "review-date": "1 October 2023", "review-score": "4"}]}, "Obliterated": {"Directors": "Shelley Hennig, Nick Zano, Terrence Terrell", "Year of Release": "2023", "Content Rating": "TV-MA", "Runtime": "45m", "IMDB Rating": "6.7", "Reviews": [{"text": "Okay, maybe I have a few.Obliterated is an 80 IQ hot mess of nonsensical nonstop fun and I really hate how much I enjoyed it.There are disgusting prosthetic phalluses and oddly tight character arcs. Shoehorned diversity mixed in equal parts with political self awareness. For every genuinely depraved scene there's an equally wholesome and touching family moment. This series is everything that is wrong with bad action films, and everything that made the hangover a classic. It is so reductive that it manages to be original. This show has three plot holes for every topless woman. I've never, ever, in all my years seen something quite like this show.7 out of 10, I hate it.", "review-date": "3 December 2023", "review-score": "7"}, {"text": "Obliterated doesn't try anything it's not. It knows exactly what it is and that's an action comedy that spoofs those kind of films. My brother and I just finished it watching a t and we both said that we hoped they do another season. We grew up as kids in the 80's and 90's so we know all about the films this show was making fun of. Besides being a funny action series, it's also a pretty solid \"get the terrorist\" series. I read somewhere that it compares the counterterrorism thriller of 24. I can definitely see that. The entire cast is great here, especially Nick Zano. He's so good in this, I hope this leads to bigger things for him. He's definitely the stand out here. I liked him in Legends of Tomorrow but he is perfect for this role. He steals every scene he's in. Also, Shelley Hennig is as beautiful as ever and does a good job with Zano leading this rag tag group.", "review-date": "29 December 2023", "review-score": "8"}, {"text": "I had no idea what to expect when I started watching Obliterated, the reviews were mostly positive and I thought the trailer looked pretty good so I thought I'd give it a chance. I'm so glad I did. This show had me laughing out loud at least a few times per episode. I had fun the entire time I was watching. Even though it makes fun of movies from the Sly/Arnold era, it also pays respect to them too. This show isn't going to win any awards but if you can just turn your brain off for little while I promise you that you'll have fun watching this. I actually binged all 8 episodes in a couple days. It's funny with plenty of action and twists to hold your interest every episode.", "review-date": "28 December 2023", "review-score": "8"}, {"text": "Turn your brain off, stop being a snob and just enjoy totally silly chaos with loads of laugh out load moments and a hot and tallented main cast who totally pull it off. Think scorpion but with the competence of superstore and lots of naughtiness. It doesn't all work but enough does to make it work. Did every minute of Naked Gun get it right? Or Airplane? People are far too critical and just need to relax and have fun which is exactly what this let's you do. This made me laugh and forget all the bad stuff for a while, let's hope the boring naysayers don't stop a second series. Totally enjoyable, give at least 2 episodes a go.", "review-date": "30 November 2023", "review-score": "7"}, {"text": "Ok, Shakespeare it is not, but as far as a easy action, comedy movie this is like a flash from the nineties.It feels like they took a mix of A-Team, The Hangover and 24, and just went with it.. and by golly it works!Ava Winters is believable as a top notch intelligence officer with a backstory, who goes the nearly the entire movie without panties, and half that again without a bra.. and it barely matters, because the character is just *moah* perfect, and not in a \"spit in my mouth and like it or you're a mysogonist\" kinda way.Sadly Ferguson is the more \"realistic\" variant of a US intelligence officer.. but for 8 episodes, I was able to forget it. Kudos!Chad McKnight is the raunchy Rambo-wannabe we all were in the eighties, and the chemistry with Ava is on fire.Trunk is just delightful, how can you not like Trunk?Lana Lerner is tech girl, with the best use of whipped cream this century.Angela Gomez is the LGB that isn't actually suffocating, which in itself is unprecedented. Nothing remotely political about it. Alongside that she is a thoroughly enjoyable character.Hagerty is the bomb guy who kinda sails through the movie and you just gotta love everything he does.And the unsung hero of the show: Captain Paul Yung, absentee father and choppah pilot battling his demons in the most hilarious ways.Main cast aside, the villains are quirky and good, in the best of ways. Russians do make the best villains, though the swede was a nice touch.Story is reasonably predictable on the whole, but the little details that tie the story together is top notch artistic craftsmanship.I hope this is more along what we can expect in the future, though experience says otherwise.", "review-date": "3 December 2023", "review-score": "10"}, {"text": "A lot of fun to watch. The girls are gorgeous. Shelly Hennig is really good. She has comedic talent and delivers her lines so well you laugh out loud.There are a lot of laugh out loud funny scenes and lines.I haven't laughed this much watching a show in a long time. It looks like the actors are enjoying their roles. There is a lot of action. A lot of twists and turns so you are looking forward to the next episode.I hope they make a season two.If you want humor, action, a decent story this is it.Very fast paced. The bad guys were really bad. You'll recognize one in particular. He was born to play bad guy roles.", "review-date": "1 January 2024", "review-score": "8"}, {"text": "I had never heard of this show. I was scrolling through my Yahoo news feed and saw a review of the show. The title of the review was so condescending I just had to read it. The author obliterated the show (pun intended). She was extremely critical of all the sex and gratuitous nudity. She basically said the show was a waste of time.Of course, this made me want to watch it. I have to say, it lacks direction, the writing is poor, and there is a ton of filler to bloat it to eight episodes. Having said that, I LOVED THIS SHOW for the exact reasons the critic stated. It dumb as hell, but its a fun ride. The actors have really good chemistry and I binged watched it.An elite special forces crew thinks they have stopped a nuclear terrorist attack in Las Vegas, so to celebrate, they get hammered on a combination of drugs, alcohol, sex, and other basic debauchery (a camel is involved). They then learn the plot they stopped was a decoy, so they have 7 hours to stop the real bombing. Still obliterated (hence the title) they spend the next 7 hours whacked out of their minds while trying to find a briefcase nuke.Ava is a hardened CIA operative running the team who recently lost her fiance on a mission. McKinight is the Team Lead and resident hunk with an ego problem. Trunk is the muscle who can't ever seem to get something to eat. Gomez is the sniper, a Michelle Rodriguez knock off who is a lesbian and hides her emotions. Paul is the married helicopter pilot with family issues. Maya is the tech nerd who is in love with McKnight, but is too shy to say it. Lastly, there is Haggerty, the explosives expert who spends most of the series in a drug induced stupor. There is another character named Lana, a ditzy blonde who the team rescued during the original mission and she tags along as she has intimate knowledge of one of the villains. These characters all seem pretty standard on these types of shows, but the actors imbue them with just enough personality to make them stand out. Unfortunately, the villains are pretty one-dimensional which is really the biggest failing of the show.There are a ton of gunfights, fist fights, sex, graphic nudity, humor and some pretty extreme torture scenes. In fairness, all the actors wind up nude at some point so there is definitely no inequality there.Sadly, I think this is one of those one season events. The premise of the show could not be repeated and I don't think there is enough originality to the show for it to sustain a second season. Still, it was a fun watch and the show knew exactly what it was and didn't try to be anything else.", "review-date": "2 December 2023", "review-score": "7"}, {"text": "This show is horrible. I love it.An updated, contemporary take on old school early-'80s action television.Does it make sense? No.Are there plot holes? Absolutely.Is it riddled with tropes? All of the tropes.Sophomoric humor? So much!Is there any hint of realism or accuracy? None-whatsoever.This kind of craft seems to be a lost art. Back in the day, bad but enjoyable, entertaining television was intentionally created to help you relax at the end of a hard day.So much TV is unintentionally bad. But Obliterated revels in its unabashed badness. It is perfect in its execution.Just remember that the goal here is to unwind and experience guilty chuckles and eye rolls after a big TV dinner.In this endeavor, Obliterated exceeds all expectations. Each episode is non-stop fun.Go buy an ugly fabric recliner at an estate sale and enjoy this modern take on old classics.", "review-date": "7 December 2023", "review-score": "9"}, {"text": "Yes the dialogue is cringy at times and the acting isn't great.Yes its nonsensical and predictable.But it's also over the top super fun. Reminds me of 90's comedies where they didn't give a damn and just made fun movies.There's lots of comedy some of which I even burst out laughing which hasn't happened in a while. Action is decent with enough chases, gore, explosions, and fight scenes to keep it interesting. Then there's the over the top nudity scenes which are gross and sometimes hilarious.Is it the best thing that has ever came out... No.But it's an entertaining show worth watching.", "review-date": "4 December 2023", "review-score": "7"}, {"text": "If you're going to make a series about a super team of special soldiers getting high, drunk and zonked out of their heads while fighting Russians in Vegas and trying to find a suitcase nuke, go all the way.And they did with this series. It is dumb, it is funny and it doesn't slow down for a second. Just sit back and enjoy the ride. Is it unrealistic? Yes, thank god. Who wants realism in a fun, action series?None of the actors stands out but they're all perfect for their parts. C. Thomas Howell was unrecognizable, but he's pretty much unconscious for most of the episodes.This is not a piece of art and they didn't set out to make one. Good move!", "review-date": "16 December 2023", "review-score": "7"}]}, "Jujutsu Kaisen": {"Directors": "Junya Enoki, Yuma Uchida, Yûichi Nakamura", "Year of Release": "2020– ", "Content Rating": "16", "Runtime": "24m", "IMDB Rating": "8.6", "Reviews": [{"text": "I love it when an anime goes out of its way to surpass the manga in terms of quality, making it the definitive way to experience the story. Mangas are such a special form of art (being a combination of multiple paintings) that achieving this is difficult, yet Jujutsu nailed it perfectly. I adore the manga already and this anime totally lived up to and surpassed the hype, just amazing", "review-date": "7 December 2020", "review-score": "10"}, {"text": "Months ago, when I had first heard of Jujutsu Kaisen and its \"similarities\" with Bleach, which is one of my all-time favorite anime shows, I was very curious and the subsequently growing hype just added to the excitement. And as I finished it in merely two days, I was left very impressed and entertained to the core. Jujutsu Kaisen is MAPPA's striking new achievement which has set the bar for action anime shows, very high and hard to top.At first, the concept revolving around the talisman sounded very original, unique and seemed like something the whole thing would revolve around. That's where I was slightly surprised, since the show didn't follow it entirely and instead also focused on different characters, meaning the protagonist Yuji Itadori was not allowed to completely dominate the show, which is rare. Rather, his teacher and an absolute fan-favorite Satoru Gojo stole the show with his cool heroic moments, many of which can send a shiver down your spine! For a secondary character, he truly gets to shine a lot, and other characters one can actually expect to great primary treatment, mainly Itadori's friends Nobara and Megumi, too shine when the right time comes.The plot initially moves at a very fast pace, leaving little to no room for characters to grow on you easily. However, that is achieved later on as we get introduced to them again and again through the skillfully drawn, beautifully colored and overall masterfully crafted action scenes. Every fight sequence is executed with intensity and the right usage of music and colors just adds to the brilliance. I was very impressed with the usage of red, blue, white and black, in the last few episodes. MAPPA surely knows how to adapt a manga faithfully and breathe life into the story by using colors adequately and artistically.Plus, while it's also a lot gorier than I imagined, given this is still a shounen, even moments of gore seemed more like abstract art instead of mindless violence, which is a rare feat to achieve. Jujutsu Kaisen has strong characters, both male and female, and are used effectively throughout the 24 episodes. There's some humor too, as expected from any shounen, and it doesn't disappoint. But it's mostly the fight sequences that stand out as the show's biggest highlight. This is a pure action anime, so while some of you might have issues getting into the plot initially given the fast pace and nonstop action, it will slowly cast its spell on you and the effects will be visible in no time. Just make sure to grab some popcorn and beverages (something I unfortunately couldn't) before you sit down to binge this supernatural action thriller. You're in for one wild ride!", "review-date": "5 June 2021", "review-score": "10"}, {"text": "What an amazing anime Jujutsu Kaisen is.Studio Mappa with another magnificent job.The animation is awesome, especially the fights look breathtaking.So many great, loveable and fun characters with a very interesting story.Can't wait for the film and hopefully season 2!", "review-date": "27 June 2021", "review-score": "10"}, {"text": "One episode in and I feel like this is going to become a high tier anime . I just cant wait to see how episode 2 is . you will know why by the end of the first episode! trust me watch it its worth it .", "review-date": "3 October 2020", "review-score": "9"}, {"text": "I don't know how to describe the perfection of this anime. Great Characters, One of the greatest OP and Ending theme. Three reasons to watch this anime.\n1. Amazing Plot wid great animation\n2. Great music wid great action sequences\n3. Gojou Satoru\nThat's it.\nJust lacking few emotional Strings. Overall, worth watching every single episodes.", "review-date": "3 February 2021", "review-score": "10"}, {"text": "The plot is as follows Yuji Itadori, a kind-hearted teenager, joins his school's Occult Club for fun, but discovers that its members are actual sorcerers who can manipulate the energy between beings for their own use. He hears about a cursed talisman - the finger of Sukuna, a demon - and its being targeted by other cursed beings. Yuji eats the finger to protect his friends, and ends up becoming Sukuna's host. However, Yuji discovers that he has inherited magic and is able to control this power without interference from Sukuna. He joins the Tokyo Metropolitan Magic Technical College to consumes all of Sukuna's fingers, which will enable a full exorcism to take place that will free him.The anime is nothing short of a masterpiece.It has amazing fight scenes. Really good OST also good animation.", "review-date": "23 January 2022", "review-score": "9"}, {"text": "There's a lot of predictable elements and cliché in the overall story design, but the form is awesome.Characters, including the MC, are well written and occasional drop of motivation and backstory gives them decent depth. Power system has a lot of imagination in it and the tension that any character could die is good for the story telling.MAPPA (the studio) have made great job putting the story into motion.", "review-date": "27 March 2021", "review-score": "9"}, {"text": "Promising start and a good story , so far so good .", "review-date": "21 November 2020", "review-score": "10"}, {"text": "Honestly, I enjoyed this anime, because its story is different from the rest of the anime, but it had a few flaws that made me evaluate it 9 out of 10, but it didnt affect the fun of this anime", "review-date": "26 December 2020", "review-score": "8"}, {"text": "Returning back to the Shonen genre, I wasn't disappointed. Jujutsu Kaisen shows potential and good promise from its initial episodes.Hunting spirits/demons/evil things have been part of anime since times old, but that doesn't mean Jujutsu Kaisen is any way boring. Good execution of the story has kept me going through the episodes with eagerness to look forward to what's coming up. Along with instances of amazing action-animation sequences and decent characters, it is notable to appreciate the first opening and ending themes, having a nice taste of funk.A pleasing and interesting start. I'm not surprised this anime is an adaptation of Weekly Shonen Jump. The magazine has often led to manga-adaptations that are worth giving a watch.A good watch for Shonen-enthusiasts. Hasn't been disappointed as of yet. Looking forward to Jujutsu Kaisen during its run.", "review-date": "27 October 2020", "review-score": "10"}]}, "Migration": {"Directors": "Benjamin Renner, Guylo Homsy", "Year of Release": "2023", "Content Rating": "PG", "Runtime": "1h 23m", "IMDB Rating": "6.9", "Reviews": [{"text": "GREAT VALUES, LOVELY STORY, NO EXPLICIT THEMES!! I honestly took a step back when I first saw this. I am ALWAYS extremely critical of movies lately, especially since recently Illumination, Disney, and even a recent Dreamworks movie have fallen flat, but wow!This is truly a family film that is appealing to ALL audiences. Kids have laughs at gags, adults have entertainment from parenting and general themes, and they even poke fun at grandparents, who still are made out to be cool and fun-loving by the end.From both a filmmaker and huge movie fan's perspective, it is extremely refreshing to see a kids movie have good values, no explicit themes, and still be very entertaining! The story and plot was well worked out and everything made sense. The music was fantastic (a solid original score, no spammed pop music like most kids movies). The animation was adorable and very enjoyable to watch. It was also super refreshing to see new/underground talents showcased! A lot of less known names but a fantastic job done (especially the voice actors)!I'm really impressed and wish to express from the bottom of my heart, thank you for making such a great family film, creating a safe space for families to enjoy a movie without oversexualized themed, over the top toilet humor, extreme violence, etc. 9/10!!!", "review-date": "22 December 2023", "review-score": "9"}, {"text": "\"Migration\" is an excellent animated film whose script tells a story with familiar and educational touches, setting an example of dignity towards immigrants, all from the perspective of the ducks. The animation is tremendous, resulting in beautiful visuals, as well as amazing character design. The voice work of the actors is perfect, giving charisma to their characters and highlighting their personalities. The editing work is highly successful and intensifies the drama and comedy when they are required on screen. A production that makes the most of its potential and successfully achieves a story of family unity and dignity.", "review-date": "22 December 2023", "review-score": "10"}, {"text": "This has to be one of the better kids animations of the year or even a few years. It isn't pretentious and doesn't bang on the drum of morality. Rather its pure fun and hijinks.It starts off with the dad trying to scare the kids out of ever wanting to leave the pond, but in a very fun and funny opening. All is good for over protective dad until some exotic ducks land for a stop on their migratory flight south and fill the kids and mum with ideas about migrating to Jamaca. Dad tries to stop but is convinced to overcome his fears and take a chance.And that is the only moral part of the story, take a chance in life and face your fears and prejudices.From there on it's one rollercoaster of aride with lots of fun bits.Also, unlike a lot of animations, you aren't playing the game of oh that is such and such voice. The only really recognisable voice is Danny Divitto, who is perfectly cast as grumpy uncle Dan. The kids are relative unknowns but are perfect in timing and emotion.The animation is colourful but doesn't overwhelm the film either like some animation do.It also isn't overly long which is great and kids will love it and parents get lots of laughs.Yes it's not ground breaking but that's not the point.A perfect family fare, perfect for Christmas/ holidays.", "review-date": "22 December 2023", "review-score": "8"}, {"text": "I couldn't resist the chance to watch \"Migration\" ahead of its Boxing Day release date. From start to finish, my love for \"Migration\" only grew stronger. The film is an absolute delight - it's not just super cute and funny, but it's also packed with heartwarming moments that tug at your emotions. The characters bring such warmth and charm that you can't help but be drawn into their world.Beyond the humor and cuteness, \"Migration\" delivers a great message to stop waiting for life to happen to you. The animation is nothing short of fantastic, bringing the story to life with vibrant visuals and captivating sequences. \"Migration\" is a perfect blend of laughter, heart, and visual brilliance that makes it a must-watch for animation enthusiasts of all ages.", "review-date": "21 December 2023", "review-score": "7"}, {"text": "Overall, not a half bad illumination movie.The movie's environments were beautiful. Easily my favorite part of the movie. I loved the watercolor-esque trees. Also, the designs of some of the humans, especially the main antagonist, are pretty nice and creative. The jokes weren't nearly as \"cringey\", and landed for the most part. (hah, get it, cause the movies about ducks... migrating). The humor in this movie feels more family-focused, rather than purely for the kids.As for the negatives, the story is fairly linear, and not too interesting. The overall theme is very obvious, so it isn't too deep. All in all, a typical illumination movie.Overall, a decent Illumination movie. Just plain family fun. If you want to be fairly entertained, and laugh with your kiddos, this is a good movie.", "review-date": "23 December 2023", "review-score": "7"}, {"text": "I recently watched the movie Migration (2023) in theaters with my daughter. The storyline follows a northeastern family of ducks 🦆 who encounter a flock of migrating birds that invite them to fly south for the winter. Despite their usual winter stay, the family convinces the dad to fly to Jamaica 🇯🇲 this year, and an adventure ensues.This movie is co-directed by Benjamin Renner (Ernest & Celestine) and Guylo Homsy (Eddie's Life Coach) and features the voices of Kumail Nanjiani (Stuber), Danny DeVito (Twins), Awkwafina (Crazy Rich Asians), Keegan-Michael Key (Wonka), and Elizabeth Banks (The Hunger Games).The animation in this picture is outstanding, while the rest of the film is fairly average. The storyline is straightforward, with a few worthwhile subplots. I particularly enjoyed the husband and wife working together through various circumstances for the betterment of the family. The voices are well selected, and Awkwafina and DeVito comedic content keep the film well-paced. The conclusion is as expected, though its sequel potential remains uncertain.In conclusion, Migration is a fun family animated picture with enough worthwhile elements to make it worth a watch, but it doesn't stand out in the genre. I would score this a 5.5/10 and recommend seeing it once.", "review-date": "30 December 2023", "review-score": "6"}, {"text": "The animation is colorful, action starts relatively early and is well spaced-out. The jokes were appropriate. My kids are aged 10 and 14, they both enjoyed it. There were kids of all ages in the theatre and I could hear laughs all the time. Perfect for the holidays and also has a great soundtrack.The storyline is obvious in the title, but the journey was full of surprises enough to keep you on the edge. There were useful lessons to be learned and a morale to the story.The last film I had seen at the cinema was Super Mario and \"Migration\" has delivered the same clean family entertainment that we have been missing.Highly recommended.", "review-date": "16 December 2023", "review-score": "10"}, {"text": "I went with low expectations about this film because the trailers looked like the movie wasn't good, but after watching it i can say it's really worth the ticket.Visually there's nothing to complain about here the ducks and all kinds of birds that appear here look nice and are really expresive.Soundwise nothing outstanding, decent, you can hear every character clearly because all was mixed well. The ambient for all scenarios is done pretty well too (Swamps, cities, forrest)Storywise This is what i liked the most because it's not that dumb for an illumination movie, it has drama and funny moments throughout the entire run, but nothing too deep, just enough to be entertaining.I would say if you go alone or with your family you'll have a good time.", "review-date": "17 December 2023", "review-score": "7"}, {"text": "LIKES:Good Pace\n-The movie doesn't get lost in sitting around and stewing on the adventure, but rather gets the world established and ready to leap into the adventure within about 15 minutes\n-Once they take off, the movie keeps to a good pace that is fun, well-timed, and never getting too stuck in one place that it becomes too boring or off-putting of the story\n-And yet, the movie doesn't do the Fast and Furious approach of putting the petal to the metal and flooring through it to cram jokes.-Instead it does a nice job of giving that adventure nature and still respecting the character development and plot to help make this a movie that is far above the Nick Jr. And Disney Jr. Elements.Fantastic Animation\n-It might not be the highest grade in terms of realism, but Animation still shows how other studios than Disney can make cartoons come to life.-Ducks fly and soar in the style that mimics the natural movements of the ducks and other birds, in their steps, dives, and swoops. It's great attention to detail and part of the magic that animators make.-then comes the human elements in their forms, and what a surprise to see such great adaptations in the small fowl forms is humorous , charming, and just cute at times and brings the energy that this movie thrives on.-Wrap this all together and the smoothness of the animation is going to easily keep your eyes on the festivities of this dynasty in their migration to whatever they are searching for in their journey.-And the design with that goofy look on their faces that Illumination does adds more than takes away, sort of a subtle level that adds funny with little effort.Great Humor\n-A staple to these movies for me is to laugh and hope that I get more than just kid humor and cute sound effects and one liners.-Migration had my back and did not disappoint with the material presented and more so how appropriate it sticks to the rating they gave it.-Yes, there are plenty of the tropes for kids, silly smashing, lots of random lines, and annoying sounds that are going to be repeated.-Yet, the movie feels a bit like Bluey, actually geared towards adults with plenty of their perspective to help color this film in a shade that was far more enjoyable\n-Bed time stories gone wrong to help make a point, sarcasm that just sticks and matches the emotion so well that the combination of visual and sound are unbeatable for me.-And there are even a few jokes hidden within that for you to enjoy and find, that little extra sauce that makes this movie fun for all.-It's also balanced and well implemented, never getting to lost to overshadow everything else this movie achieves, again a part of the fun, not the whole fun that still gives an engaging story.The Opening Short:\n-It's of course geared to the Despicable Me audience, but the small tale and short is very fun and a little side story that curbs you to the Gruniverse.-I enjoyed the simple tale that bridges the gap, adds that silly level of humor found in that movie franchises, and was a nice bridge to warm us up.-One character is a surprise to see, but with them comes a funny Looney Tunes like motion that was very enjoyable, if not a tad long.Family Friendly, But Adult\n-This movie again can mirror the craze of Bluey in my eyes.-It's family friendly, easily watchable by all ages, but yet not so juvenile that older adults are going to be looking at their phones or fingernails to entertain themselves.-That humor I mentioned is one element, but the fact there are such great storytelling elements and character development really help make this movie easily more entertaining and relevant to the masses.-To have that balance helps really give the movie rewatchability to see what else you can find with the wit and cleverness of the animators' imaginations.Good Character Usage\n-And again, a good movie is loaded with engaging characters, and even more so using those characters to justify their inclusion is big for a reviewer like me.-Migration again succeeds in this task, granting you characters that are colorful in look and design, but also in personality and story.-The main flock is of course the stars, but surprisingly there is a lot of secondary characters that get some fantastic screen time, with a purpose and engagement that just doesn't tag them along for the ride.-The antagonist might not say much, but it doesn't matter, because even he has enough merit into his inclusion, and enough menace to fit in without being too much.-It's impressive to see them do this where others struggle, but applause for what hey crammed into about a 90 minute run time.Voice Acting\n-The crown jewel for me is the voices that brought so many characters to life and delivered that comedic punch with the haymaker that had me laughing.-The writing might be good, but I loved the execution as well, with just about everyone delivering solid performance.-DeVito needs more lines, but what he pulls off is perfect for the curmudgeon duck, with just that touch of dry sarcasm and lack of energy that is balanced so well.-Banks was that calming factor, her raspy and controlling voice a nice contrast to help calm the theatrics of the comical birds in this movie, and add that touch of different humor to the mi to help keep things diverse.-However, it is Nanjiani that was the best. His voice was made for an animated dock, so aggressive, high pitched, raspy, and that element of awkward composure that makes the humor so fun. And yet, still has the air of caring that leads to a great character that I enjoyed watching across the board.DISLIKES:More Needed\n-The adventure was great, but again, there seemed to be more needed to finish this migration to the South.-This film did the trick on many levels, but at the end of the movie, the adventure seemed to end a little faster and quicker than I expected.-Surely more things could have been done, or maybe not skip quite as much and lead to three minute montage to get home, especially given one last fun thing that could have been that last touch.-Throw in some of the other characters getting a little more development given the trauma they faced and well... I kind of would have liked to see that execution.-Minor to some, and moderate to others, a little more engaging design, even at the cost of the short, could have helped take this a bit further.Gwen Gets A Tad annoying\n-She might be the most adorable character, but it doesn't mean that she was my favorite.-Gwen's whininess at times is cute, but often is annoying to me, the high squeals, the excessive jokes of embarrassment, and the impatience just grating my nerves.-Her humor is definitely more like a kid focus approach and at times it works, but it was much lost on me and she gets a tad overwhelming for someone like me who just doesn't enjoy bratty kids.More Character Development\n-It started so well and I think that the movie kept most of this up, but... again there was still some elements that needed tinkering.-Some more challenges and merit to take the ducks to a new level and help them not have such an abrupt change.-In this type of movie, it's not quite as important to the key demographic, but with just that touch more story building could have taken this to the level of some of my favorite movies.The VERDICT:\nI really enjoyed my time with Migration, and found this animated feature to be quite engaging for me and many of the members in my showing. The animation is solid, cartoony and goofy, which works to capitalize on the writing and humor loaded into this journey. With that balance of adult and kid, the movie caters to all ages and should assist with making a movie that should keep the attention for the 90 minutes. A sensational voice cast and lots of time with the characters, only further brings out the fun and I really just had a fun time soaring through the skies through this quirky little family. Sure, more development could have helped add that added spice, and there could have been a few more engaging challenges and less Gwen. Yet, the movie still shines as an entertaining piece and I encourage this one in theaters for a fun outing, or at the least a watch at home.My scores are:Animation/Action/Adventure: 8.5\nMovie Overall: 8.0.", "review-date": "23 December 2023", "review-score": "9"}, {"text": "Been there, seen it. This felt a little bit like Finding Nemo meets Ice Age. Scared father doesn't want family to leave the confines of the known and safe. Finally they set off on a trek, totally unprepared for what's out there. They pick up some stragglers. They have a couple of adventures. They find themselves in peril then get out of it. Meanwhile there's little pearls of wisdom that's leaned by one and all. The bad guys are really bad. The good guys are really good. But no one gets seriouslt hurt, not even the bad guys. Eventually they reach their destination and everyone lives happily ever after. Until the next adventure.Cute jokes. Mostly for kids. Some kind for the adults. Nothing risqué or off color.The most entertaining part was the pre movie short (a Minons story) that also seemed like a remake (of a Roadrunner Wiley Coyote short). Hi hum.", "review-date": "31 December 2023", "review-score": "6"}]}, "Violent Night": {"Directors": "Tommy Wirkola", "Year of Release": "2022", "Content Rating": "A", "Runtime": "1h 52m", "IMDB Rating": "6.7", "Reviews": [{"text": "A wealthy family home is invaded by a group of criminals, their only hope is Santa Claus.I think this film may surprise a few, I was pleasantly surprised, action packed, violent, quietly amusing, I have a feeling that for those of us that adore Die Hard, and embrace it as a Christmas movie, this is probably going to be up your Street. I'm not sure it's deserving of cult status, but don't ask me why, I have a feeling that in years to come, this may well develop something of a following.The clue is in the title, Violent Night, and boy this film doesn't hold back, in terms of violence and manner of deaths, this film packs a real punch, you will see all sorts, people dismembered, shot, impaled, it really doesn't hold back.If Santa did actually pop down for a visit, I can imagine him being this disillusioned, this irritated, with a genuinely low opinion of people, this is where the film scores in my opinion, the performance of David Harbour, who is genuinely very good.Enjoyable music throughout, good special effects, plenty of action, Violent Night was a Christmas surprise.7/10.", "review-date": "6 January 2023", "review-score": "7"}, {"text": "Possibly the most tedious film question ever asked is, \"is Die Hard a Christmas movie?\" Violent Night says \"what if Die Hard WAS a Christmas movie?\"Its an excellent mix of two genres. First and foremost it's a (very violent) man in a tight spot action movie but hidden beneath is a traditional Christmas story of people becoming believers and a jaded main character getting their feative mojo back.The film success is largely down to David Harbour's fantastic turn as a disillusioned St Nick. His ability to project charisma even when appearing tired and fed up carries the day, or in this case, night. He also cleverly avoids the trap of playing Santa too dark, for all his boozing and necessary killing he is still recognisably Father Christmas. The rest of the cast are all decent as well, with John Leguiziamo making a fun villian. Even the child character manages to not be annoying, although some of her dialogue hints that they had originally wanted a younger actress than Leah Brady.The other big plus Violent Night has is its, well violence. The set pieces go above and beyond, with villians being impaled, burned and dismembered. Highlights include a Home Alone inspired sequence (turns out the invaders in this film are a lot less durable than Harry and Marv) and a Mortal Kombat worthy finish to the final showdown. There's also a decent vain of comedy even if you won't exactly be guffawing in the aisles.There are a couple of things that take you out of proceedings, like the bad guys refusal to just shoot their guns and some very generic family interactions, but overall Violent Night is a very fun couple of hours.8 lumps of coal for 10 naughty mercenaries.", "review-date": "30 December 2022", "review-score": "8"}, {"text": "This movie is a beautiful mixture of Die Hard, Home Alone, Thor... It also contains several cliches from other movies. Not a problem. Yes, it's predictable, but it is kind of different of what we usually recieve on Christmas, and I personally appreciate different movies.First, action, gore and scenarios are great. Also the main cast. I think almost everyone here does a great job. I really enjoyed music used here too. Great choices.Second, the script is predictable but at the same time, it keeps you entertained from beginning till the end. Raw action mixed with some goofy scenes.So, overall if you want to watch a different brutal action Christmas thriller, this one is for you.", "review-date": "25 December 2022", "review-score": "7"}, {"text": "And there's nothing wrong with that.When Violent Night is good, it's really good. It isn't always nearly as entertaining as it could be, but it definitely capitalises on its goofy premise in all the right ways at various points.The violence is blunt and rudimentary, but there's something strikingly effective about it. Each hit is loud and visceral, and many of the actual deaths are a lot more creative than I was expecting them to be, even if the violence leads me up to each death is pretty by-the-numbers.I was pleasantly surprised with the small but satisfying character arcs that the script weaves into the simple story. Santa is given a cynical outlook on humanity and himself to overcome, the family has tension to work out, and the mythology of Santa's backstory is actually given a twist to make his capacity for violence make sense in this movie.There's nothing particularly groundbreaking about any of this, but it's all crafted with care and it's investing enough that I could easily see myself watching this in subsequent years.Its aforementioned strengths help it largely overcome its weak supporting actors, dialogue that's sometimes so corny it's cringey, and its few too many scenes of characters sitting and talking.", "review-date": "2 December 2022", "review-score": "7"}, {"text": "Such a wonderful spin on a horror/comedy where Santa Claus is the hero! David Harbor is absolutely perfect for this role has the best voice and great thrill to see in anything he's in! To me this is one of the best Christmas movies out there along with Bad Santa. I would defiantly agree with anyone that loved Violent Night, it's a great mix of Home Alone, John Wick, and any horror Christmas movie. Tommy Wirkola directed a pure blast of entertainment! I sorta can see how it could get hate the family was a little obnoxious at times but I void that out cause everything else positive outweighs heaps.", "review-date": "2 December 2022", "review-score": "10"}, {"text": "Greetings again from the darkness. HO-HO-HO! Who is ready for the best ever Santa slasher movie? Admittedly, it's a narrow sub-genre and anyone that knows me or reads my reviews, knows full well that this is not the type of movie I typically recommend. However, it's the season for charity and director Tommy Wirkola (HANSEL & GRETEL: WITCH HUNTERS, 2013 - sequel in the works) and co-writers Pat Casey and John Miller (the screenwriters behind the \"Sonic the Hedgehog\" films) have gifted us an extremely violent and often very funny Christmas present, replete with a sledgehammer-slinging Santa Claus.We first meet an inebriated Santa (\"I'm on a break\") at a local pub, where he explains to a mall Santa why he has become so disenchanted with the job ... greedy, self-centered kids who only want more video games. The booze numbs Santa's disgust as he heads off on his sleigh ... and Wirkola delivers the first shocking moment as Santa's barf keys us into the type of twisted tale we are about to experience. David Harbour (best known for \"Stranger Things\" and HELLBOY, 2019) is absolutely all-in for this far-from-glamorous portrait of jolly ol' Saint Nick. On his rounds, Santa raids household liquor stashes while chomping on cookies and eschewing skim milk. He's a full-blown slob, yet still holds a soft spot for \"nice\" kids, while having little mercy for the \"naughty\" among us.Most of the story takes place at the Lightstone family compound, where one-percenter Gertrude (CHRISTMAS VACATION alum Beverly D'Angelo) is the foul-mouthed matriarch ruling over her entitled and unlikable family consisting of daughter Alva (Edi Patterson) and her airhead-actor husband Morgan (Cam Gigandet) and their poser teenage son Bert (Alexander Elliot). Also present for the festive evening are Gertrude's son Jason (Alex Hassell), his estranged wife Linda (Alexis Louder) and their precious 7-year-old daughter Trudy (Leah Brady). Santa arrives at the Lightstone mansion not long before a team of mercenaries, led by Mr Scrooge (John Leguizamo), storm the place and take the family members hostage. Their mission is to break into the family vault and abscond with $300 million in cash.What follows is a demented mash-up of DIE HARD (1989), HOME ALONE (1990), BAD SANTA (2003), and THOR (2011). Deadly weapons used here include your expected firearms, but also a finely-honed candy cane, an icicle, a skating shoe, and a Christmas tree star, among other holiday items. Most prominent is the sledgehammer wielded by Santa, and the flashback to his pre-Santa days for explanation. The violent action is plentiful, and it's well-balanced with countless lines of comedy. Surprisingly, there is a story nestled in amongst the mayhem, and the heart of it revolves around the bond between Santa and young Trudy. She's a true believer in him and that overrides his uncertainty about the job, and inspires him to stick around for the fight. Santa can't explain the mystique of Christmas \"magic\", but he does know an 1100 year marriage has its ups and downs.Obviously, this is not one for the kiddos (it's a hard R-rating), and they should be shielded from this Yuletide yuck. Director Wirkola has delivered an instant holiday classic for those seeking the bizarro world flicks contrasting to the more respectable family fare of IT'S A WONDERFUL LIFE and A CHRISTMAS STORY. Who would have ever thought that Festivus might be the safer holiday?Opens in theaters on December 2, 2022.", "review-date": "30 November 2022", "review-score": "7"}, {"text": "The first movie I watched in the new year, 2023. I regret not seeing it in the cinema. I really liked the movie. It was fun. It's like a family movie though, with lots of bloody scenes. There was a lot of inexplicable stuff about Santa in the movie. This shows that there will be a second movie. According to me. Acting was good. David Harbor was great again. I liked the movie overall, except for a few cringe scenes. The action scenes weren't bad either. It was a funny movie. It was a movie that didn't take itself seriously, but took it seriously at the same time. I recommend. It was one of the best movies of 2022 for me.", "review-date": "31 December 2022", "review-score": "7"}, {"text": "If you enjoy reading my Spoiler-Free thoughts, please follow my blog to read my full review :)\"Violent Night is one of the biggest surprises of the year, instantly becoming a contemporary Christmas classic! David Harbour expertly embodies a shockingly brutal, savage version of Santa Claus that somehow still delivers lovely messages.Fighting sequences feature truly violent practical stunts, taking advantage of the R rating to provide unmeasurable amounts of gore. Creative use of Christmas songs will leave audiences crying with laughter.A brilliant homage to the seasonal genre classics that should be seen in a packed theater!\"Rating: A-", "review-date": "30 November 2022", "review-score": "8"}, {"text": "As far as Christmas movies go, is this better than Die Hard? Of course not! However, it's no doubt a Christmas movie. David Harbor plays a Santa Claus who lost his Christmas spirit and gets it back by going total medieval on a gang of kidnappers looking to take a small fortune from the type of rich folks you hate the most over the Holiday season. Harbor's Santa reminds me a lot of his version of Hellboy, I think when it comes down to it both pictures are Metal as Hell, and it's like Mr. Stranger Things just doing vocals for both albums. Mr. John Leguizamo is in the flick as the naughtiest of naughty men (not as naughty as Hans Gruber, but who can be). Like a sick guitar riff Leguizamo brings his season experience as an actor to create an interesting and funny bad guy. Leaning towards the Home Alone factor, this movie is as violent as the title suggests, which is rare, really. The little kid in turns out to be worse than Kevin McCallister when it comes to projecting her home from criminal masterminds. It's like someone read the minds of every person that watches Die Hard on Christmas day and just wanted to give us something official. I appreciate that.", "review-date": "2 December 2022", "review-score": "7"}, {"text": "Violent Night may be just 10 mins too long but thankfully that doesn't stop it from executing it's beautiful premise extremely well. A super violent and really funny action movie that doesn't forget to bring the necessary heart and festive spirit as a Christmas movie.David Harbour gives a terrific lead performance as Santa, displaying an emotional range way beyond what's expected and delivering some truly heartwarming moments with Leah Brady who brings a boundless optimism to her adorably innocent character.Tommy Wirkola's direction is great, the action scenes are so much fun to watch, really inventive and always comprehensible. The music by Dominic Lewis is really good, combining the epic action movie pieces with more traditionally festive moments.", "review-date": "3 December 2022", "review-score": "8"}]}}}